<html>
<head>
<title>Le Java development tooling (JDT) d'Eclipse</title>
<meta http-equiv="Content-type" content="text/html; charset=ISO-8859-1">
<meta name="description" content="">
<meta name="keywords" content="java tutorial cours dej eclipse">
<meta name="robots" content="all">
<meta name="revisit-after" content="2 months">
<meta http-equiv="Content-Language" content="fr-FX">
<meta name="author" content="Jean Michel DOUDOUX">
<link href="dej_style.css" rel="stylesheet" type="text/css">
</head>
<body>
<!--ENTETE-->
<table border="0" cellpadding="2" cellspacing="0" width="100%" bgcolor="#7B7BC2">
<TBODY>
<tr>
<td rowspan="2" align="center" width="50">&nbsp;</td><td rowspan="2" align="center" width="50">
<A HREF="partie2.htm" ALT="Partie 2 : le d&eacute;veloppement en Java">
<img src="FlecheG.gif" alt="Partie 2 : le d&eacute;veloppement en Java" align="left" border="0" hspace="0" width="31" height="31">
</a>
</td>
<td rowspan="2" align="center" width="50">
<A HREF="chap008.htm" ALT="8. D&eacute;boguer du code Java">
<img src="FlecheD.gif" alt="8. D&eacute;boguer du code Java" align="left" border="0" hspace="0" width="31" height="31">
</a>
</td>
<td rowspan="2" align="center" >
<a href="javascript:window.print()">
<img src="imprimer.gif" width="46" height="40" align="middle" alt="Imprimer" border="0">
</a>
</td>
<td rowspan="2" align="center" >
<a href="index.htm">
<img src="index.gif" alt="Sommaire" align="middle" border="0" hspace="0" width="34" height="31">
</a>
</td>
<td rowspan="2" align="center" >
<a href="indexavecframes.htm"  target="_top">
<img src="frame.png" alt="Consulter avec table des matières" align="middle" border="0" hspace="0" width="46" height="40">
</a>
</td>
<td align="right">
<font color="#FFFFFF" size="5"><b><i>Développons en Java avec Eclipse&nbsp;&nbsp;</i></b></font><font color="#FFFFFF" size="-2"> v 0.80&nbsp;&nbsp;</font></td>
</tr>
<tr>
<td align="right"><font color="#FFFFFF" size="-2">Copyright (C) 2003-2007 Jean-Michel DOUDOUX &nbsp;&nbsp;</font></td>
</tr>
</TBODY>
</table>
<HR>

<p>&nbsp;</p>
<h1><!--idrefpage value="jdt" --><!--resumetitre value="D&eacute;taille le JDT qui fournit des outils pour permettre le d&eacute;veloppement avec Java" --><!--nchpdeb--><a name="chap_7">7. <!--nchpfin-->  Le Java Development Tooling (JDT)</a></h1>
<p>&nbsp;</p>
<!--chapitredeb-->
<div align="right">
  <table border="0" cellspacing="0" summary="titre">
    <tr>
      <td width="270"><img src="images/chapitre.gif" alt="chapitre" width="347" height="100" border="0"></td>
<td width="50">&nbsp;</td>
<td width="50" valign="top"><img src="images/7.gif" alt="7" width="62" height="83" border="0"></td>
    </tr>
  </table>
  <br>
</div>
<!--chapitrefin-->
<p>&nbsp;</p>
<div align="justify">
  <p>Le Java Development Tooling (JDT) est inclus dans Eclipse pour fournir des outils de d&eacute;veloppement en Java. Il inclus plusieurs plug-ins et apporte&nbsp;: </p>
  <ul>
    <li>les perspectives &quot;Java&quot; et &quot;Navigation Java&quot;</li>
    <li>les vues &quot;Packages&quot; et &quot;Hierarchie&quot;</li>
    <li>les &eacute;diteurs &quot;Java&quot; et &quot;Scrapbook&quot;</li>
    <li>les assistants&nbsp;: pour cr&eacute;er de nouveaux projets, packages, classes, interfaces, ...</li>
  </ul>
  <p>Dans l'espace de travail, il d&eacute;finit un projet de type particulier pour les projets Java. L'arborescence de ces projets contient un fichier particulier nomm&eacute; .classpath qui contient la localisation des biblioth&egrave;ques utiles &agrave; la compilation et &agrave; l'ex&eacute;cution du code.</p>
  <p>&nbsp;</p>
  <h2><!--nchpdeb--><a name="chap_7_1">7.1. <!--nchpfin-->    Les projets de type Java</a></h2>
  <p>Pour pouvoir d&eacute;velopper des entit&eacute;s en Java, il faut les regrouper dans un projet de type Java. </p>
  <p></p>
  <h3><!--nchpdeb--><a name="chap_7_1_1">7.1.1. <!--nchpfin-->    La cr&eacute;ation d'un nouveau projet Java</a></h3>
  <p>Dans la perspective &quot;Java&quot;, il y a plusieurs possibilit&eacute;s pour lancer l'assistant de cr&eacute;ation d'un nouveau projet : </p>
  <ul>
    <li>s&eacute;lectionner l'option &quot;Projet&quot; du menu &quot;Fichier/Nouveau&quot;</li>
    <li>s&eacute;lectionner l'option &quot;Nouveau/Projet&quot; du menu contextuel de la vue &quot;Packages&quot;</li>
  </ul>
  <p>L'assistant demande le type de projet &agrave; cr&eacute;er. </p>
  <p align="center"><img alt=""  src="images/java002.png" width="500" height="214"></p>
  <p>Pour demander directement la cr&eacute;ation d'un projet &quot;Java&quot;, il suffit de cliquer sur l'&icirc;cone <img alt=""  src="images/java001.jpg" width="23" height="22"> de la barre d'outils.</p>
  <p>L'assistant demande le nom du projet.</p>
  <p align="center"><img alt=""  src="images/java003.png" width="400" height="219"></p>
  <p>Ce nom de projet ne doit pas d&eacute;j&agrave; &ecirc;tre utilis&eacute; dans l'espace de travail courant sinon un message d'erreur est affich&eacute;.</p>
  <p align="center"><img alt=""  src="images/java004.png" width="400" height="105"></p>
  <p>En cliquant sur le bouton &quot;Fin&quot;, le projet est cr&eacute;&eacute; avec des param&egrave;tres par d&eacute;faut.</p>
  <p>Pour modifier certains param&egrave;tres avant la cr&eacute;ation du projet, suffit de cliquer sur le bouton &quot;Suivant&quot; : </p>
  <p align="center"><img alt=""  src="images/java005.png" width="400" height="313"></p>
  <p>La modification de ces param&egrave;tres sera d&eacute;taill&eacute;e dans la section suivante. Une fois les param&egrave;tres modifi&eacute;es, cliquer sur le bouton &quot;Fin&quot;. Le projet apparait dans la vue &quot;Packages&quot; de la perspective.</p>
  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse31.png" width="64" height="32" hspace="5"></td>
      <td>
  <p align="left">La version 3.1 d'Eclipse propose quelques fonctionnalit&eacute;s int&eacute;ressantes lors de la cr&eacute;ation d'un projet Java. </p>
  <p align="center"><img width=384 height=311 src="images/java184.png" v:shapes="_x0000_i1025"></p>
  <p align="left">S&eacute;lectionnez &quot;Projet Java&quot; et cliquez sur le bouton &quot;Suivant&quot;.</p>
  <p align="center"><img width=580 height=447 src="images/java185.png" v:shapes="_x0000_i1026"></p> 
  <p>La premi&egrave;re page de l'assistant propose des options pour faciliter la cr&eacute;ation du nouveau projet&nbsp;: </p> 
  <ul type=disc> 
    <li>le contenu du projet&nbsp;: pr&eacute;cise si le projet est un nouveau projet ou si le projet est import&eacute;</li> 
    <li>la conformit&eacute; JDK&nbsp;: pr&eacute;cise le JDK utilis&eacute; par le JDK</li> 
    <li>disposition du projet&nbsp;: pr&eacute;cise si les sources et les binaires compil&eacute;s sont m&eacute;lang&eacute;s &agrave; la racine ou stock&eacute;s dans des r&eacute;pertoires d&eacute;di&eacute;s.</li> 
  </ul> 
  <p>A partir de cette page, il est possible de demander la cr&eacute;ation d'un projet &agrave; partir de source existantes&nbsp;: dans ce cas, le projet n'est pas cr&eacute;er physiquement dans le <span class=SpellE>workspace</span>.</p> 
  <p align="center"><img width=344 height=492 src="images/java186.png" v:shapes="_x0000_i1027"></p> 
  <p>Pour cela, il faut cliquer sur «&nbsp;Cr&eacute;er un projet &agrave; partir d'une source existante&nbsp;» et cliquer sur le bouton «&nbsp;Parcourir&nbsp;».</p> 
  <p align="center"><img width=326 height=294 src="images/java187.png" v:shapes="_x0000_i1028"></p> 
  <p>S&eacute;lectionnez le r&eacute;pertoire et cliquez sur le bouton «&nbsp;OK&nbsp;»</p> 
  <p align="center"><img width=427 height=491 src="images/java188.png" v:shapes="_x0000_i1029"></p> 
  <p>Cliquez sur le bouton «&nbsp;Suivant&nbsp;»&nbsp;: le projet est ajout&eacute; dans le <span class=SpellE>workspace</span> et la page suivante de l'assistant est affich&eacute;e.</p> 
  <p align="center"><img width=459 height=430 src="images/java189.png" v:shapes="_x0000_i1030"></p> 
  <p>Cliquez sur le bouton «&nbsp;Terminer&nbsp;».</p> 
  <p>Il est possible de modifier la disposition du projet apr&egrave;s sa cr&eacute;ation en utilisant les propri&eacute;t&eacute;s du projet.</p> 
  <p align="center"><img width=423 height=406 src="images/java190.png" v:shapes="_x0000_i1031"></p> 
  <p>Cocher «&nbsp;Permettre des dossiers de sortie pour les dossiers source&nbsp;»</p> 
  <p align="center"><span lang=EN-GB><img width=423 height=411 src="images/java191.png" v:shapes="_x0000_i1032"> </span></p> 
  <p>S&eacute;lectionnez dans l'arborescence «&nbsp;Dossier de sortie&nbsp;» et cliquer sur le lien «&nbsp;Configurer les options du dossier de sortie&nbsp;»</p> 
  <p align="center"><img width=437 height=181 src="images/java192.png" v:shapes="_x0000_i1033"></p> 
  <p>Pour pr&eacute;ciser un r&eacute;pertoire particulier, s&eacute;lectionnez «&nbsp;Dossier de sortie sp&eacute;cifique&nbsp;»</p> 
  <p align="center"><img width=437 height=181 src="images/java193.png" v:shapes="_x0000_i1034"></p> 
  <p>Saisissez ou s&eacute;lectionnez le nom du r&eacute;pertoire et cliquez sur le bouton «&nbsp;OK&nbsp;»</p> 
  <p align="center"><img width=441 height=139 src="images/java194.png" v:shapes="_x0000_i1035"></p> 
  <p>Cliquez sur le bouton «&nbsp;OK&nbsp;»</p> 
  <p align="center"><img width=423 height=340 src="images/java195.png" v:shapes="_x0000_i1036"></p> 
  <p>Cliquez sur le bouton «&nbsp;Terminer&nbsp;».</p>	  
	  </td>
    </tr>
  </table><br>
    <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse32.png" width="64" height="32" align="center"></td>
      <td> <p>L'onglet &quot;Source&quot; de la page &quot;Param&egrave;tres Java&quot; s'est enrichi de deux options : &quot;Lier une source suppl&eacute;mentaire&quot; et &quot;Ajouter le projet au chemin de g&eacute;n&eacute;ration&quot;. </p> 
        <p align="center"><img width=580 height=451 src="images/java274.png"></p>
</td>
    </tr>
  </table>

  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_1_2">7.1.2. <!--nchpfin-->    Les param&egrave;tres d'un projet Java</a></h3>
  <p>Les principaux param&egrave;tres d'un projet peuvent &ecirc;tre modifi&eacute;s :</p>
  <ul>
    <li>lors de l'utilisation de l'assistant &agrave; la cr&eacute;ation du projet</li>
    <li>en s&eacute;lectionnant le menu contextuel &quot;Propri&eacute;t&eacute;s&quot; sur le projet s&eacute;lectionn&eacute; dans la vue &quot;Packages&quot; et de choisir &quot;Chemin de compilation Java&quot;</li>
  </ul>
  <p align="center"><img alt=""  src="images/java006.png" width="400" height="220"></p>
  <p>Les propri&eacute;t&eacute;s &quot;Chemin de compilation Java&quot; sont regroup&eacute;es dans quatres onglets : </p>
  <table width="100%" border="1" cellspacing="0" cellpadding="4">
    <tr>
      <td>Onglet</td>
      <td>R&ocirc;le</td>
    </tr>
    <tr>
      <td width="19%">Source</td>
      <td width="81%">Permet de pr&eacute;ciser le r&eacute;pertoire qui va contenir les sources et celui qui va contenir le r&eacute;sultat des compilations </td>
    </tr>
    <tr>
      <td>Projets</td>
      <td>Permet d'utiliser d'autre projet avec le projet courant</td>
    </tr>
    <tr>
      <td>Biblioth&egrave;ques</td>
      <td>Permet d'ajouter des biblioth&egrave;ques au projet</td>
    </tr>
    <tr>
      <td>Ordre et exportation</td>
      <td>Permet de pr&eacute;ciser l'ordre des ressources dans la classpath</td>
    </tr>
  </table>
  <br>
  <p>L'onglet &quot;Source&quot; permet de pr&eacute;ciser le r&eacute;pertoire qui va contenir les sources : par d&eacute;faut, c'est le r&eacute;pertoire du projet lui m&ecirc;me (l'option &quot;utiliser le dossier projet en tant que dossier source&quot; est s&eacute;lectionn&eacute;).</p>
  <p>Pour stocker les ressources dans un r&eacute;pertoire d&eacute;di&eacute;, il faut s&eacute;lectionner l'option &quot;Utiliser les dossiers sources contenus dans le projet&quot;. La liste permet de s&eacute;lectionner le ou les r&eacute;pertoires. </p>
  <p>Le bouton &quot;Cr&eacute;er un dossier&quot; ouvre une bo&icirc;te de dialogue qui demande le nom du r&eacute;pertoire.</p>
  <p align="center"><img alt=""  src="images/java007.png" width="437" height="124"></p>
  <p>Il suffit de saisir le nom, par exemple &quot;sources&quot; et cliquer sur le bouton &quot;OK&quot; </p>
  <p>Par d&eacute;faut, d&egrave;s qu'un premier r&eacute;pertoire contenant les sources est s&eacute;lectionn&eacute;, Eclipse propose de cr&eacute;er un r&eacute;pertoire bin qui va contenir le r&eacute;sultat des diff&eacute;rentes compilations.</p>
  <p align="center"><img alt=""  src="images/java008.png" width="436" height="115"></p>
  <p>La r&eacute;ponse &agrave; la question est libre mais il est pr&eacute;f&eacute;rable de r&eacute;pondre &quot;Oui&quot;.</p>
  <p>L'onglet &quot;Projets&quot; permet d'ajouter des projets contenus dans l'espace de travail au classpath.</p>
  <p align="center"><img alt=""  src="images/java009.png" width="400" height="177"></p>
  <p>Il suffit de cocher les projets &agrave; inclure dans le classpath.</p>
  <p>L'onglet &quot;Biblioth&egrave;ques&quot; permet d'ajouter des biblioth&egrave;ques externes au projet notamment des fichiers .jar.</p>
  <p align="center"><img alt=""  src="images/java010.png" width="400" height="273"></p>
  <p>Les biblioth&egrave;ques incluses dans le classpath du projet courant sont affich&eacute;es dans la liste.</p>
  <p>Pour ajouter une nouvelle biblioth&egrave;que contenue dans l'espace de travail, il suffit de cliquer sur &quot;Ajouter des fichiers jar&quot;. Pour ajouter des fichiers jar qui ne sont pas contenus dans l'epsace de travail, il suffit de cliquer sur le bouton &quot;Ajouter des fichiers jar externes&quot;.</p>
  <p align="center"><img alt=""  src="images/java011.png" width="453" height="295"></p>
  <p>Une boite de dialogue permet de s&eacute;lectionner le fichier jar. En cliquant sur le bouton &quot;Ouvrir&quot;, le fichier jar est ajout&eacute; dans la liste.</p>
  <p>Le bouton &quot;Avanc&eacute;es ... &quot; permet d'ajouter d'autres entit&eacute;s au classpath notamment des r&eacute;pertoires qui contiennent des fichiers compil&eacute;s.</p>
  <p align="center"><img alt=""  src="images/java012.png" width="285" height="183"></p>
  <p>Le bouton &quot;Editer&quot; permet de modifier les caract&eacute;ristiques de la biblioth&egrave;que (son chemin d'acc&egrave;s dans le cas d'un fichier jar).</p>
  <p>Le bouton &quot;Supprimer&quot; permet de supprimer une biblioth&egrave;que du classpath.</p>
  <p>L'onglet &quot;Ordre et exportation&quot; permet de modifier l'ordre des biblioth&egrave;ques dans le classpath, de pr&eacute;ciser la cible des &eacute;l&eacute;ments g&eacute;n&eacute;r&eacute;s (le r&eacute;pertoire qui va les contenir) et de d&eacute;finir les ressources qui seront utilisables par les autres projets de l'espace de travail lorsque le projet sera li&eacute; avec eux.</p>
  <p>&nbsp;</p>
  <h2><!--nchpdeb--><a name="chap_7_2">7.2. <!--nchpfin-->    La cr&eacute;ation d'entit&eacute;</a></h2>
  <p>Dans un projet Java, il est possible de cr&eacute;er diff&eacute;rentes entit&eacute;s qui entrent dans sa composition : les packages, les classes et les interfaces.</p>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_2_1">7.2.1. <!--nchpfin-->La cr&eacute;ation de packages</a></h3>
  <p>Il est possible de cr&eacute;er les packages &agrave; l'avance m&ecirc;me si ceux ci peuvent &ecirc;tre cr&eacute;er automatiquement en m&ecirc;me temps qu'une classe qui la contient. Pour cr&eacute;er un nouveau package, il y a plusieurs possibilit&eacute;s : </p>
  <ul>
    <li>cliquer sur la fl&egrave;che de l'ic&ocirc;ne <img alt=""  src="images/java014.png" width="36" height="22"> de la barre d'outils de la perspective &quot;Java&quot; et s&eacute;lectionner &quot;Package&quot;</li>
    <li>cliquer sur l'ic&ocirc;ne <img alt=""  src="images/java013.jpg" width="23" height="23"> de la barre d'outils de la perspective &quot;Java&quot;</li>
    <li>s&eacute;lectionner l'option &quot;Package&quot; du menu &quot;Fichier / Nouveau&quot;</li>
  </ul>
  <p>L'assistant demande le nom du package.</p>
  <p align="center"><img alt=""  src="images/java016.png" width="438" height="242"></p>
  <p>Cliquez sur le bouton &quot;Fin&quot;, pour cr&eacute;er le nouveau package. Le package apparait dans la vue &quot;Packages&quot;.</p>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_2_2">7.2.2. <!--nchpfin-->La cr&eacute;ation de classes</a></h3>
  <p>Un assistant facilite la cr&eacute;ation de la classe. Cette cr&eacute;ation d'une classe peut se faire&nbsp;:</p>
  <ul type=disc>
    <li>soit en cliquant sur l'&icirc;c&ocirc;ne <img alt=""  width=23 height=22 src="images/java017.png">  dans la barre d'outils</li>
    <li>soit en s&eacute;lectionnant l'option Classe du menu "&nbsp;Fichier/Nouveau&nbsp;"</li>
  </ul>
  <p align="center"> <img alt=""  width=400 height=392 src="images/java018.png"> </p>
  <p>L'assistant demande de renseigner les diff&eacute;rentes caract&eacute;ristiques de la nouvelle classe&nbsp;: le projet et le package d'appartenance, le nom, les modificateurs, la classe m&egrave;re, les interfaces impl&eacute;ment&eacute;es. Enfin, il est possible de demander &agrave; l'assistant de g&eacute;n&eacute;rer certaines m&eacute;thodes.</p>
  <p>Si un projet ou un package est s&eacute;lectionn&eacute; dans la vue &quot;Packages&quot;, celui ci est automatiquement repris par l'assistant.</p>
  <p>L'ajout d'une interface impl&eacute;ment&eacute;e se fait en la s&eacute;lectionnant dans une liste.</p>
  <p align="center"> <img alt=""  width=317 height=311 src="images/java019.png"> </p>
  <p>Pour ajouter une interface, il suffit de double cliquer dessus ou de la s&eacute;lectionner et d'appuyer sur le bouton "Ajouter". Une fois toutes les interfaces ajout&eacute;es, il suffit de cliquer sur le bouton "OK".</p>
  <p>Toutes les m&eacute;thodes d&eacute;finies dans la ou les interfaces s&eacute;lectionn&eacute;es seront pr&eacute;sentes dans le code source de la classe g&eacute;n&eacute;r&eacute;e. Si le package saisi n'existe pas dans le projet, celui ci sera cr&eacute;&eacute; en m&ecirc;me temps que la classe.</p>
  <p>Une fois toutes les donn&eacute;es utiles renseign&eacute;es, il suffit de cliquer sur le bouton "&nbsp;Fin&nbsp;" pour que la classe soit g&eacute;n&eacute;r&eacute;e et que l'&eacute;diteur s'ouvre avec le contenu de son code source.</p>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_2_3">7.2.3. <!--nchpfin-->La cr&eacute;ation d'interfaces</a></h3>
  <p>La cr&eacute;ation d'une interface peut se faire&nbsp;:</p>
  <ul type=disc>
    <li>en cliquant sur l'ic&ocirc;ne <img alt=""  width=23 height=22 src="images/java020.png">  dans la barre d'outils</li>
    <li>en s&eacute;lectionnant l'option Interface du menu "&nbsp;Fichier/Nouveau&nbsp;"</li>
  </ul>
  <p>Un assistant facilite la cr&eacute;ation de l'interface.</p>
  <p align="center"> <img alt=""  width=400 height=306 src="images/java021.png"> </p>
  <p>L'assistant demande de renseigner les diff&eacute;rentes caract&eacute;ristiques de la nouvelle interface&nbsp;: le projet et le package d'appartenance, le nom, les modificateurs ainsi que les &eacute;ventuelles interfaces h&eacute;rit&eacute;es.</p>
  <p>Une fois toutes les donn&eacute;es utiles renseign&eacute;es, il suffit de cliquer sur le bouton "&nbsp;Fin&nbsp;" pour que l'interface soit g&eacute;n&eacute;r&eacute;e et que l'&eacute;diteur s'ouvre avec le contenu de son code source.</p>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_2_4">7.2.4. <!--nchpfin-->La cr&eacute;ation de classe et de package par copier/coller du code source dans l'explorateur de package</a></h3>
  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse32.png" width="64" height="32" align="center"></td>
      <td>  <p>Cette fonctionnalit&eacute; permet de cr&eacute;er une classe et
    &eacute;ventuellement le package associ&eacute; en copiant le code source de la classe &agrave;
    partir du contenu du presse papier (par exemple remplie par la copie du code &agrave;
    partir d'un &eacute;diteur externe) et en collant le contenu sur un projet de
    l'explorateur de package (Ctrl+V ou option «&nbsp;coller&nbsp;» du menu
    contextuel).</p>
  <table border="1" cellpadding="4" cellspacing="0" width="100%" align=center >
    <tr bgcolor="#A6A5C2">
      <td>Exemple :</td>
    </tr>
    <tr>
      <td>
        <pre><code>package fr.jmdoudoux.test.cetc;

public class Test {

  public static void main(String[] args) {
    System.out.println(&quot;test&quot;);
  }
}</code></pre>
      </td>
    </tr>
  </table>
  <br>
<P>&nbsp;</P>
  <p>La classe et le package sont automatiquement cr&eacute;&eacute;s.</p>
  <p align="center"><img width=253 height=89 src="images/java211.png"></p>
  <p>Attention&nbsp;: pour que la cr&eacute;ation du package puisse &ecirc;tre
    r&eacute;alis&eacute;, il faut absolument que le coller se fasse sur un projet.</p></td>
    </tr>
  </table>
<p>&nbsp;</p>
  <h2><!--nchpdeb--><a name="chap_7_3">7.3. <!--nchpfin-->    Le support de Java 5.0</a></h2>
  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse31.png" width="64" height="32" hspace="5"></td>
      <td>
  <p>Eclipse 3.1 propose un support complet de Java 5.0.</p> 
  <p>La version de Java &agrave; utiliser dans un projet peut &ecirc;tre pr&eacute;cis&eacute;e lors de la cr&eacute;ation d'un projet&nbsp;:</p> 
  <p align="center"><img width=580 height=447 src="images/java185.png"></p> 
  <p>Par d&eacute;faut, c'est la version 1.4 qui sera utilis&eacute;e par d&eacute;faut. Pour pr&eacute;ciser une version diff&eacute;rente, il suffit de cocher «&nbsp;Utiliser une compatibilit&eacute; propre au projet&nbsp;» et de s&eacute;lectionner la version &agrave; utiliser dans la liste d&eacute;roulante.</p> 
  <p>Il est possible de modifier la version du JDK &agrave; utiliser dans les pr&eacute;f&eacute;rences du projet.</p> 
  <p align="center"><img width=580 height=423 src="images/java196.png" v:shapes="_x0000_i1038"></p> 
  <p>Il suffit de s&eacute;lectionner «&nbsp;Compilateur Java&nbsp;» dans l'arborescence et de s&eacute;lectionner la version du JDK &agrave; utiliser.</p> 
  <p align="center"><img width=441 height=146 src="images/java197.png" v:shapes="_x0000_i1039"></p> 
  <p>Cliquez sur «&nbsp;Oui&nbsp;» pour recompiler l'int&eacute;gralit&eacute; du projet avec la nouveau JDK.</p>	  
	  </td>
    </tr>
  </table><br>

  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_3_1">7.3.1. <!--nchpfin-->La cr&eacute;ation d'une &eacute;num&eacute;ration</a></h3> 
  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse31.png" width="64" height="32" hspace="5"></td>
      <td>
	    <p>Il est possible de cr&eacute;er une &eacute;num&eacute;ration en demandant la cr&eacute;ation d'une entit&eacute; de type «&nbsp;Java/Enum&eacute;ration&nbsp;».</p> 
  <p align="center"><img width=580 height=395 src="images/java198.png" v:shapes="_x0000_i1040"></p> 
  <p>Il faut saisir le nom du package et le nom de la classe.</p> 
  <p>Si le projet n'est pas configur&eacute; pour utiliser le JDK 5.0, un message d'erreur est affich&eacute;</p> 
  <p align="center"><img width=398 height=95 src="images/java199.png" v:shapes="_x0000_i1041"></p> 
  <p>En cliquant le bouton «&nbsp;Terminer&nbsp;», la classe est g&eacute;n&eacute;r&eacute;e&nbsp;:</p>
    <table border="1" cellpadding="4" cellspacing="0" width="100%" align=center >
    <tr bgcolor="#A6A5C2">
      <td>Exemple :</td>
    </tr>
    <tr>
      <td>
        <pre><code>package com.jmd.test; 

public enum MonStyle { 
}</code></pre>
      </td>
    </tr>
  </table>
  <br>
  <p>Il suffit alors de compl&eacute;ter la classe avec les diff&eacute;rentes valeurs qui composent l'&eacute;num&eacute;ration</p> 
  <table border="1" cellpadding="4" cellspacing="0" width="100%" align=center >
    <tr bgcolor="#A6A5C2">
      <td>Exemple :</td>
    </tr>
    <tr>
      <td>
        <pre><code>package com.jmd.test; 

public enum MonStyle { 
  STYLE_1, STYLE2, STYLE_3 
}</code></pre>
      </td>
    </tr>
  </table>
  <br>
	  </td>
    </tr>
  </table><br>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_3_2">7.3.2. <!--nchpfin-->La cr&eacute;ation d'une annotation</a></h3> 
  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse31.png" width="64" height="32" hspace="5"></td>
      <td>
  <p>Il est possible de cr&eacute;er une annotation en demandant la cr&eacute;ation d'une entit&eacute; de type «&nbsp;Java/Annotation&nbsp;».</p> 
  <p align="center"><img width=580 height=320 src="images/java200.png" v:shapes="_x0000_i1042"></p> 
  <p>Si le projet n'est pas configur&eacute; pour utiliser le JDK 5.0, un message d'erreur est affich&eacute;.</p> 
  <p align="center"><img width=395 height=96 src="images/java201.png" v:shapes="_x0000_i1043"></p> 	  
	  </td>
    </tr>
  </table><br>
  <p>&nbsp;</p>
  <h2><!--nchpdeb--><a name="chap_7_4">7.4. <!--nchpfin-->Le support de Java 6.0 par le compilateur</a></h2>
  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse32.png" width="64" height="32" align="center"></td>
      <td>  <p>Dans les propri&eacute;t&eacute;s du projet, il est possible de pr&eacute;ciser
    dans «&nbsp;Compilateur Java&nbsp;» le support de Java 6.0. Pour modifier la
    version de Java, cochez la case «&nbsp;Activer les param&egrave;tres propres au
    projet&nbsp;» </p>
  <p align="center"><img width=580 height=218 src="images/java257.png"></p>
  <p>S&eacute;lectionnez la version 6.0 dans la liste d&eacute;roulante.</p>
  <p align="center"><img width=441 height=146 src="images/java258.png"></p>
  <p>Cliquez sur le bouton «&nbsp;Oui&nbsp;» pour recompiler tous
    les fichiers sources avec une cible (  target  ) 1.6.</p>
  <p>Remarque&nbsp;: pour que cela fonctionne correctement, il
    est n&eacute;cessaire qu'un JDK 6.0 soit install&eacute; sur la machine et configur&eacute; dans
    Eclipse.</p></td>
    </tr>
  </table>
  <p>&nbsp;</p>
  <h2><!--nchpdeb--><a name="chap_7_5">7.5. <!--nchpfin-->    Les vues du JDT</a></h2>
  <p>Le JDT contient les vues &quot;Packages&quot; et &quot;Hi&eacute;rarchie&quot;</p>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_5_1">7.5.1. <!--nchpfin-->    La vue &quot;Packages</a>&quot;</h3>
  <p>Cette vue permet d'afficher de fa&ccedil;on arborescente le contenu des diff&eacute;rents packages d&eacute;finis et utilis&eacute;s dans chaque projet ainsi que les biblioth&egrave;ques utilis&eacute;es par le projet. </p>
  <p>Pour les &eacute;l&eacute;ments contenant du code source, l'arborescence sous jacente permet de voir les diff&eacute;rents membres qui composent l'&eacute;l&eacute;ment.</p>
  <p>Un double clic sur des &eacute;l&eacute;ments de l'arborescence, permet d'ouvrir l'&eacute;diteur directement sur l'&eacute;l&eacute;ment s&eacute;lectionn&eacute;.</p>
  <p align="center"> <img alt=""  width=298 height=225 src="images/java022.png"> </p>
  <p>Chaque &eacute;l&eacute;ment de l'arborescence poss&egrave;de une petite ic&ocirc;ne en fonction en son type&nbsp;:</p>
  <table border=1 cellspacing=0 cellpadding=4 width="100%">
    <tr>
      <td valign=top>
        <p align=center>Ic&ocirc;ne</p>
      </td>
      <td valign=top>
        <p>Type de l'&eacute;l&eacute;ment</p>
      </td>
    </tr>
    <tr>
      <td valign=top>
        <p align=center> <img alt=""  width=18 height=16 src="images/java023.png"> </p>
      </td>
      <td valign=top>
        <p>Projet de type Java</p>
      </td>
    </tr>
    <tr>
      <td valign=top>
        <p align=center> <img alt=""  width=15 height=15 src="images/java024.png"> </p>
      </td>
      <td valign=top>
        <p>Package</p>
      </td>
    </tr>
    <tr>
      <td valign=top>
        <p align=center> <img alt=""  width=13 height=17 src="images/java025.png"> </p>
      </td>
      <td valign=top>
        <p>El&eacute;ment Java&nbsp;: classe ou interface</p>
      </td>
    </tr>
    <tr>
      <td valign=top>
        <p align=center> <img alt=""  width=15 height=15 src="images/java026.png"> </p>
      </td>
      <td valign=top>
        <p>Interface Java</p>
      </td>
    </tr>
    <tr>
      <td valign=top>
        <p align=center> <img alt=""  width=15 height=15 src="images/java027.png"> </p>
      </td>
      <td valign=top>
        <p>Classe public Java</p>
      </td>
    </tr>
    <tr>
      <td valign=top>
        <p align=center> <img alt=""  width=17 height=18
  src="images/java028.png"> </p>
      </td>
      <td valign=top>
        <p>Classe Java pouvant &ecirc;tre ex&eacute;cut&eacute;e (poss&eacute;dant une m&eacute;thode main())</p>
      </td>
    </tr>
    <tr>
      <td valign=top>
        <p align=center> <img alt=""  width=17 height=17
  src="images/java029.png"> </p>
      </td>
      <td valign=top>
        <p>Classe protected</p>
      </td>
    </tr>
    <tr>
      <td valign=top>
        <p align=center> <img alt=""  width=17 height=17
  src="images/java030.png"> </p>
      </td>
      <td valign=top>
        <p>Classe package friendly </p>
      </td>
    </tr>
    <tr>
      <td valign=top>
        <p align=center> <img alt=""  width=16 height=17
  src="images/java031.png"> </p>
      </td>
      <td valign=top>
        <p>Classe private</p>
      </td>
    </tr>
    <tr>
      <td valign=top>
        <p align=center> <img width=9 height=10
  src="images/java032.png" alt="*"> <img alt=""  width=13 height=14
  src="images/java033.png">   <img alt=""  width=13 height=14
  src="images/java034.png">   <img alt=""  width=15 height=14
  src="images/java035.png">  </p>
      </td>
      <td valign=top>
        <p>Champ public</p>
      </td>
    </tr>
    <tr>
      <td valign=top>
        <p align=center> <img alt=""  width=11 height=13
  src="images/java036.png">   <img alt=""  width=13 height=14
  src="images/java037.png">   <img alt=""  width=12 height=15
  src="images/java038.png">   <img alt=""  width=15 height=15
  src="images/java039.png"> </p>
      </td>
      <td valign=top>
        <p>Champ private</p>
      </td>
    </tr>
    <tr>
      <td valign=top>
        <p align=center> <img alt=""  width=9 height=12
  src="images/java040.png">   <img alt=""  width=14 height=15
  src="images/java041.png">   <img alt=""  width=13 height=15
  src="images/java042.png">   <img alt=""  width=14 height=16
  src="images/java043.png">  </p>
      </td>
      <td valign=top>
        <p>Champ protected</p>
      </td>
    </tr>
    <tr>
      <td valign=top>
        <p align=center> <img width=11 height=10
  src="images/java044.png" alt="*">   <img alt=""  width=14 height=14
  src="images/java045.png">   <img alt=""  width=15 height=15
  src="images/java046.png"> <img alt=""  width=15 height=16
  src="images/java047.png"> </p>
      </td>
      <td valign=top>
        <p>Champ package friendly</p>
      </td>
    </tr>
    <tr>
      <td valign=top>
        <p align=center> <img width=12 height=12
  src="images/java048.png" alt="*">   <img alt=""  width=13 height=16
  src="images/java049.png">   <img alt=""  width=13 height=16
  src="images/java050.png">   <img alt=""  width=13 height=17
  src="images/java051.png">   </p>
      </td>
      <td valign=top>
        <p>M&eacute;thode public </p>
      </td>
    </tr>
    <tr>
      <td valign=top>
        <p align=center> <img alt=""  width=11 height=12
  src="images/java052.png">   <img alt=""  width=13 height=16
  src="images/java053.png">   <img alt=""  width=13 height=16
  src="images/java054.png">   <img alt=""  width=14 height=17
  src="images/java055.png"> </p>
      </td>
      <td valign=top>
        <p>M&eacute;thode private</p>
      </td>
    </tr>
    <tr>
      <td valign=top>
        <p align=center> <img alt=""  width=12 height=12
  src="images/java056.png">   <img alt=""  width=15 height=17
  src="images/java057.png">   <img alt=""  width=13 height=16
  src="images/java058.png">   <img alt=""  width=16 height=17
  src="images/java059.png"> </p>
      </td>
      <td valign=top>
        <p>M&eacute;thode protected</p>
      </td>
    </tr>
    <tr>
      <td valign=top>
        <p align=center> <img alt=""  width=10 height=11 src="images/java060.png">   <img alt=""  width=14 height=16
  src="images/java061.png">   <img alt=""  width=14 height=16 src="images/java062.png">   <img alt=""  width=15 height=17
  src="images/java063.png"> </p>
      </td>
      <td valign=top>
        <p>M&eacute;thode package friendly</p>
      </td>
    </tr>
  </table><br>
  <p>Le bouton <img alt=""  width=23 height=22 src="images/java064.png"> permet de masquer les champs d&eacute;finis dans les &eacute;l&eacute;ments Java.</p>
  <p>Le bouton <img alt=""  width=23 height=22 src="images/java065.png"> permet de masquer les membres statiques.</p>
  <p>Le bouton <img alt=""  width=23 height=22 src="images/java066.png"> permet de masquer tous les membres qui ne sont pas publics.</p>
  <p>Il est possible de restreindre les entit&eacute;s affich&eacute;es dans la vue package. Il suffit de cliquer sur bouton <img alt=""  width=23 height=22 src="images/java067.png">   et de s&eacute;lectionner l'option "&nbsp;Filtres&nbsp;".</p>
  <p align="center"> <img alt=""  width=412 height=418 src="images/java068.png"> </p>
  <p>Il suffit de cocher les filtres qui doivent &ecirc;tre appliqu&eacute;s.</p>
  <p>A partir de l'&eacute;diteur, il est possible de s&eacute;lectionner dans la vue &quot;Package&quot;, l'&eacute;l&eacute;ment en cours d'&eacute;dition en utilisant l'option &quot;Afficher dans la vue package&quot; du menu contextuel.</p>
  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse32.png" width="64" height="32" align="center"></td>
      <td>  <p>Par d&eacute;faut, toutes les entit&eacute;s contenant du code source Java
    sont pr&eacute;sent&eacute;es avec la m&ecirc;me icône.</p>
  <p align="center"><img width=252 height=87 src="images/java230.png"></p>
  <p>Il est possible de demander l'utilisation d'une icône d&eacute;di&eacute;e
    pour les interfaces, les classes abstraites, les annotations et les
    &eacute;num&eacute;rations en utilisant les Pr&eacute;f&eacute;rences.</p>
  <p align="center"><img width=580 height=259 src="images/java231.png"></p>
  <p>Dans l'arborescence «&nbsp;G&eacute;n&eacute;ral / Apparence / D&eacute;corations
    d'intitul&eacute;s&nbsp;», il suffit de cocher «&nbsp;Indicateur de type Java&nbsp;»
    et de cliquer sur le bouton «&nbsp;OK&nbsp;».</p>
  <p align="center"><img width=252 height=84 src="images/java232.png"></p></td>
    </tr>
  </table>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_5_2">7.5.2. <!--nchpfin-->La vue &quot;Hi&eacute;rarchie&quot;</a></h3>
  <p>Cette vue affiche la hi&eacute;rarchie d'un &eacute;l&eacute;ment. Pour afficher la hi&eacute;rarchie d'un &eacute;l&eacute;ment, il y a plusieurs possibilit&eacute;s&nbsp;: </p>
  <ul type=disc>
    <li>dans la vue Package s&eacute;lectionner l'&eacute;l&eacute;ment et utiliser l'option &quot;Ouvrir la hi&eacute;rarchie des types&quot; du menu contextuel.</li>
    <li>dans l'&eacute;diteur, utiliser le menu contextuel &quot;Ouvrir la hi&eacute;rarchie des types&quot; </li>
  </ul>
  <p>Elle se compose de deux parties&nbsp;: </p>
  <ul type=disc>
    <li>une partie sup&eacute;rieure qui affiche la hi&eacute;rarchie de l'&eacute;l&eacute;ment.</li>
    <li>une partie inf&eacute;rieure qui affiche la liste des membres de l'&eacute;l&eacute;ment</li>
  </ul>
  <p align="center"> <img alt=""  width=294 height=205 src="images/java069.png"> </p>
  <p>Le bouton <img alt=""  width=36 height=22 src="images/java070.png">  permet de s&eacute;lectionner dans un historique un &eacute;l&eacute;ment qui a d&eacute;j&agrave; &eacute;t&eacute; affich&eacute; dans la vue.</p>
  <p align="center"> <img alt=""  width=375 height=130 src="images/java071.png"> </p>
  <p>Il suffit de s&eacute;lectionner l'&eacute;l&eacute;ment concern&eacute; et de cliquer sur le bouton &quot;OK&quot;.</p>
  <p>Le bouton <img alt=""  width=23 height=22 src="images/java072.png">  permet d'afficher la hi&eacute;rarchie des classes m&egrave;res et des interfaces qu'elles impl&eacute;mentent de l'&eacute;l&eacute;ment courant.</p>
  <p align="center"> <img alt=""  width=294 height=200 src="images/java073.png"> </p>
  <p>Le bouton menu permet de changer la pr&eacute;sentation de la vue&nbsp;: </p>
  <ul type=disc>
    <li> <img alt=""  width=18 height=19 src="images/java074.png"> &nbsp;: les deux parties sont affich&eacute;es horizontalement</li>
    <li> <img alt=""  width=18 height=19 src="images/java075.png"> &nbsp;: les deux parties sont affich&eacute;es verticalement</li>
    <li> <img alt=""  width=18 height=19 src="images/java076.png"> &nbsp;: n'affiche que la partie qui pr&eacute;sente la hi&eacute;rarchie</li>
  </ul>
  <p>Le bouton <img alt=""  width=23 height=22 src="images/java077.png"> permet de masquer les champs.</p>
  <p>Le bouton <img alt=""  width=23 height=22 src="images/java078.png"> permet de masquer les membres statiques.</p>
  <p>Le bouton <img alt=""  width=23 height=22 src="images/java079.png"> permet de masquer tous les membres qui ne sont pas publics.</p>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_5_3">7.5.3. <!--nchpfin-->La vue &quot;Javadoc&quot;</a></h3>
  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse30.png" width="64" height="32" align="center"></td>
      <td> <p>La vue &quot;Javadoc&quot; permet d'afficher la documentation de l'&eacute;l&eacute;ment s&eacute;lectionn&eacute; dans la perspective &quot;Java&quot;. </p>
        <p align="center">  <img src="images/java180.png" width="477" height="265">        </p></td></tr>
  </table>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_5_4">7.5.4. <!--nchpfin-->La vue &quot;D&eacute;claration&quot;</a></h3>
  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse30.png" width="64" height="32" align="center"></td>
      <td> <p>La vue &quot;D&eacute;claration&quot; permet d'afficher le code de l'&eacute;l&eacute;ment s&eacute;lectionn&eacute; dans la perspective &quot;Java&quot;. </p>
        <p align="center"><img src="images/java182.png" width="477" height="185"></p></td>
    </tr>
  </table>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_5_5">7.5.5. <!--nchpfin-->La vue Erreurs</a></h3>

  <p>Cette vue les erreurs et en particulier celles concernant  les erreurs dans le code source des classes Java.</p>
  <p>Pour afficher cette vue, il utiliser le menu principal  &laquo;&nbsp;Fen&ecirc;tre / Afficher la vue / Autre ... &nbsp;&raquo;</p>
        <p align="center"><img src="images/java213.png" width="184" height="161"></p>
		<p>S&eacute;lectionnez « T&acirc;ches de base / Erreurs » dans l'arborescence et cliquez sur le bouton « OK »</p>		
        <p align="center"><img src="images/java214.png" width="596" height="124"></p>
		<p>Il est possible d'ouvrir l'&eacute;diteur directement sur la ligne  concern&eacute;e par l'erreur en double cliquant sur l'erreur concern&eacute;e.</p>
        <p>Il est possible&nbsp;  d'appliquer des filtres sur cette vue qui par d&eacute;faut s'applique &agrave; tout  le plan de travail. </p>
        Il suffit de cliquer sur le bouton
  <img src="images/java215.png" width="23" height="22">
        pour ouvrir la bo&icirc;te de dialogue  &laquo;&nbsp;Filtres&nbsp;&raquo;.
        <p align="center"><img src="images/java216.png" width="422" height="522"></p>
		<p>Le filtre peut limiter l'affichage des erreurs concernant un  type, un ensemble de ressources, contenant tout ou partie d'une description et  le niveau de gravit&eacute; des erreurs.</p>
        Il est aussi possible de trier les erreurs dans un ordre particulier.  Pour cela, il faut ouvrir le menu d&eacute;roulant en cliquant sur le bouton <img src="images/java217.png" width="18" height="22">
        et s&eacute;lectionner l'option &laquo;&nbsp;Tri ... &nbsp;&raquo;.
        <p align="center"><img src="images/java218.png" width="401" height="278"></p>
		<p>Le tri peut se faire sur quatre crit&egrave;res parmi ceux propos&eacute;s  en pr&eacute;cisant pour chaque le sens de l'ordre de tri.</p>  
        <p>Pour appliquer le tri, il suffit de cliquer sur le bouton  &laquo;&nbsp;OK&nbsp;&raquo;.</p>
  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse32.png" width="64" height="32" align="center"></td>
      <td>  <p>La vue affiche les diff&eacute;rentes erreurs regroup&eacute;es par
    type.</p>
        <p align="center"><img width=567 height=131 src="images/java219.png"></p>
  <p>Le bouton <img width=24 height=22 src="images/java220.png"> permet de g&eacute;rer les filtres</p>
  <p align="center"><img width=580 height=295 src="images/java221.png"></p>
  <p>Cliquez sur le bouton «&nbsp;Nouveau&nbsp;»</p>
  <p align="center"><img width=399 height=151 src="images/java222.png"></p>
  <p>Saisissez le nom du filtre et cliquez sur le bouton «&nbsp;OK&nbsp;»</p>
  <p>Saisissez les caract&eacute;ristiques du filtre et cliquez sur le
    bouton «&nbsp;OK&nbsp;»</p>
  <p>Le bouton <img width=18 height=22 src="images/java223.png"> affiche le menu d&eacute;roulant : le filtre cr&eacute;&eacute; peut &ecirc;tre s&eacute;lectionn&eacute; dans le sous menu
    filtres</p>
  <p align="center"><img width=224 height=134 src="images/java224.png"></p>
  <p>Le menu «&nbsp;Regrouper par&nbsp;» permet de s&eacute;lectionner
    le type de regroupement</p>
  <p align="center"><img width=320 height=136 src="images/java225.png"></p>
  <p>Exemple avec un regroupement par gravit&eacute;</p>
  <p align="center"><img width=556 height=165 src="images/java226.png"></p>
  <p>Exemple avec un regroupement par Type</p>
  <p align="center"><img width=556 height=149 src="images/java227.png"></p>
  <p>Exemple avec un regroupement par type d'erreur Java</p>
  <p align="center"><img width=557 height=165 src="images/java228.png"></p>
  <p>L'option «&nbsp;Pr&eacute;f&eacute;rences&nbsp;» du menu permet de
    modifier les param&egrave;tres</p>
  <p align="center"><img width=364 height=134 src="images/java229.png"></p></td>
    </tr>
  </table>
        <p>&nbsp;</p>
        <h3><!--nchpdeb--><a name="chap_7_5_6">7.5.6. <!--nchpfin-->La vue Historique</a></h3>
  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse32.png" width="64" height="32" align="center"></td>
      <td>  <p>La vue Historique affiche ensemble les diff&eacute;rentes versions
    des &eacute;l&eacute;ments de l'historique local et &eacute;ventuellement du syst&egrave;me de gestion de
    version connect&eacute;s au projet.</p>
  <p>Pour l'afficher, il faut utiliser l'option «&nbsp;afficher
    la vue / autres&nbsp;» du menu principal fen&ecirc;tre.</p>
  <p align="center"><img width=237 height=210 src="images/java212.png"></p>
  <p>Il faut s&eacute;lectionner l'&eacute;l&eacute;ment «&nbsp;Historique&nbsp;» dans
    «&nbsp;Equipe&nbsp;».</p></td>
    </tr>
  </table>
  <p>&nbsp;</p>  
  <h2><!--nchpdeb--><a name="chap_7_6">7.6. <!--nchpfin-->L'&eacute;diteur de code</a></h2>
  <p>Le JDT propose un &eacute;diteur d&eacute;di&eacute; au fichier contenant du code Java. Il propose des fonctionnalit&eacute;s particuli&egrave;rement pratiques pour le d&eacute;veloppement de code Java notamment&nbsp;: </p>
  <ul type=disc>
    <li>la coloration syntaxique</li>
    <li>la compl&eacute;tion de code</li>
    <li>le formatage du code source</li>
    <li>l'importation et l'exportation de code via un assistant</li>
    <li>une forte synergie avec le d&eacute;bogueur</li>
  </ul>
  <p>Pour ouvrir un &eacute;l&eacute;ment dans l'&eacute;diteur, il y a deux fa&ccedil;ons principales&nbsp;:</p>
  <ul type=disc>
    <li>double cliquer sur un &eacute;l&eacute;ment dans la vue &quot;Navigateur&quot;</li>
    <li>double cliquer sur un &eacute;l&eacute;ment dans la vue &quot;Packages&quot;</li>
  </ul>
  <p>L'&eacute;diteur peut &ecirc;tre invoqu&eacute; sur un fichier .java ou un fichier .class. Dans le cas d'un fichier .class, si le fichier source est disponible dans l'IDE, alors l'&eacute;diteur affiche le contenu du code source. </p>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_6_1">7.6.1. <!--nchpfin-->    Utilisation de l'&eacute;diteur de code</a></h3>
  <p>La ligne ou se situe le curseur appara&icirc;t en gris.</p>
  <p align="center"> <img alt=""  width=513 height=125 src="images/image201.png"> </p>
  <p>De chaque c&ocirc;t&eacute; de la zone d'&eacute;dition, il y a une colonne qui peut contenir de petites ic&ocirc;nes pour fournir des informations &agrave; l'utilisateur.</p>
  <p>Par exemple, si l'on fait h&eacute;riter une classe d'une classe dont le package n'est pas import&eacute;, un clic sur la petite ampoule jaune permet d'obtenir des propositions de corrections.</p>
  <p align="center"> <img alt=""  width=475 height=162 src="images/java080.png"> </p>
  <p>Il suffit de s&eacute;lectionner une des actions propos&eacute;es dans la liste pour que celle ci soit automatiquement mise en oeuvre. Un aper&ccedil;u des modifications impliqu&eacute;es par l'action s&eacute;lectionn&eacute;e est affich&eacute; dans une bulle d'aide.</p>
  <p>Le bouton <img alt=""  width=23 height=22 src="images/image202.png"> de la barre d'outils permet, s'il est s&eacute;lectionn&eacute;, d'afficher une bulle d'aide contenant des informations sur l'&eacute;l&eacute;ment sous lequel est le curseur.</p>
  <p align="center"> <img alt=""  width=400 height=80 src="images/image203.png"> </p>
  <p>Une description plus d&eacute;taill&eacute;e peut &ecirc;tre obtenue en positionnant le curseur sur l'&eacute;l&eacute;ment et en appuyant sur la touche F2 ou en s&eacute;lectionnant l'option "&nbsp;Afficher une description de type infobulles&quot; du menu "&nbsp;Editer&nbsp;".</p>
  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse30.png" width="64" height="32" align="center"></td>
      <td><p> Les m&eacute;thodes h&eacute;rit&eacute;es qui sont r&eacute;&eacute;crites sont signal&eacute;es par une petite ic&ocirc;ne. </p>
        <p align="center"><img src="images/java167.png" width="466" height="262"></p>
        <p> Un clic sur cette petite ic&ocirc;ne permet d'ouvrir l'&eacute;diteur sur la m&eacute;thode de la classe m&egrave;re. </p>
        <p align="center"><img src="images/java168.png" width="466" height="258"></p>
      </td>
    </tr>
  </table>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_6_2">7.6.2. <!--nchpfin-->    Compl&eacute;tion de code</a></h3>
  <p>La compl&eacute;tion de code permet de demander &agrave; l'IDE de proposer des suggestions pour terminer le morceau de code en cours d'&eacute;criture. Dans l'&eacute;diteur Eclipse, pour l'activer, il suffit d'appuyer sur les touches Ctrl et espace en m&ecirc;me temps.</p>
  <p align="center"><img alt=""  width=400 height=220 src="images/java130.png" ></p>
  <p>Cette fonction peut &ecirc;tre appel&eacute;e alors qu'aucune ou une partie du code &agrave; compl&eacute;ter est saisie.</p>
  <p align="center"><img alt=""  width=401 height=357 src="images/java081.png" ></p>
  <p>La compl&eacute;tion de code s'adapte au contexte dans lequel elle est appel&eacute;e. Par exemple, elle peut &ecirc;tre appel&eacute;e pour compl&eacute;ter une clause d'importation. Dans ce cas, elle propose une liste de packages en tenant compte du code d&eacute;j&agrave; saisi.</p>
  <p align="center"><img alt=""  width=439 height=241 src="images/java082.png" ></p>
  <p>L'&eacute;diteur peut g&eacute;n&eacute;rer la structure d'un commentaire Javadoc dans le source. Par exemple, avant une m&eacute;thode, il suffit de saisir /** puis d'appuyer sur la touche "&nbsp;Entr&eacute;e&nbsp;".</p>
  <p align="center"><img alt=""  width=373 height=210 src="images/java086.png" ></p>
  <p>L'appel de la compl&eacute;tion de code en appuyant sur les touches Ctrl + Espace permet aussi de faciliter la saisie des commentaires de type Javadoc.</p>
  <p align="center"><img alt=""  width=400 height=134 src="images/java087.png" ></p>
  <p>La compl&eacute;tion de code permet de g&eacute;n&eacute;rer une classe interne &agrave; partir d'une interface. </p>
  <p align="center"><img src="images/java134.png" width="405" height="86"></p>
  <p align="justify">Apr&egrave;s la saisie de la parenth&egrave;se ouvrante, il suffit d'appuyer sur les touches Ctrl + Espace. L'&eacute;diteur va g&eacute;n&eacute;rer la classe interne qui impl&eacute;mente l'interface. </p>
  <p align="center"><img src="images/java135.png" width="428" height="165"></p>
  <p>Il suffit de rajouter le&nbsp;; &agrave; la fin de la d&eacute;claration de la classe interne et mettre le code n&eacute;cessaire &agrave; la place du commentaire repr&eacute;sentant une t&acirc;che &agrave; faire. </p>
  <p>La compl&eacute;tion de code permet aussi de d&eacute;finir des m&eacute;thodes d&eacute;finies dans une interface impl&eacute;ment&eacute;e dans la classe ou de red&eacute;finir une m&eacute;thode h&eacute;rit&eacute;e.</p>
  <p align="center"><img src="images/java136.png" width="495" height="201"></p>
  <p>Dans le code du corps de la classe, il suffit d'appuyer directement sur les touches Ctrl + Espace. L'&eacute;diteur propose la liste des m&eacute;thodes &agrave; impl&eacute;menter ou &agrave; r&eacute;d&eacute;finir en fonction de la d&eacute;claration de la classe. </p>
  <p>La signature de la m&eacute;thode s&eacute;lectionn&eacute;e est g&eacute;n&eacute;r&eacute; dans le code. </p>
  <p align="center"><img src="images/java137.png" width="400" height="170"></p>
  <p>Par d&eacute;faut, dans le cas de la red&eacute;finition d'une m&eacute;thode, l'appel &agrave; la m&eacute;thode correspondante de la classe m&egrave;re est appel&eacute;e.</p>
  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse32.png" width="64" height="32" align="center"></td>
      <td>  <p>Il est possible d'invoquer l'assistant de code en saisissant
    uniquement les premi&egrave;res lettres capitalis&eacute;es de l'entit&eacute; d&eacute;sir&eacute;e</p>
  <p>Exemple&nbsp;:</p>
  <p align="center"><img width=467 height=211 src="images/java267.png"></p>
  <p>Cette possibilit&eacute; peut &ecirc;tre d&eacute;sactiv&eacute;e en d&eacute;cocher la case
    «&nbsp;Afficher les correspondances avec majuscules et minuscules&nbsp;» dans les
    pr&eacute;f&eacute;rences «&nbsp;Java/Editeur/Affiche l'assistant de contenu&nbsp;».</p>
  <p>&nbsp;</p>
  <p>L'appel de l'assistant de contenu affiche les propositions regroup&eacute;es par cat&eacute;gories.</p>
  <p>Exemple&nbsp;: saisir do dans l'&eacute;diteur de code Java et appuyer sur Ctrl+espace</p>
  <p align="center"><img width=426 height=220 src="images/java268.png"></p>
  <p>un second appui sur Ctrl+espace affiche une autre cat&eacute;gorie de propositions</p>
  <p align="center"><img width=426 height=215 src="images/java269.png"></p>
  <p>Le mode de fonctionnement peut &ecirc;tre configur&eacute; dans les pr&eacute;f&eacute;rences</p>
  <p align="center"><img width=580 height=425 src="images/java270.png"></p>
  </td>
    </tr>
  </table>  
  <p>&nbsp;</p>  
  <h3><!--nchpdeb--><a name="chap_7_6_3">7.6.3. <!--nchpfin-->    Affichage des param&egrave;tres sous la forme d'une bulle d'aide</a></h3>
  <p>Il est quasiment impossible de retenir les arguments n&eacute;cessaires &agrave; toutes les m&eacute;thodes de toutes les classes utilis&eacute;es. L'&eacute;diteur d'Eclipse propose d'afficher sous la forme d'une bulle d'aide, les param&egrave;tres avec leur type pour la m&eacute;thode en cours de r&eacute;daction dans le code.</p>
  <p>Pour utiliser cette fonction, il suffit d'appuyer sur les touches Ctrl + Maj + Espace en m&ecirc;me temps dans l'&eacute;diteur pendant la saisie d'un ou des param&egrave;tres d'une m&eacute;thode.</p>
  <p align="center"><img alt=""  width=350 height=75 src="images/java083.png" ></p>
  <p>Si la m&eacute;thode est surcharg&eacute;e, alors Eclipse demande de choisir la m&eacute;thode &agrave; utiliser pour ainsi  d&eacute;terminer avec pr&eacute;cision les param&egrave;tres &agrave; afficher dans la bulle d'aide.</p>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_6_4">7.6.4. <!--nchpfin-->    Hi&eacute;rarchie de type dans une bulle d'aide</a></h3>
  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse30.png" width="64" height="32" align="center"></td>
      <td><p>Il est possible demander dans l'&eacute;diteur de code d'afficher une bulle d'aide contenant la hi&eacute;rarchie d'un type. Pour cela, il suffit de mettre le curseur sur un type, une m&eacute;thode ou un package et d'appuyer sur la combinaison de touches Ctrl+T. </p>
        <p align="center"><img src="images/java147.png" width="408" height="163"></p>
      </td>
    </tr>
  </table>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_6_5">7.6.5. <!--nchpfin-->    Affichage des membres dans une bulle d'aide</a></h3>
  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse30.png" width="64" height="32" align="center"></td>
      <td><p> Il est possible demander dans l'&eacute;diteur de code d'afficher une bulle d'aide contenant la liste des membres d'un type. Pour cela, il suffit de mettre le curseur sur un type ou une m&eacute;thode et d'appuyer sur la combinaison de touches Ctrl+F3. </p>
        <p align="center"><img src="images/java148.png" width="249" height="230"></p>
        <p> Il est possible de filtrer les &eacute;l&eacute;ments en saisissant les premiers caract&egrave;res des membres &agrave; afficher&nbsp;: </p>
        <p align="center"><img src="images/java149.png" width="248" height="160"></p></td>
    </tr>
  </table>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_6_6">7.6.6. <!--nchpfin-->    L'&eacute;diteur et la vue Structure</a></h3>
  <p>Il existe un lien entre l'&eacute;diteur et la vue "Structure". Si cette vue est visible dans la perspective, d&egrave;s que le curseur se d&eacute;place sur un membre de la classe en cours d'&eacute;dition, le membre concern&eacute; est automatiquement s&eacute;lectionn&eacute; dans la vue "Structure".</p>
  <p align="center"> <img alt=""  width=400 height=125 src="images/image206.png"> </p>
  <p>Les lignes concernant le membre s&eacute;lectionn&eacute; sont marqu&eacute;s par une partie gris&eacute;e dans la colonne de gauche de l'&eacute;diteur.</p>
  <p>Les modifications apport&eacute;es dans le code source (ajout, modification ou suppression de membres) sont automatiquement r&eacute;percut&eacute;es dans la vue &quot;Structure&quot;.</p>
  <p>Le bouton <img alt=""  width=23 height=22 src="images/image207.png"> de la barre d'outils permet de limiter l'affichage dans l'&eacute;diteur du membre s&eacute;lectionn&eacute; dans la vue &quot;Structure&quot;.</p>
  <p align="center"> <img alt=""  width=400 height=78 src="images/image208.png"> </p>
  <p>Pour r&eacute;afficher le source complet, il suffit de cliquer de nouveau sur le bouton.</p>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_6_7">7.6.7. <!--nchpfin-->    La coloration syntaxique</a></h3>
  <p>L'&eacute;diteur poss&egrave;de une fonction de coloration syntaxique. Par d&eacute;faut, les &eacute;l&eacute;ments  sont color&eacute;s de la fa&ccedil;on suivante&nbsp;: </p>
  <ul type=disc>
    <li >les mots cl&eacute;s mots du langage sont color&eacute;s en violet gras</li>
    <li >les cha&icirc;nes de caract&egrave;res sont en bleu</li>
    <li >les commentaires sont en vert</li>
    <li >les commentaires Javadoc sont en bleu plus clair</li>
    <li >les balises Javadoc sont en gris</li>
    <li >les autres &eacute;l&eacute;ments sont en noir</li>
  </ul>
  <P>Exemple&nbsp;:</P>
  <P align="center"><img alt=""  width=366 height=238 src="images/image209.png"></p>
  <p>Il est possible de modifier ces couleurs par d&eacute;faut dans les pr&eacute;f&eacute;rences (menu Fen&ecirc;tres/Pr&eacute;f&eacute;rence)</p>
  <p>Il faut s&eacute;lectionner l'&eacute;l&eacute;ment Java/Editeur dans l'arborescence. Cet &eacute;l&eacute;ment poss&egrave;de quatre onglets. L'onglet syntaxe permet de modifier les couleurs.</p>
  <p align="center"> <img alt=""  width=400 height=278 src="images/image210.png"> </p>
  <p>Il suffit de s&eacute;lectionner l'&eacute;l&eacute;ment concern&eacute; dans la liste d&eacute;roulante et de s&eacute;lectionner la couleur qui lui est associ&eacute;e en cliquant sur le bouton couleur. Une bo&icirc;te de dialogue permet de s&eacute;lectionner la nouvelle couleur &agrave; utiliser.</p>
  <p align="center"> <img alt=""  width=222 height=324 src="images/image211.png"> </p>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_6_8">7.6.8. <!--nchpfin-->    Utilisation des mod&egrave;les</a></h3>
  <p>Il suffit de saisir le nom du mod&egrave;le et d'appuyer sur les touches Ctrl + espace en m&ecirc;me temps</p>
  <p>Exemple : avec le mod&egrave;le if</p>
  <p align="center"> <img alt=""  width=540 height=87 src="images/image213.png"> </p>
  <p>Il suffit de s&eacute;lectionner le mod&egrave;le &agrave; ins&eacute;rer pour qu'il soit imm&eacute;diatement ins&eacute;rer dans le code.</p>
  <p>Il est possible d'ajouter, de modifier ou de supprimer un mod&egrave;le en utilisant les pr&eacute;f&eacute;rences (menu Fen&ecirc;tre/Pr&eacute;f&eacute;rences).</p>
  <p>Il suffit de s&eacute;lectionner dans l'arborescence &quot;Java/Mod&egrave;les&quot;</p>
  <p align="center"> <img alt=""  width=400 height=326 src="images/image214.png"> </p>
  <p>Pour modifier un mod&egrave;le, il suffit de cliquer sur le bouton &quot;Editer&quot;</p>
  <p align="center"> <img alt=""  width=403 height=270 src="images/image215.png"> </p>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_6_9">7.6.9. <!--nchpfin-->    La gestion des importations</a></h3>
  <p>Il est possible de faire ins&eacute;rer la clause import pour un &eacute;l&eacute;ment utilis&eacute; dans le code. Pour cela, il suffit de mettre le curseur sur l'&eacute;l&eacute;ment concern&eacute; et de s&eacute;lectionner l'option "&nbsp;Source/Ajout d'une instruction d'import&nbsp;" ou d'appuyer sur les touches Ctrl + Maj + M.</p>
  <p>Si l'&eacute;l&eacute;ment est d&eacute;clar&eacute; dans un package unique, la clause import est automatiquement g&eacute;n&eacute;r&eacute;e. Sinon une bo&icirc;te de dialogue demande de s&eacute;lectionner l'&eacute;l&eacute;ment pour lequel la clause import sera g&eacute;n&eacute;r&eacute;e.</p>
  <p align="center"> <img alt=""  width=386 height=174 src="images/image216.png"> </p>
  <p>La fonctionnalit&eacute;  &quot;Organisation des importations&quot; est tr&egrave;s pratique car elle permet d'ins&eacute;rer automatiquement les clauses imports avec les package requis par le code.</p>
  <p>Par exemple&nbsp;: une variable de type Socket est d&eacute;clar&eacute;e, sans que le package java.net ne soit import&eacute;</p>
  <p align="center"> <img alt=""  width=480 height=177 src="images/image217.png"> </p>
  <p>Pour ajouter automatiquement la clause d'importation, il suffit d'utiliser l'option &quot;Source/Organiser les importations&quot; du menu contextuel.</p>
  <p align="center"> <img alt=""  width=481 height=200 src="images/image218.png"> </p>
  <p>La clause import est ins&eacute;r&eacute;e dans le code. Si un &eacute;l&eacute;ment est contenu dans plusieurs packages, une bo&icirc;te de dialogue demande la s&eacute;lection du type &agrave; importer.</p>
  <p align="center"> <img alt=""  width=361 height=194 src="images/image219.png"> </p>
  <p>Cette fonctionnalit&eacute; supprime aussi automatiquement les importations qui sont inutiles car aucune classe incluse dans ces packages n'est utilis&eacute;e dans le code.</p>
  <p>Certains r&eacute;glages de cette fonctionnalit&eacute; peuvent &ecirc;tre effectu&eacute;s dans les pr&eacute;f&eacute;rences (menu &quot;Fen&ecirc;tre/Pr&eacute;f&eacute;rences&quot;). Il suffit de s&eacute;lectionner "&nbsp;Java/Organisation des importations&nbsp;" dans l'arborescence.</p>
  <p align="center"> <img alt=""  width=400 height=325 src="images/image220.png"> </p>
  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse30.png" width="64" height="32" align="center"></td>
      <td><p>Les importations sont mises &agrave; jour lors d'un copier/coller d'une portion de code source. Cette nouvelle fonctionnalit&eacute; tr&egrave;s pratique permet lors d'un copier/coller d'un morceau de code d'une classe dans une autre de mettre &agrave; jour les importations requises.</p>
        Attention&nbsp;: cette fonctionnalit&eacute; ne s'applique que si le copier et le coller est fait dans Eclipse. </td>
    </tr>
  </table>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_6_10">7.6.10. <!--nchpfin-->Le tri des membres</a></h3>
   <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse32.png" width="64" height="32" align="center"></td>
      <td>  <p>Cette fonctionnalit&eacute; est accessible en utilisant l'option
    «&nbsp;Source / Trier les membres ...&nbsp;» du menu contextuel de l'&eacute;diteur de
    code Java.</p>
  <p align="center"><img width=432 height=252 src="images/java275.png"></p>
  <p>Cette bo&icirc;te de dialogue permet de s&eacute;lectionner les membres
    impact&eacute;s par le tri. </p>
  <p>Cliquez sur le bouton «&nbsp;OK&nbsp;» pour demander le tri
    des membres du code source.</p>
  <p align="center"><img width=441 height=171 src="images/java276.png"></p>
  <p>Cliquez sur le bouton «&nbsp;OK&nbsp;» apr&egrave;s  avoir pris connaissance du message
    d'avertissement.</p>
  <p>Le lien «&nbsp;Ordre de tri des membres&nbsp;» permet
    d'ouvrir les pr&eacute;f&eacute;rences sur l'arborescence «&nbsp;Java / Apparence / Ordre de
    tri des membres ...&nbsp;».</p>
  <p align="center"><img width=580 height=431 src="images/java277.png"></p>
  <p>Pour modifier l'ordre des membres dans le tri, il suffit de
    s&eacute;lection le type de membres concern&eacute;s et d'utiliser les boutons
    «&nbsp;Haut&nbsp;» et «&nbsp;Bas&nbsp;».</p>
  <p>La case &agrave; cocher «&nbsp;Trier les membres d'une m&ecirc;me
    cat&eacute;gorie par visibilit&eacute;&nbsp;» est assez explicite&nbsp;: pour l'activer il
    suffit de la cocher et de modifier au besoin l'ordre des modificateurs d'acc&egrave;s.</p>
  <p>Cliquez sur le bouton «&nbsp;OK&nbsp;» pour valider les
    modifications.</p></td>
    </tr>
  </table>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_6_11">7.6.11. <!--nchpfin-->    La g&eacute;n&eacute;ration de getter et setter</a></h3>
  <p>Il suffit d'utiliser l'option &quot;Source/G&eacute;n&eacute;rer les m&eacute;thodes getter et setter&quot; du menu contextuel.</p>
  <p>Une bo&icirc;te de dialogue permet de s&eacute;lectionner, pour chaque attribut de la classe en cours d'&eacute;dition, les getters et setters &agrave; g&eacute;n&eacute;rer</p>
  <p align="center"> <img alt=""  width=380 height=245 src="images/image221.png"> </p>
  <p>Il suffit de s&eacute;lectionner les m&eacute;thodes n&eacute;cessaires pour qu'une g&eacute;n&eacute;ration par d&eacute;faut soit effectu&eacute;e dans le code.</p>
  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse30.png" width="64" height="32" align="center"></td>
      <td><p>Il est possible de cr&eacute;er directement des m&eacute;thodes de type getter/setter ou le constructeur par d&eacute;faut en utilisant la combinaison Ctrl+espace dans le corps d'une classe </p>
        <p>Exemple&nbsp;: demander la cr&eacute;ation d'un setter pour le champ cha&icirc;ne. </p>
        <p align="center"><img src="images/java177.png" width="390" height="264"></p>        </td>
    </tr>
  </table>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_6_12">7.6.12. <!--nchpfin-->La g&eacute;n&eacute;ration des m&eacute;thodes hashCode() et equals()</a></h3>
  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse32.png" width="64" height="32" align="center"></td>
      <td>  <p>Il est possible de demander la g&eacute;n&eacute;ration des m&eacute;thodes   hashCode    (  )
    et   equals  () en utilisant, dans l'&eacute;diteur de code,
    l'option «&nbsp;Source / G&eacute;n&eacute;rer   hashCode() et   equals()&nbsp;» du menu contextuel.</p>
  <table border="1" cellpadding="4" cellspacing="0" width="100%" align=center >
    <tr bgcolor="#A6A5C2">
      <td>Exemple :</td>
    </tr>
    <tr>
      <td>
        <pre><code>public class Personne {
  private String nom;
  private String Prenom;
}</code></pre>
      </td>
    </tr>
  </table>
  <br>
  <p>Une bo&icirc;te de dialogue permet de s&eacute;lectionner les champs qui
    vont &ecirc;tre utilis&eacute;s dans le corps de ces m&eacute;thodes.</p>
  <p align="center"><img width=394 height=269 src="images/java266.png"></p>
  <p>Par d&eacute;faut tous les champs de classe sont s&eacute;lectionn&eacute;s.</p>
  <p>Cliquez sur le bouton «&nbsp;OK&nbsp;» une fois la s&eacute;lection
    effectu&eacute;e.</p>
  <p>Le code de la classe est enrichi des deux m&eacute;thodes&nbsp;: </p>
  <table border="1" cellpadding="4" cellspacing="0" width="100%" align=center >
    <tr bgcolor="#A6A5C2">
      <td>Exemple :</td>
    </tr>
    <tr>
      <td>
        <pre><code>/* (non-Javadoc)
 * @see java.lang.Object#hashCode()
 */
@Override
public int hashCode() {
  final int PRIME = 31;
  int result = 1;
  result = PRIME * result + ((Prenom == null) ? 0 : Prenom.hashCode());
  result = PRIME * result + ((nom == null) ? 0 : nom.hashCode());
  return result;
}

/* (non-Javadoc)
 * @see java.lang.Object#equals(java.lang.Object)
 */
@Override
public boolean equals(Object obj) {
  if (this == obj)
    return true;
  if (obj == null)
    return false;
  if (getClass() != obj.getClass())
    return false;
  final Personne other = (Personne) obj;
  if (Prenom == null) {
    if (other.Prenom != null)
      return false;
  } else if (!Prenom.equals(other.Prenom))
    return false;
  if (nom == null) {
    if (other.nom != null)
      return false;
  } else if (!nom.equals(other.nom))
    return false;
  return true;
}</code></pre>
      </td>
    </tr>
  </table>
  <br>
</td>
    </tr>
  </table>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_6_13">7.6.13. <!--nchpfin-->Formater le code</a></h3>
  <p>L'&eacute;diteur peut formater le code selon des r&egrave;gles d&eacute;finies. Pour utiliser cette fonctionnalit&eacute;, il suffit d'utiliser l'option "&nbsp;Formater&nbsp;" du menu contextuel.</p>
  <p>Les r&egrave;gles utilis&eacute;es pour formater sont d&eacute;finies dans les pr&eacute;f&eacute;rences (menu &quot;Fen&ecirc;tre/Pr&eacute;f&eacute;rences&quot;).</p>
  <p>Il faut s&eacute;lectionner dans l'arborescence, &quot;Java/Module de formatage de code&quot;. Les r&egrave;gles de formatage peuvent &ecirc;tre d&eacute;finies gr&acirc;ce &agrave; trois onglets.</p>
  <p align="center"> <img alt=""  width=400 height=333 src="images/image222.png"> </p>
  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse30.png" width="64" height="32" align="center"></td>
      <td><p>Le module de formatage de code a &eacute;t&eacute; enti&egrave;re r&eacute;&eacute;crit et propose plusieurs fonctionnalit&eacute;s int&eacute;ressantes&nbsp;: </p>
        <ul>
          <li> il propose deux profils pr&eacute;d&eacute;finis (convention java et Eclipse 2.1) non modifiable sans duplication </li>
          <li> il permet de cr&eacute;er son propre profil </li>
          <li> il propose un aper&ccedil;u du style s&eacute;lectionn&eacute; </li>
          <li>&eacute;changer des profiles entre plusieurs installations d'Eclipse 3 par import/export </li>
        </ul>
        <p>Les pr&eacute;f&eacute;rences permettent de mettre en oeuvre ces nouvelles fonctionnalit&eacute;s. </p>
        <p align="center"><img src="images/java152.png" width="580" height="314"></p>
        <p> Le bouton &laquo;&nbsp;Afficher&nbsp;&raquo; permet de voir les diff&eacute;rents options qui composent le profil. </p>
        <p align="center"><img src="images/java155.png" width="580" height="416"></p>
        <p> Le bouton &laquo;&nbsp;Cr&eacute;er&nbsp;&raquo; permet de cr&eacute;er son propre style &agrave; partir d'un style existant. </p>
        <p align="center"><img src="images/java154.png" width="324" height="181"></p>
        <p>Il faut saisir le nom, s&eacute;lectionner le profil d'origine et cliquer sur le bouton &laquo;&nbsp;OK&nbsp;&raquo;. </p>
        <p>La configuration des param&egrave;tres du profil est particuli&egrave;rement riche et permet un niveau de d&eacute;tails tr&egrave;s important. </p>
        <p>Dans la perspective Java, il est possible de demander le formatage du code source de tous les fichiers d'un package ou d'un projet en utilisant l'option &laquo;&nbsp;Source / Formater&nbsp;&raquo; du menu contextuel des &eacute;l&eacute;ments. </p>
        <p>Une boite de dialogue demande la confirmation car l'op&eacute;ration ne peut &ecirc;tre annul&eacute;e. </p>
        <p align="center"><img src="images/java156.png" width="441" height="164"></p>
      </td>
    </tr>
  </table>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_6_14">7.6.14. <!--nchpfin-->    Mise en commentaire d'une portion de code</a></h3>
  <p>L'&eacute;diteur permet de mettre en commentaire une portion de code. Il suffit de s&eacute;lectionner la portion de code concern&eacute;e.</p>
  <p align="center"><img alt=""  width=470 height=226 src="images/java092.png" ></p>
  <p>Puis, il faut utiliser l'option "&nbsp;Source / Mettre en commentaires&nbsp;" du menu contextuel de l'&eacute;diteur.</p>
  <p align="center"><img alt=""  width=470 height=225 src="images/java093.png" ></p>
  <p>Pour supprimer les commentaires sur une portion de code, il suffit de s&eacute;lectionner la portion de code et d'utiliser l'option "&nbsp;Source / Supprimer la mise en commentaire&nbsp;" du menu contextuel.</p>  
  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse30.png" width="64" height="32" align="center"></td>
      <td><p>Les options de menu &laquo;&nbsp;Source / Mettre en commentaire&nbsp;&raquo; et &laquo;&nbsp;Source / Supprimer les commentaires&nbsp;&raquo; sont remplac&eacute;es par une unique option &laquo;&nbsp;Source / Ajout/suppression de la mise en commentaires&nbsp;&raquo; qui effectue l'op&eacute;ration en fonction du contexte. </p>
        <p>L'option &laquo;&nbsp;Source / Mettre en commentaire un bloc&nbsp;&raquo; du menu contextuel permet de mettre en commentaire la portion de code s&eacute;lectionner gr&acirc;ce &agrave; un commentaire de type multi-ligne. </p>
        <p>Exemple </p>
        <p align="center"><img src="images/java157.png" width="516" height="108"></p>
        <p> R&eacute;sultat&nbsp;: </p>
        <p align="center"><img src="images/java158.png" width="513" height="107"></p>
        <p>Pour utiliser cette fonctionnalit&eacute;, il est aussi possible d'utiliser la combinaison de touches Ctrl+Maj+/ </p>
        L'option &laquo;&nbsp;Source / Supprimer ma mise en commentaire un bloc&nbsp;&raquo; permet l'op&eacute;ration inverse. </td>
    </tr>
  </table>
<p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_6_15">7.6.15. <!--nchpfin-->    Prot&eacute;ger une portion de code avec un bloc try/catch</a></h3>
  <p>L'&eacute;diteur propose une option qui permet automatiquement de rechercher, dans un bloc de code s&eacute;lectionn&eacute;, une ou plusieurs exceptions pouvant &ecirc;tre lev&eacute;es et de prot&eacute;ger le bloc de code avec une instruction de type try / catch.</p>
  <p>Il faut s&eacute;lectionner le bloc de code &agrave; prot&eacute;ger.</p>
  <p align="center"><img alt=""  width=535 height=203 src="images/java094.png" ></p>
  <p>Puis utiliser l'option "&nbsp;Source / Entourer d'un bloc try / catch&nbsp;". L'&eacute;diteur analyse le code et g&eacute;n&egrave;re la cause try / catch qui va capturer toutes les exceptions qui peuvent &ecirc;tre lev&eacute;es dans le bloc de code s&eacute;lectionn&eacute;.</p>
  <p align="center"><img alt=""  width=533 height=333 src="images/java095.png" ></p>
  <p>Chacune des instructions catch est marqu&eacute;e avec une tache "&nbsp;bloc catch auto-g&eacute;n&eacute;r&eacute;&nbsp;" pour indiquer au d&eacute;veloppeur d'ajouter le code n&eacute;cessaire au traitement de l'exception.</p>
  <p>Si le bloc de code ne contient aucun appel de m&eacute;thode susceptible de lever une exception, une bo&icirc;te de dialogue demande si l'instruction catch doit capturer une exception de type RuntimeException.</p>
  <p align="center"><img alt=""  width=441 height=139 src="images/java096.png" ></p>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_6_16">7.6.16. <!--nchpfin-->La fonctionnalit&eacute; «&nbsp;Entourer avec&nbsp;»</a></h3>
  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse32.png" width="64" height="32" align="center"></td>
      <td>  <p>Dans l'&eacute;diteur de code Java, il est possible facilement d'entourer
    une portion de code gr&acirc;ce &agrave; la fonctionnalit&eacute; «&nbsp;Entourer avec&nbsp;».</p>
  <p>Pour cela, s&eacute;lectionnez une portion de code dans l'&eacute;diteur</p>
  <p align="center"><img width=467 height=94 src="images/java259.png"></p>
  <p>Puis utilisez l'option «&nbsp;Entourer avec&nbsp;» du menu
    contextuel. Son sous menu propose plusieurs mod&egrave;les par d&eacute;faut.</p>
  <p align="center"><img width=463 height=221 src="images/java260.png"></p>
  <p>S&eacute;lectionnez par exemple «&nbsp;3 if (instruction if)&nbsp;»</p>
  <p align="center"><img width=467 height=72 src="images/java261.png"></p>
  <p>Il est possible d'acc&eacute;der directement au sous menu en
    utilisant la combinaison de touches shift+  alt  +z</p>
  <p align="center"><img width=463 height=128 src="images/java262.png"></p>
  <p>Les mod&egrave;les sont extensibles&nbsp;: pour g&eacute;rer les mod&egrave;les,
    il faut  utiliser l'option
    «&nbsp;Configurer les mod&egrave;les&nbsp;» du menu contextuel ou ouvrir les
    pr&eacute;f&eacute;rences et s&eacute;lectionner «&nbsp;Java / Editeur / Mod&egrave;les&nbsp;» dans l'arborescence.</p>
  <p align="center"><img width=580 height=393 src="images/java263.png"></p>
  <p>Les boutons «&nbsp;Importer&nbsp;» et «&nbsp;Exporter&nbsp;»
    permettent d'importer et d'exporter les mod&egrave;les.</p>
  <p>Pour exporter un ou plusieurs mod&egrave;les, il est n&eacute;cessaire de
    les s&eacute;lectionner au pr&eacute;alable dans la liste afin de pouvoir rendre actif le
    bouton.</p>
  <p>Une boite de dialogue permet de s&eacute;lectionner ou de saisir le
    fichier qui va contenir les donn&eacute;es export&eacute;es au format   xml  .</p>
  <p>Le bouton «&nbsp;Importer&nbsp;» permet d'importer des
    mod&egrave;les sauvegard&eacute;s dans un fichier   xml  &nbsp;: il
    suffit de s&eacute;lectionner le fichier.</p>
  <p>Le bouton «&nbsp;Nouveau&nbsp;» permet de cr&eacute;er un nouveau
    mod&egrave;le.</p>
  <p>La bo&icirc;te de dialogue permet de saisir le nom du mod&egrave;le, une
    description et le sch&eacute;ma, de s&eacute;lectionner le contexte et de pr&eacute;ciser si
    l'insertion peut &ecirc;tre automatique.</p>
  <p align="center"><img width=503 height=219 src="images/java264.png"></p>
  <p>Les mod&egrave;les existants peuvent &ecirc;tre d'une grande aide pour
    faciliter la compr&eacute;hension de la r&eacute;daction du sch&eacute;ma. Le bouton «&nbsp;Ins&eacute;rer
    une variable&nbsp;» permet d'ins&eacute;rer une variable pr&eacute;d&eacute;finie.</p>
  <p>Une fois toutes les donn&eacute;es saisies, cliquez sur le bouton
    «&nbsp;OK&nbsp;» pour cr&eacute;er le nouveau mod&egrave;le.</p></td>
    </tr>
  </table>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_6_17">7.6.17. <!--nchpfin-->Les avertissements</a></h3>

  <p>&nbsp;</p>
  <h4><!--nchpdeb--><a name="chap_7_6_17_1">7.6.17.1. <!--nchpfin-->D&eacute;tection de l'assignation d'une valeur &agrave; un param&egrave;tre</a></h4>

  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse32.png" width="64" height="32" align="center"></td>
      <td>  <p>Il est possible de demander au compilateur de signaler les
    assignements d'une valeur &agrave; un param&egrave;tre d'une m&eacute;thode. Par d&eacute;faut, le compilateur
    ignore ces actions. Pour les activer, il faut pr&eacute;ciser
    «&nbsp;Avertissement&nbsp;» ou «&nbsp;Erreur&nbsp;» &agrave; l'option «&nbsp;Style du
    code / Affectation de param&egrave;tres&nbsp;»  dans «&nbsp;Compilateur Java / Erreur avertissements&nbsp;» dans les
    propri&eacute;t&eacute;s du projet.</p>
  <p align="center"><img width=349 height=71 src="images/java271.png"></p>
      </td>
    </tr>
  </table>
  <p>&nbsp;</p>
  <h4><!--nchpdeb--><a name="chap_7_6_17_2">7.6.17.2. <!--nchpfin-->D&eacute;tection d'un oubli potentiel de l'instruction break</a></h4>

  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse32.png" width="64" height="32" align="center"></td>
      <td>  <p align="center"><img width=580 height=123 src="images/java272.png"></p>
  <p>Il est possible de demander au compilateur de signaler les
    oublis potentiels de l'instruction break dans les cases de l'instruction switch. Par d&eacute;faut, le compilateur ignore ces actions. Pour les activer, il faut pr&eacute;ciser «&nbsp;Avertissement&nbsp;» ou
    «&nbsp;Erreur&nbsp;» &agrave; l'option «&nbsp;Erreurs de programmation possibles
    /&nbsp;Saut au bloc case suivant&nbsp;»  dans «&nbsp;Compilateur Java / Erreur avertissements&nbsp;» dans les
    propri&eacute;t&eacute;s du projet.  </p>
  <p>Le quick fixe propose d'ajouter l'instruction break manquante.</p>
  <p align="center"><img width=544 height=157 src="images/java273.png"></p></td>
    </tr>
  </table>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_6_18">7.6.18. <!--nchpfin-->    Les erreurs</a></h3>
  <p>Lors de la sauvegarde du fichier, celui ci est compil&eacute; et les erreurs trouv&eacute;es sont signal&eacute;es gr&acirc;ce &agrave; plusieurs indicateurs dans diff&eacute;rentes vues.</p>
  <p align="center"> <img alt=""  width=400 height=215 src="images/image254.png"> </p>
  <p>Les erreurs sont signal&eacute;es par une &icirc;cone ronde rouge contenant une croix blanche  dans les vues suivantes&nbsp;: </p>
  <ul>
    <li>
      <div align="justify"> dans l'&eacute;diteur, la ou les lignes contenant une ou plusieurs erreurs sont marqu&eacute;es avec cette ic&ocirc;ne </div>
    </li>
    <li>
      <div align="justify"> dans la vue &quot;T&acirc;ches&quot;, une entr&eacute;e pour chaque erreur est cr&eacute;&eacute;e pour faciliter leur recencement et leur acc&egrave;s</div>
    </li>
    <li>
      <div align="justify"> dans la vue &quot;Packages&quot;, tous les &eacute;l&eacute;ments allant du fichier source au projet, sont marqu&eacute;s de la petite ic&ocirc;ne</div>
    </li>
  </ul>
  <p>Dans l'&eacute;diteur, le simple fait de laisser le pointeur de la souris sur la petite ic&ocirc;ne permet d'afficher une bulle d'aide qui pr&eacute;cise l'erreur.</p>
  <p align="center"> <img alt=""  width=422 height=188 src="images/image255.png"></p>
  <p>Les boutons <img alt=""  width=23 height=22 src="images/image204.png">  et <img alt=""  width=23 height=22 src="images/image205.png">  permettent respectivement de se positionner sur l'erreur suivante et sur l'erreur pr&eacute;c&eacute;dente.</p>
  <p>Ces m&eacute;canismes sont aussi utilisables au cours de la saisie du code Java dans l'&eacute;diteur. Eclipse est capable de d&eacute;tecter un certain nombre d'erreurs et de les signaler. </p>
  <p align="center"><img src="images/java138.png" width="423" height="164"></p>
  <p>En positionnant le curseur sur la partie de code soulign&eacute;e en rouge, une bulle d'aide fournie des informations sur l'erreur.</p>
  <p align="center"><img src="images/java139.png" width="447" height="165"></p>
  <p>Un clic sur la petite ic&ocirc;ne en forme d'ampoule jaune, permet d'ouvrir une fen&ecirc;tre qui propose des solutions de corrections</p>
  <p align="center"><img src="images/java140.png" width="553" height="110"></p>
  <p>La seconde fen&ecirc;tre permet de pr&eacute;-visualiser les modifications qui seront apport&eacute;es par la proposition choisie.</p>
<p>La vue erreurs contient aussi les erreurs de compilation du code</p>

  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse32.png" width="64" height="32" align="center"></td>
      <td>  <p>Jusqu'&agrave; Eclipse 3.1 inclus, la d&eacute;tection d'une erreur
    emp&ecirc;chait la d&eacute;tection des erreurs suivantes.</p>
  <p align="center"><img width=316 height=271 src="images/java255.png"></p>
  <p>La d&eacute;tection des erreurs a &eacute;t&eacute; am&eacute;lior&eacute;e dans version 3.2 d'Eclipse : le m&ecirc;me code avec Eclipse 3.2 signale d'autres erreurs.</p>
  <p align="center"><img width=302 height=290 src="images/java256.png"></p></td>
    </tr>
  </table>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_6_19">7.6.19. <!--nchpfin--> Masquer certaines portions de code</a></h3>
  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse30.png" width="64" height="32" align="center"></td>
      <td><p>L'&eacute;diteur de code Java propose de masquer certaines portions de code correspondant&nbsp;: </p>
        <ul>
          <li>aux instructions d'importation </li>
          <li>aux commentaires </li>
          <li>aux corps des m&eacute;thodes </li>
        </ul>
        <p> La d&eacute;finition de ces zones est automatique. Le d&eacute;but d'une zone non masqu&eacute;e est signal&eacute;e par une petit ic&ocirc;ne dans la barre de gauche de l'&eacute;diteur <img src="images/java141.png" width="12" height="9"></p>
        <p align="center"><img src="images/java142.png" width="402" height="275"></p>
        <p> Pour masquer la zone, il suffit de cliquer sur le petit ic&ocirc;ne <img src="images/java141.png" width="12" height="9">. 


 La zone est masqu&eacute;e et l'ic&ocirc;ne change d'apparence : <img src="images/java143.png" width="9" height="11"></p>
        <p align="center"><img src="images/java144.png" width="419" height="108"></p>
        <p> En laissant le curseur de la souris sur l'ic&ocirc;ne <img src="images/java143.png" width="9" height="11"> , 


 une bulle d'aide affiche le contenu de la zone masqu&eacute;e. </p>
        <p align="center"><img src="images/java145.png" width="400" height="109"></p>
        <p> Les param&egrave;tres de cette fonctionnalit&eacute; peuvent &ecirc;tre modifi&eacute;s dans les pr&eacute;f&eacute;rences.</p>
        <p align="center"><img src="images/java146.png" width="580" height="341"></p>        </td>
    </tr>
  </table>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_6_20">7.6.20. <!--nchpfin-->    Le mode « Insertion Avanc&eacute;e »</a></h3>
  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse30.png" width="64" height="32" align="center"></td>
      <td> <p>Ce mode activ&eacute; par d&eacute;faut permet de simplifier la t&acirc;che du d&eacute;veloppeur lors de l'insertion d'une portion de texte dans l'&eacute;diteur de code Java. Il permet notamment de fermer automatiquement les parenth&egrave;ses, les accolades, les guillemets, ... </p>
        <p> Le mode de fonctionnement est signal&eacute; dans la barre d'&eacute;tat&nbsp;: <img src="images/java150.png" width="92" height="31" align="baseline">. Pour basculer du mode normal au mode avanc&eacute;, il suffit d'utiliser la combinaison de touche Ctrl+Maj+Ins </p>
        <p>Le param&eacute;trage de ce mode ce fait dans les pr&eacute;f&eacute;rences. </p>
      <p align="center"><img src="images/java151.png" width="580" height="405"></p>      </td>
    </tr>
  </table>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_6_21">7.6.21. <!--nchpfin-->    Marquer les occurrences trouv&eacute;es</a></h3>
  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse30.png" width="64" height="32" align="center"></td>
      <td> <p>Suite &agrave; une recherche, il est possible de demander &agrave; l'&eacute;diteur de marquer les occurrences trouv&eacute;es dans le code source en activant le bouton <img src="images/java159.png" width="23" height="22"> de la barre d'outils ou en utilisant la combinaison de touche Alt+Maj+O. </p>
        <p align="center"><img src="images/java160.png" width="514" height="113"></p>
        <p> Les occurrences sont marqu&eacute;es sous la forme d'annotations. </p>
        <p> Il est possible d'utiliser les boutons <img src="images/java161.png" width="36" height="22"> et <img src="images/java162.png" width="36" height="22"> pour se positionner sur l'occurrence suivante ou pr&eacute;c&eacute;dente. Il faut cependant que les annotations de type occurrences soient coch&eacute;es dans le menu d&eacute;roulant associ&eacute; aux boutons. </p>
        <p align="center"><img src="images/java163.png" width="177" height="199"></p>      </td>
    </tr>
  </table>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_6_22">7.6.22. <!--nchpfin-->    Marquer les points de sortie d'une m&eacute;thode</a></h3>
  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse30.png" width="64" height="32" align="center"></td>
      <td><p>M&ecirc;me si cela n'est pas recommand&eacute;, il est possible de mettre plusieurs instruction return dans une m&eacute;thode. </p>
        <p>L'&eacute;diteur propose une fonctionnalit&eacute; pour marquer sous forme d'annotation les points de sortie d'une m&eacute;thode. </p>
        <p>Pour cela, il faut positionner le curseur sur le type de retour de la m&eacute;thode et activer les boutons <img src="images/java164.png" width="46" height="22">.</p>
      <p align="center"><img src="images/java165.png" width="513" height="154"></p>
      </td>
    </tr>
  </table>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_6_23">7.6.23. <!--nchpfin-->    Marquer les emplacements ou une exception est lev&eacute;e</a></h3>
  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse30.png" width="64" height="32" align="center"></td>
      <td><p>L'&eacute;diteur propose une fonctionnalit&eacute; qui permet de marquer les m&eacute;thodes qui l&egrave;vent une exception d'un type d&eacute;clar&eacute; dans la signature de la m&eacute;thode. </p>
        <p>Pour cela, il faut placer le curseur sur une des exceptions utilis&eacute;es dans la clause throws de la d&eacute;claration de la m&eacute;thode et d'utiliser l'option &quot;Rechercher / Occurrences d'exceptions&quot;&nbsp; du menu principal. </p>
        <p align="center"><img src="images/java166.png" width="580" height="147"></p></td>
    </tr>
  </table>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_6_24">7.6.24. <!--nchpfin-->    L'assistant de correction rapide</a></h3>
  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse30.png" width="64" height="32" align="center"></td>
      <td><p>L'&eacute;diteur peut faciliter la r&eacute;daction du code en proposant un certains nombre d'action selon le contexte. </p>
        <p>Pour savoir si une ou plusieurs correction rapide peuvent &ecirc;tre propos&eacute;e, il faut activer l'option dans les pr&eacute;f&eacute;rences, sous l'arborescence &laquo;&nbsp;Java / Editeur&nbsp;&raquo;, sur l'onglet &laquo;&nbsp;Aspect&nbsp;&raquo;, il faut cocher l'option &laquo;&nbsp;Activer l'ampoule pour l'assistant rapide&nbsp;&raquo; qui par d&eacute;faut est d&eacute;coch&eacute;e. </p>
      <p align="center"><img src="images/java169.png" width="574" height="39"></p>
      <p> Il suffit alors de cliquer sur l'ampoule ou d'utiliser la combinaison de touche Ctrl+1 pour activer l'assistant. </p>
      <p align="center"><img src="images/java170.png" width="584" height="68"></p>
      <p>Les op&eacute;rations propos&eacute;es par l'assistant le sont fonction du contexte. </p>
      <p>Les diff&eacute;rentes op&eacute;rations propos&eacute;es sont nombreuses et facilitent souvent la r&eacute;alisation de petites t&acirc;ches fastidieuses &agrave; r&eacute;aliser manuellement, par exemple&nbsp;: </p>
      <ul>
        <li>ajouter un bloc else &agrave; une instruction if <br>
          <br>
          <img src="images/java171.png" width="405" height="111"> <br><br>
</li>
        <li> supprimer une instruction englobante <br>
          <br>
          <img src="images/java172.png" width="478" height="85"> <br><br>
</li>
        <li> modifier l'appel ou la m&eacute;thode en cas de non concordance de param&egrave;tres <br>
          <br>
          <img src="images/java173.png" width="518" height="74"> <br><br>
</li>
        <li> cr&eacute;er un nouveau champ qui sera initialis&eacute; avec un param&egrave;tre de la m&eacute;thode <br>
          <br>
          <img src="images/java174.png" width="541" height="141"> <br><br>
</li>
        <li> renommer localement un membre <br>
          <br>
          <img src="images/java176.png" width="446" height="44"> <br><br>
</li>
      </ul></td>
    </tr>
  </table><br>
    <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse32.png" width="64" height="32" align="center"></td>
      <td><p>Un quick fixe permet d'utiliser les generics &agrave; une collection utilis&eacute;e avec le type brut.</p>
  <p align="center"><img width=540 height=88 src="images/java265.png"></p>
</td>
    </tr>
  </table>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_6_25">7.6.25. <!--nchpfin-->    La g&eacute;n&eacute;ration de constructeur</a></h3>
  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse30.png" width="64" height="32" align="center"></td>
      <td><p> L'option &laquo;&nbsp;Source / g&eacute;n&eacute;rer le constructeur &agrave; partir des zones ...&nbsp;&raquo; du menu contextuel permet de faciliter la cr&eacute;ation d'un constructeur. </p>
        <p align="center"><img src="images/java178.png" width="439" height="380"></p>
        <p> Il est alors possible de s&eacute;lectionner les param&egrave;tres du nouveau constructeur et les diff&eacute;rentes options pour que le code du constructeur soit g&eacute;n&eacute;r&eacute;. </p></td>
    </tr>
  </table>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_6_26">7.6.26. <!--nchpfin-->    Raccourci clavier pour avoir acc&egrave;s aux fonctions de modification du code source</a></h3>
  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse30.png" width="64" height="32" align="center"></td>
      <td><p>L'&eacute;diteur propose un menu contextuel pour acc&eacute;der rapidement aux fonctions de modification du code source en utilisant la combinaison de touche Alt+Maj+S </p>
      <p align="center"><img src="images/java179.png" width="425" height="276"></p></td>
    </tr>
  </table>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_6_27">7.6.27. <!--nchpfin-->Les raccourcis clavier des &eacute;diteurs</a></h3>
  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse31.png" width="64" height="32" hspace="5"></td>
      <td>
  <p>Dans un &eacute;diteur, il suffit d'utiliser la combinaison de touches Ctrl+Shift+L pour obtenir une liste des raccourcis clavier utilisable dans l'&eacute;diteur.</p> 
  <p align="center"><img width=412 height=389 src="images/java203.png"></p> 
  <p>Il suffit de r&eacute;utiliser la combinaison de touche «&nbsp;Ctrl+Maj+L&nbsp;» pour afficher les pr&eacute;f&eacute;rences concernant les raccourcis clavier des &eacute;diteurs.</p> 
  <p align="center"><img width=580 height=234 src="images/java204.png"></p> 	  
	  </td>
    </tr>
  </table><br>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_6_28">7.6.28. <!--nchpfin-->La gestion des mod&egrave;les de commentaires</a></h3>
  <p>Dans l'&eacute;diteur de code source Java, l'option «&nbsp;Sources / Ajouter commentaires&nbsp;» (Alt + Shift + J) du menu contextuel permet d'ins&eacute;rer un commentaire selon un mod&egrave;le pr&eacute;d&eacute;fini.</p> 
  <p align="center"><img width=341 height=217 src="images/java205.png"></p> 
  <p>Ce mod&egrave;le peut &ecirc;tre param&egrave;tr&eacute; dans les pr&eacute;f&eacute;rences. </p> 
  <p>Il est possible de demander la g&eacute;n&eacute;ration de commentaires sur plusieurs entit&eacute;s en m&ecirc;me temps en s&eacute;lectionnant dans «&nbsp;l'explorateur de packages&nbsp;» et en utilisant l'option «&nbsp;Source / Ajouter commentaires&nbsp;».</p> 
  <p align="center"><img width=281 height=201 src="images/java206.png"></p> 
  <p align="center"><img width=302 height=447 src="images/java207.png"></p> 
  <p>Les mod&egrave;les de commentaires sont param&eacute;trables dans les Pr&eacute;f&eacute;rences&nbsp;: </p> 
  <p align="center"><img width=616 height=511 src="images/java208.png"></p> 
  <p>Pour modifier un mod&egrave;le, il faut le s&eacute;lectionner dans la liste et cliquer sur le bouton «&nbsp;Editer ...&nbsp;»</p> 
  <p align="center"><img width=503 height=243 src="images/java209.png"></p> 
  <p>Pour ins&eacute;rer une variable, il suffit de cliquer sur le bouton «&nbsp;Ins&eacute;rer une variable ...&nbsp;» ou utiliser la combinaison de touche Ctrl+Espace.</p> 
  <p align="center"><img width=503 height=243 src="images/java210.png"></p> 
  <p>Le contenu de la plupart des variables sera d&eacute;termin&eacute; dynamiquement lors de la g&eacute;n&eacute;ration du commentaire.</p> 
  <p>Une fois la saisie termin&eacute;e, il faut cliquer sur le bouton «&nbsp;OK&nbsp;» pour valider les modifications.</p> 
  <p>Le mod&egrave;le s&eacute;lectionn&eacute; ou tous les mod&egrave;les peuvent &ecirc;tre export&eacute; et import&eacute; gr&acirc;ce aux boutons d&eacute;di&eacute;s.</p> 
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_6_29">7.6.29. <!--nchpfin-->Le support du tag @category</a></h3>
  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse32.png" width="64" height="32" align="center"></td>
      <td width="100%">  <p>Le tag Javadoc @category est support&eacute; et int&eacute;gr&eacute; &agrave; Eclipse&nbsp;: se tag
    permet de regrouper des membres par cat&eacute;gories.</p>
  <p>L'assistant de compl&eacute;tion de code propose ce tag.</p>
  <p align="center"><img width=437 height=97 src="images/java278.png"></p>
    <table border="1" cellpadding="4" cellspacing="0" width="100%" align=center >
    <tr bgcolor="#A6A5C2">
      <td>Exemple :</td>
    </tr>
    <tr>
      <td>
        <pre><code>  /**
   * @return entier
   * @category getter
   */
  public static int getEntier() {
    return entier;
  }

  /**
   * @param entier entier &agrave; d&eacute;finir
   * @category setter
   */
  public static void setEntier(int entier) {
    Test.entier = entier;
  }</code></pre>
      </td>
    </tr>
  </table>
  <br>
  <p>Ce tag, une fois utilis&eacute;, est exploit&eacute; dans plusieurs vues d'Eclipse. </p>
  <p>La vue structure affiche la cat&eacute;gorie d'un membre entre
    crochet. Elle permet d'appliquer un filtre d'affichage sur les membres &agrave; partir
    de leur cat&eacute;gorie en cliquant sur le bouton <img width=16 height=13 src="images/java279.png"></p>
  <p align="center"><img width=273 height=312 src="images/java280.png"></p>
  <p>Il est possible de cocher les cat&eacute;gories dont les membres
    seront affich&eacute;s. L'option «&nbsp;Cat&eacute;gories visibles&nbsp;» permet de r&eacute;aliser
    la m&ecirc;me op&eacute;ration mais dans une bo&icirc;te de dialogue. Celle-ci est
    particuli&egrave;rement utile si le nombre de cat&eacute;gories est important.</p>
  <p align="center"><img width=397 height=157 src="images/java281.png"></p>
  <p>Cochez les cat&eacute;gories qui doivent &ecirc;tre affich&eacute;es dans la vue
    et cliquez sur le bouton «&nbsp;OK&nbsp;».</p>
  <p>La vue «&nbsp;Membres&nbsp;» offre les m&ecirc;me fonctionnalit&eacute;s</p>
  <p align="center"><img width=271 height=249 src="images/java282.png"></p></td>
    </tr>
  </table>
  <p>&nbsp;</p>
  <h2><!--nchpdeb--><a name="chap_7_7">7.7. <!--nchpfin-->    Ex&eacute;cution d'une application</a></h2>
  <p>Dans la perspective &quot;Java&quot;, il est possible d'ex&eacute;cuter une application de plusieurs fa&ccedil;ons.</p>
  <p>Pour ex&eacute;cuter l'application en cours d'&eacute;dition, il suffit de cliquer sur la fl&egrave;che du bouton <img alt=""  width=36 height=22 src="images/image223.png">  de la barre d'outils.</p>
  <p align="center"> <img alt=""  width=346 height=175 src="images/image224.png"> </p>
  <p>Ce menu d&eacute;roulant propose diff&eacute;rentes options&nbsp;: </p>
  <ul type=disc>
    <li >relancer les pr&eacute;c&eacute;dentes ex&eacute;cutions list&eacute;es dans la premi&egrave;re partie du menu</li>
    <li >l'option &quot;Ex&eacute;cuter en tant que&quot; permet de lancer l'application dans trois modes diff&eacute;rents (Application java, Test JUnit et plan de travail d'ex&eacute;cution)</li>
    <li >l'option &quot;Ex&eacute;cuter&quot; ouvre une bo&icirc;te de dialogue pour param&eacute;trer pr&eacute;cis&eacute;ment les options d'ex&eacute;cution</li>
  </ul>
  <p>L'option &quot;Ex&eacute;cuter en tant que / Application Java&quot; lance la m&eacute;thode main() d'une application.</p>
  <p>L'option &quot;Ex&eacute;cuter&quot;&nbsp;ouvre une bo&icirc;te de dialogue qui permet de saisir tous les param&egrave;tres d'ex&eacute;cution.</p>
  <p align="center"> <img alt=""  width=400 height=223 src="images/image225.png"> </p>
  <p>La boite de dialogue se compose de six onglets.</p>
  <p>L'onglet&nbsp;"Main" permet de s&eacute;lectionner le projet et la classe de ce projet qui contient la m&eacute;thode main() &agrave; ex&eacute;cuter.</p>
  <p>L'onglet "Arguments" permet de pr&eacute;ciser les arguments pass&eacute;s &agrave; l'application et &agrave; la machine virtuelle.</p>
  <p>L'onglet&nbsp;"JRE" permet de s&eacute;lectionner le JRE &agrave; utiliser lors de l'ex&eacute;cution.</p>
  <p>L'onglet "Chemin d'acc&egrave;s aux classes" permet de modifier la liste et l'ordre des biblioth&egrave;ques utilis&eacute;es lors de l'ex&eacute;cution. Cet onglet permet de modifier la liste d&eacute;finie dans le projet qui est celle utilis&eacute;e par d&eacute;faut.</p>
  <p>L'onglet &quot;Commun&quot; permet de pr&eacute;ciser le type de lancement et le mode d'ex&eacute;cution et de d&eacute;bogage.</p>
  <p>Une fois tous les param&egrave;tres voulus renseign&eacute;s, il suffit de cliquer sur le bouton "&nbsp;Ex&eacute;cuter&nbsp;" pour lancer l'application.</p>
  <p align="center"> <img alt=""  width=456 height=143 src="images/image226.png"> </p>
  <p>La vue "&nbsp;Console&nbsp;" permet de voir les donn&eacute;es qui sont envoy&eacute;es dans le flux standard de sortie et d'erreurs.</p>
  <p align="center"> <img alt=""  width=400 height=118 src="images/image227.png"> </p>
  <p>Les messages ayant pour origine une exception sont aussi envoy&eacute;s dans cette vue.</p>
  <p align="center"> <img alt=""  width=400 height=102 src="images/image228.png"> </p>
  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse32.png" width="64" height="32" align="center"></td>
      <td>  <p>L'ergonomie de la boite de dialogue «&nbsp;Ex&eacute;cuter&nbsp;» a &eacute;t&eacute; l&eacute;g&egrave;rement
    revue.</p>
  <p align="center"><img width=580 height=302 src="images/java233.png"></p>
  <p>La gestion des configurations se fait via de petit bouton
    avec des icônes.</p>
  <p align="center"><img width=580 height=446 src="images/java234.png"></p>
  <p>Il est possible de pr&eacute;ciser dans les variables une variable
    d'Eclipse. Il est possible de la saisir directement ou d'utiliser l'assistant
    de s&eacute;lection de variable en cliquant que le bouton «&nbsp;Variable&nbsp;».</p>
  <p align="center"><img width=341 height=360 src="images/java235.png"></p>
  <p>Il suffit de s&eacute;lectionner la variable en s'aidant
    &eacute;ventuellement du filtre et de saisir l'argument</p>
  <p align="center"><img width=341 height=360 src="images/java236.png"></p>
  <p>Cliquez sur le bouton «&nbsp;OK&nbsp;»</p>
  <p align="center"><img width=474 height=126 src="images/java237.png"></p>
    <table border="1" cellpadding="4" cellspacing="0" width="100%" align=center >
    <tr bgcolor="#A6A5C2">
      <td>Exemple&nbsp;: source de la classe de test</td>
    </tr>
    <tr>
      <td>
        <pre><code>package fr.jmdoudoux.testb;

public class TestErreurs {

  public static void TestA(String valeur) {
    System.out.println(&quot;valeur=&quot;+valeur);
  }

  public static void main(String[] argv) {
    TestA(argv[0]);
  }
}</code></pre>
      </td>
    </tr>
  </table>
  <br>
    <table border="1" cellpadding="4" cellspacing="0" width="100%" align=center >
    <tr bgcolor="#A6A5C2">
      <td>R&eacute;sultat de l'ex&eacute;cution :</td>
    </tr>
    <tr>
      <td>
        <pre><code>valeur=    C:\java\eclipse32  </code></pre>
      </td>
    </tr>
  </table>
  <br></td>
    </tr>
  </table>
  <p>&nbsp;</p>
  <h2><!--nchpdeb--><a name="chap_7_8">7.8. <!--nchpfin-->    G&eacute;n&eacute;ration de la documentation Javadoc</a></h2>
  <p>Pour demander la g&eacute;n&eacute;ration de la documentation Javadoc, il faut utiliser le menu &quot;Projet/G&eacute;n&eacute;rer/Le javadoc&quot;.</p>
  <p>Pour utiliser cet option, il faut obligatoirement que les pr&eacute;f&eacute;rences concernant Javadoc soit renseign&eacute;es, sinon un message d'erreur emp&egrave;che l'utilisation de l'assistant</p>
  <p align="center"><img alt=""  width=531 height=146 src="images/jdt050.png"></p>
  <p>Pour r&eacute;soudre le probl&egrave;me, il faut aller dans l'arborescence &quot;Java/Javadoc&quot; des pr&eacute;f&eacute;rences, cliquer sur le bouton &quot;Parcourir&quot; et s&eacute;lectionner le fichier javadoc.exe du JDK &agrave; utiliser.</p>
  <p align="center"><img alt=""  width=589 height=257 src="images/jdt051.png"></p>
  <p>Cliquez sur le bouton &quot;OK&quot; pour valider les modifications.</p>
  <p>La g&eacute;n&eacute;ration de la documentation au format Javadoc se fait avec un assistant. Il faut lui indiquer : le ou les projets concern&eacute;s, la visibilit&eacute; des membres &agrave; inclure, le doclet &agrave; utiliser et le r&eacute;pertoire de destination.</p>
  <p align="center"><img alt=""  width=529 height=391 src="images/jdt052.png"></p>
  <p>Cliquez sur le bouton &quot;Suivant&quot;</p>
  <p>La page suivante de l'assistant permet de pr&eacute;ciser des options pour l'outil Javadoc.</p>
  <p align="center"><img alt=""  width=529 height=492 src="images/jdt053.png"></p>
  <p>Une fois les options configur&eacute;es, cliquez sur le bouton &quot;Suivant&quot;.</p>
  <p>La page suivante de l'assistant permet de pr&eacute;ciser d'autres options.</p>
  <p align="center"><img alt=""  width=529 height=343 src="images/jdt054.png"></p>
  <p>En cliquant sur &quot;Fin&quot;, la g&eacute;n&eacute;ration de la documentation est effectu&eacute;e. L'assistant demande si l'emplacement javadoc du projet doit &ecirc;tre mis &agrave; jour.</p>
  <p align="center"><img alt=""  width=441 height=118 src="images/jdt055.png"></p>
  <p>Il est conseill&eacute; de r&eacute;pondre &quot;Oui&quot; pour permettre d'avoir acc&egrave;s &agrave; cette documentation &agrave; partir de l'&eacute;diteur en appuyant sur les touches &quot;Shift&quot; + &quot;F2&quot;.</p>
  <p>Le d&eacute;tail de la g&eacute;n&eacute;ration est affich&eacute; dans le vue &quot;Console&quot;.</p>
  <p align="center"><img src="images/jdt056.png" width="483" height="132"></p>
  <p>Les fichiers apparaissent dans la vue &quot;Navigateur&quot;.</p>
  <p align="center"><img src="images/jdt057.png" width="203" height="205"> </p>
  <p>&nbsp;</p>
  <h2><!--nchpdeb--><a name="chap_7_9">7.9. <!--nchpfin-->    D&eacute;finition du JRE &agrave; utiliser</a></h2>
  <p>Eclipse est capable de travailler avec plusieurs JRE. Dans l'arborescence "&nbsp;Java/JRE install&eacute;&nbsp;" des pr&eacute;f&eacute;rences, il est possible de d&eacute;finir plusieurs JRE install&eacute;s sur la machine.</p>
  <p align="center"><img alt=""  width=400 height=239 src="images/java084.png" ></p>
  <p>Un clic sur le bouton "Editer" permet de modifier les donn&eacute;es du JRE d&eacute;fini dans Eclipse.</p>
  <p align="center"><img alt=""  width=400 height=288 src="images/java085.png" ></p>

  <p>&nbsp;</p>
  <h2><!--nchpdeb--><a name="chap_7_10">7.10. <!--nchpfin-->Les environnements d'ex&eacute;cution</a></h2>
  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse32.png" width="64" height="32" align="center"></td>
      <td>  <p>Dans les pr&eacute;f&eacute;rences, il est possible de d&eacute;finir pour un
    environnement d'ex&eacute;cution le JRE compatibles &agrave; utiliser. Pour chaque
    environnement, la liste des JRE compatibles est affich&eacute;e. </p>
  <p align="center"><img width=580 height=304 src="images/java238.png"></p>
  <p>Les JRE affich&eacute;s en gras avec la mention
    «&nbsp;[correspondance parfaite]&nbsp;» indique une parfaite ad&eacute;quation avec
    l'environnement d'ex&eacute;cution.</p>
  <p align="center"><img width=546 height=254 src="images/java239.png"></p>
  <p>Il est aussi possible qu'aucun JRE compatible ne corresponde
    &agrave; l'environnement d'ex&eacute;cution.</p>
  <p align="center"><img width=542 height=251 src="images/java240.png"></p>
  <p>Pour d&eacute;finir le JRE par d&eacute;faut de l'environnement
    d'ex&eacute;cution, il suffit de le cocher.</p>
  <p>L'utilisation d'un environnement d'ex&eacute;cution est plus souple
    que d'utiliser directement un JRE. </p>
  <p>Il est ainsi possible de pr&eacute;ciser un environnement
    d'ex&eacute;cution dans une configuration d'ex&eacute;cution</p>
  <p align="center"><img width=580 height=320 src="images/java241.png"></p>
  <p>Il suffit dans l'onglet «&nbsp;JRE&nbsp;» de cocher le choix
    «&nbsp;Environnement d'ex&eacute;cution&nbsp;» et de s&eacute;lectionner dans la liste
    l'environnement souhait&eacute;.</p>
  <p>Le bouton «&nbsp;Environnements ...&nbsp;» ouvrir directement
    les pr&eacute;f&eacute;rences des environnements d'ex&eacute;cution.</p>
  <p align="center"><img width=580 height=360 src="images/java242.png"></p>
  <p>Les environnements d'ex&eacute;cution sont aussi utilisables dans
    les options de «&nbsp;chemin de g&eacute;n&eacute;ration Java&nbsp;» du projet. Dans les
    propri&eacute;t&eacute;s du projet, dans l'onglet «&nbsp;Biblioth&egrave;que&nbsp;» de l'option
    «&nbsp;Chemin de g&eacute;n&eacute;ration Java&nbsp;», s&eacute;lectionnez «&nbsp;Biblioth&egrave;que
    syst&egrave;me JRE&nbsp;» et cliquez sur le bouton «&nbsp;Editer&nbsp;...».</p>
  <p align="center"><img width=464 height=239 src="images/java243.png"></p>
  <p>La bo&icirc;te de dialogue permet de s&eacute;lectionner un environnement
    d'ex&eacute;cution. </p>
  <p align="center"><img width=264 height=89 src="images/java244.png"></p>
  <p>L'environnement d'ex&eacute;cution est pr&eacute;cis&eacute; entre les crochets &agrave;
    la place du JRE.</p></td>
    </tr>
  </table>
  <p>&nbsp;</p>
  <h2><!--nchpdeb--><a name="chap_7_11">7.11. <!--nchpfin-->    Utilisation de l'historique local</a></h2>
  <p>L'historique local est une fonctionnalit&eacute; propos&eacute;e par Eclipse pour conserver un certain nombre de versions du code pour chaque &eacute;l&eacute;ment contenu dans l'espace de travail.</p>
  <p>Pour pouvoir utiliser l'historique local, il faut placer le curseur sur un &eacute;l&eacute;ment de code sinon un message d'erreur est affich&eacute;&nbsp;: </p>
  <p align="center"><img alt=""  width=441 height=107 src="images/java088.png" ></p>
  <p>L'option &quot;Historique local&quot; du menu contextuel propose 4 options&nbsp;: </p>
  <ul>
    <li>"&nbsp;Comparer &agrave; ...&nbsp;"
  <p align="center"><img alt=""  width=500 height=237 src="images/java089.png" ></p>
  <p>Cette option permet de comparer la version contenue dans l'&eacute;diteur avec celles contenues dans l'historique. Il n'est pas possible de reporter les modifications avec cette option.</p>
  </li>
    <li>"&nbsp;Remplacer par l'&eacute;l&eacute;ment pr&eacute;c&eacute;dent&nbsp;"<br>
      <br>
      Cette option permet de remplacer la version de l'&eacute;diteur par la derni&egrave;re contenue dans l'historique&nbsp;: elle correspond &agrave; la derni&egrave;re sauvegarde.<br>
    </li>
    <li>"&nbsp;Remplacer par ...&nbsp;"
  <p align="center"><img alt=""  width=500 height=215 src="images/java090.png" ></p>
  <p>Il suffit de s&eacute;lectionner la version d&eacute;sir&eacute;e et de cliquer sur le bouton "Remplacer".</p>
</li> <li>
  <p>"&nbsp;Restaurer &agrave; partir de ...&nbsp;"</p>
  <p>Cette option permet de restaurer des &eacute;l&eacute;ments contenus dans l'historique mais qui ne sont plus pr&eacute;sents dans l'&eacute;diteur de code.</p>
  <p align="center"><img alt=""  width=400 height=129 src="images/java091.png" ></p>
  <p>Il suffit de cocher le ou les &eacute;l&eacute;ments et de s&eacute;lectionner la version de l'historique &agrave; restaurer et de cliquer sur le bouton "Restaurer".</p>
  </li></ul>
  <p>&nbsp;</p>

  <h2><!--nchpdeb--><a name="chap_7_12">7.12. <!--nchpfin-->    Externaliser les cha&icirc;nes</a></h2>
  <p>Eclipse poss&egrave;de une fonction permettant d'automatiser l'externalisation des cha&icirc;nes de caract&egrave;res dans un fichier de ressource afin de faciliter l'internationalisation de la classe trait&eacute;e.</p>
  <p>L'exemple de cette section utilise le code source suivant :</p>
  <p align="center"><img alt=""  width=545 height=211 src="images/java097.png" ></p>
  <p>Dans la vue "Package", il faut s&eacute;lectionner le fichier source puis utiliser l'option "&nbsp;Source / Externaliser les cha&icirc;nes&nbsp;" du menu contextuel.</p>
  <p>Eclipse analyse le code source &agrave; la cherche de cha&icirc;nes de caract&egrave;res et affiche l'assistant "&nbsp;Externalisation des cha&icirc;nes&nbsp;".</p>
  <p align="center"><img alt=""  width=400 height=316 src="images/java098.png" ></p>
  <p>La premi&egrave;re page de l'assistant permet de s&eacute;lectionner les cha&icirc;nes de caract&egrave;res &agrave; traiter d&eacute;tect&eacute;es par Eclipse.</p>
  <p>Pour chaque cha&icirc;ne, il est possible de changer le nom de la cl&eacute; associ&eacute;e &agrave; la cha&icirc;ne de caract&egrave;res et de pr&eacute;ciser si la cha&icirc;ne doit &ecirc;tre trait&eacute;e ou non. </p>
  <p>Pour modifier la cl&eacute;, il est possible de cliquer sur la cl&eacute; et de saisir le nouveau nom ou de s&eacute;lectionner la ligne de la cha&icirc;ne et de cliquer sur le bouton "&nbsp;Editer la cl&eacute;&nbsp;"</p>
  <p align="center"><img alt=""  width=399 height=121 src="images/java099.png" ></p>
  <p>Pour indiquer si la cha&icirc;ne doit &ecirc;tre trait&eacute;e, il est possible de cliquer plusieurs fois sur la case &agrave; cocher de la ligne correspondante pour obtenir le symbole correspondant &agrave; la valeur voulue ou de cliquer sur le bouton  "&nbsp;Convertir&nbsp;", "&nbsp;Jamais convertir&nbsp;" ou "&nbsp;Ignorer&nbsp;" apr&egrave;s avoir s&eacute;lectionn&eacute; la ligne d&eacute;sir&eacute;e.</p>
  <p>Un clic sur le bouton "&nbsp;Suivant&nbsp;" permet de pr&eacute;ciser des informations sur le fichier de ressource qui sera g&eacute;n&eacute;r&eacute;.</p>
  <p align="center"><img alt=""  width=608 height=368 src="images/java100.png" ></p>
  <p>Un clic sur le bouton "&nbsp;Suivant&nbsp;" affiche une liste des probl&egrave;mes d&eacute;tect&eacute;s.</p>
  <p align="center"><img alt=""  width=608 height=251 src="images/java101.png" ></p>
  <p>Un clic sur le bouton "&nbsp;Suivant&nbsp;" permet d'afficher une page qui pr&eacute;visualise les modifications qui vont &ecirc;tre apport&eacute;es.</p>
  <p align="center"><img alt=""  width=400 height=311 src="images/java102.png" ></p>
  <p>Il est possible de s&eacute;lectionner tout ou partie des modifications en les cochant.</p>
  <p>Un clic sur le bouton "Fin" met en oeuvre les modifications.</p>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_12_1">7.12.1. <!--nchpfin-->Rechercher les cha&icirc;nes externalis&eacute;es erron&eacute;es</a></h3>
  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse32.png" width="64" height="32" align="center"></td>
      <td>
  <p>Cette fonctionnalit&eacute; permet de rechercher des cl&eacute;s dans un
    fichier de ressource qui ne soient pas utilis&eacute;es ou qui sont en double.</p>
  <table border="1" cellpadding="4" cellspacing="0" width="100%" align=center >
    <tr bgcolor="#A6A5C2">
      <td>Exemple :</td>
    </tr>
    <tr>
      <td>
        <pre><code>public static void main(String[] args) {
  // TODO Raccord de m&eacute;thode auto-g&eacute;n&eacute;r&eacute;
  System.out.println(Messages.getString(&quot;chaine0&quot;)); //$NON-NLS-1$
  System.out.println(&quot;chaine 2&quot;); //$NON-NLS-1$
  System.out.println(Messages.getString(&quot;chaine2&quot;)); //$NON-NLS-1$
  System.out.println(&quot;chaine 4&quot;);
}</code></pre>
      </td>
    </tr>
  </table>
  <br>
  <p>Pour utiliser cette fonctionnalit&eacute;, il faut s&eacute;lectionner
    pr&eacute;alablement un fichier de ressource, un package ou un projet et utiliser
    l'option «&nbsp;Source / rechercher les cha&icirc;nes   externalis&eacute;es   qui ne fonctionnent pas&nbsp;».</p>
  <p>Il est n&eacute;cessaire qu'un moins un fichier de ressource soit
    pr&eacute;sent dans la s&eacute;lection sinon un message est affich&eacute;.</p>
  <p align="center"><img width=441 height=109 src="images/java250.png"></p>
  <table border="1" cellpadding="4" cellspacing="0" width="100%" align=center >
    <tr bgcolor="#A6A5C2">
      <td>Exemple de fichier message.properties :</td>
    </tr>
    <tr>
      <td>
        <pre><code>chaine0=chaine 1
chaine1=chaine 2
chaine2=chaine 3
chaine1=chaine 4</code></pre>
      </td>
    </tr>
  </table>
  <br>
  <p>L'ex&eacute;cution de cette fonctionnalit&eacute; sur l'exemple affiche le
    r&eacute;sultat suivant&nbsp;: </p>
  <p align="center"><img width=463 height=106 src="images/java251.png"></p>
  <p>Un double clic sur un des r&eacute;sultats de rechercher permet
    d'ouvrir le fichier de ressources en s&eacute;lectionnant la premi&egrave;re cl&eacute; concern&eacute;e
    par le probl&egrave;me.</p></td>
    </tr>
  </table>
  <p>&nbsp;</p>
  <h3><!--nchpdeb--><a name="chap_7_12_2">7.12.2. <!--nchpfin-->Recherche de l'utilisation d'une cl&eacute;</a></h3>
  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse32.png" width="64" height="32" align="center"></td>
      <td><p>Il est possible de trouver dans le code o&ugrave; est utilis&eacute;e une
    cl&eacute;. Pour cela, il faut ouvrir le fichier de ressource, positionner le curseur
    de la souris sur la cl&eacute; en maintenant la touche Ctrl enfonc&eacute;e (un hyperlien
    s'affiche sous la cl&eacute;)</p>
  <p align="center"><img width=469 height=132 src="images/java252.png"></p>
  <p>Il suffit alors de cliquer sur le bouton gauche de la source
    pour qu'Eclipse recherche les utilisations.</p>
  <p>Si la cl&eacute; n'est utilis&eacute;e qu'une seule fois alors la classe
    concern&eacute;e s'ouvre dans l'&eacute;diteur ou la cl&eacute; est utilis&eacute;e.</p>
  <p align="center"><img width=580 height=272 src="images/java253.png"></p>
  <p>Si la cl&eacute; est utilis&eacute;e dans plusieurs classes, une bo&icirc;te de
    dialogue permet de s&eacute;lectionner celle qui doit &ecirc;tre affich&eacute;e.</p>
  <p align="center"><img width=419 height=242 src="images/java254.png"></p>
  <p>La zone d&eacute;tails affiche les lignes concern&eacute;es.</p>
  <p>Il suffit de s&eacute;lectionner la classe d&eacute;sir&eacute;e et de cliquer
    sur le bouton «&nbsp;OK&nbsp;».</p></td>
    </tr>
  </table>
  <p>&nbsp;</p>
  <h2><!--nchpdeb--><a name="chap_7_13">7.13. <!--nchpfin-->Ouverture d'un type</a></h2>
  <p>Le bouton <img alt=""  width=23 height=22 src="images/java103.png" > de la barre d'outils permet de lancer l'outil "&nbsp;Ouverture d'un type&nbsp;". Cet outil est particuli&egrave;rement pratique pour rechercher et ouvrir dans l'&eacute;diteur le code d'une classe dont on conna&icirc;t tout ou partie du nom.</p>
  <p align="center"><img alt=""  width=307 height=351 src="images/java104.png" ></p>
  <p>Il suffit de saisir le d&eacute;but du nom de la classe ou de l'interface pour que la liste des entit&eacute;s r&eacute;pondant au crit&egrave;re se construise de fa&ccedil;on incr&eacute;mentale.</p>
  <p>Il est aussi possible de saisir un motif &agrave; l'aide des caract&egrave;res&nbsp;? pour repr&eacute;senter un caract&egrave;re quelconque unique et * pour repr&eacute;senter aucun ou plusieurs caract&egrave;res quelconques.</p>
  <p>La zone qualificatif affiche le ou les packages ou l'entit&eacute; est d&eacute;finie. Ce nom de package est suivi du nom du projet si l'entit&eacute; est d&eacute;finie dans l'espace de travail ou du nom du fichier qui contient la version compil&eacute;e pour une entit&eacute; externe.</p>
  <p>Une fois l'&eacute;l&eacute;ment voulu s&eacute;lectionn&eacute;, un clic sur le bouton "&nbsp;OK&nbsp;" ouvre l'&eacute;diteur avec cette entit&eacute;. </p>
  <p>&nbsp;</p>
  <h2><!--nchpdeb--><a name="chap_7_14">7.14. <!--nchpfin-->    Utilisation du scrapbook</a></h2>
  <p>Le scrapbook, traduit par "&nbsp;page de testeur de code&nbsp;", est une fonctionnalit&eacute; qui permet de tester des morceaux de code dans une machine virtuelle. Cette fonctionnalit&eacute; tr&egrave;s int&eacute;ressante &eacute;tait d&eacute;j&agrave; pr&eacute;sente dans l'outil Visual Age d'IBM.</p>
  <p>Pour pouvoir l'utiliser, il faut cr&eacute;er une nouvelle &quot;page de testeur de code&quot;, en utilisant une des possibilit&eacute;s d'Eclipse pour cr&eacute;er une nouvelle entit&eacute;.</p>
  <p>Comme pour la cr&eacute;ation de toute nouvelle entit&eacute;, un assistant permet de recueillir les informations n&eacute;cessaires &agrave; la cr&eacute;ation du scrapbook.</p>
  <p align="center"><img alt=""  width=438 height=407 src="images/java105.png" ></p>
  <p>Une &quot;page de testeur de code&quot; est physiquement un fichier contenant du code java et ayant une extension .jpage</p>
  <p>La seule page de l'assistant permet de s&eacute;lectionner le r&eacute;pertoire qui va contenir le fichier ainsi que son nom. Par d&eacute;faut, l'extension .jpage est ajout&eacute;e.</p>
  <p>Un clic sur le bouton &quot;Fin&quot; permet de g&eacute;n&eacute;rer le fichier et d'ouvrir l'&eacute;diteur avec son contenu.</p>
  <p>Le grand avantage est de pouvoir tester des morceaux de code sans avoir &agrave; cr&eacute;er une classe et une m&eacute;thode main() et de b&eacute;n&eacute;ficier de fonctionnalit&eacute;s particuli&egrave;res pour tester ce code.</p>
  <p>Exemple&nbsp;: </p>
  <p align="center"><img alt=""  width=347 height=110 src="images/java106.png" ></p>
  <p>Lors de l'&eacute;dition du code contenu dans le scrapbook, la barre d'outils est enrichie de plusieurs boutons qui permettent d'utiliser les principales fonctionnalit&eacute;s du scrapbook.</p>
  <table border="1" cellspacing="0" cellpadding="4">
    <tr>
      <td>
        <p>Bouton</p>
      </td>
      <td >
        <p>R&ocirc;le</p>
      </td>
    </tr>
    <tr>
      <td >
        <p><img alt=""  width=23 height=22
  src="images/java107.png" ></p>
      </td>
      <td >
        <p>Permet d'ex&eacute;cuter un morceau de code et d'&eacute;valuer le r&eacute;sultat de l'ex&eacute;cution</p>
      </td>
    </tr>
    <tr>
      <td >
        <p><img alt=""  width=23 height=22
  src="images/java108.png" ></p>
      </td>
      <td >
        <p>Permet d'afficher dans l'&eacute;diteur de code, le r&eacute;sultat de l'ex&eacute;cution d'un morceau de code</p>
      </td>
    </tr>
    <tr>
      <td >
        <p><img alt=""  width=23 height=22
  src="images/java109.png" ></p>
      </td>
      <td >
        <p>Permet d'ex&eacute;cuter un morceau de code et d'afficher le r&eacute;sultat dans la console</p>
      </td>
    </tr>
    <tr>
      <td >
        <p><img alt=""  width=23 height=22
  src="images/java110.png" ></p>
      </td>
      <td >
        <p>Permet d'arr&ecirc;ter l'ex&eacute;cution dans la machine virtuelle</p>
      </td>
    </tr>
    <tr>
      <td >
        <p><img alt=""  width=23 height=22
  src="images/java111.png" ></p>
      </td>
      <td >
        <p>Permet de d&eacute;finir les importations n&eacute;cessaires </p>
      </td>
    </tr>
  </table>
  <p>Les trois premiers boutons ne sont utilisables que si un morceau de code est s&eacute;lectionn&eacute; dans le scrapbook. Le quatri&egrave;me bouton n'est utilisable que si une machine virtuelle ex&eacute;cute du code du scrapbook.</p>
  <p>La fonction "&nbsp;Inspecter&nbsp;" permet de visualiser, dans la vue "&nbsp;Expressions&nbsp;", les valeurs des objets contenus dans le code s&eacute;lectionn&eacute;.</p>
  <p>Pour la mettre en oeuvre, il suffit de s&eacute;lectionner un morceau de code dans l'&eacute;diteur du scrapbook et de cliquer sur le bouton <img alt=""  width=23 height=22 src="images/java112.jpg" > ou d'utiliser l'option "&nbsp;Inspecter&nbsp;" du menu contextuel.</p>
  <p align="center"><img alt=""  width=499 height=243 src="images/java113.png" ></p>
  <p>La fonction "&nbsp;Affichage du r&eacute;sultat de l'ex&eacute;cution&nbsp;" permet d'ex&eacute;cuter un morceau de code et d'afficher le r&eacute;sultat de l'ex&eacute;cution dans l'&eacute;diteur juste apr&egrave;s la fin de la s&eacute;lection du morceau de code.</p>
  <p>Pour mettre en oeuvre cette fonctionnalit&eacute;, il faut s&eacute;lectionner un morceaux de code dans l'&eacute;diteur du scrapbook.</p>
  <p align="center"><img alt=""  width=330 height=135 src="images/java114.png" ></p>
  <p>Il faut ensuite cliquer sur le bouton <img alt=""  width=23 height=22 src="images/java115.jpg" > ou d'utiliser l'option "&nbsp;Afficher&nbsp;" du menu contextuel.</p>
  <p align="center"><img alt=""  width=331 height=136 src="images/java116.png" ></p>
  <p>L'affichage ins&egrave;re le type entre parenth&egrave;se et la valeur du r&eacute;sultat dans l'&eacute;diteur.</p>
  <p>La fonction "&nbsp;Ex&eacute;cuter&nbsp;" permet d'ex&eacute;cuter d'un morceau de code et d'afficher le r&eacute;sultat dans la vue "&nbsp;Console&nbsp;". Pour mettre en oeuvre cette fonctionnalit&eacute;, il faut s&eacute;lectionner un morceau de code dans l'&eacute;diteur du scrapbook.</p>
  <p align="center"><img alt=""  width=363 height=135 src="images/java117.png" ></p>
  <p>Il faut ensuite cliquer sur le bouton <img alt=""  width=23 height=22 src="images/java118.jpg" > ou utiliser l'option "&nbsp;Ex&eacute;cuter&nbsp;" du menu contextuel.</p>
  <p align="center"><img alt=""  width=363 height=122 src="images/java119.png" ></p>
  <p>Lors de l'ex&eacute;cution de code dans le scrapbook, une machine virtuelle d&eacute;di&eacute;e est lanc&eacute;e pour cette ex&eacute;cution. Pour pouvoir relancer une ex&eacute;cution, il faut arr&ecirc;ter le machine virtuelle pr&eacute;c&eacute;demment lanc&eacute;e. L'arr&ecirc;t de cette machine virtuelle peut se faire en cliquant sur le bouton <img alt=""  width=23 height=22 src="images/java120.jpg">.</p>
  <p>Lors de l'ex&eacute;cution de code dans le scrapbook, si une erreur de syntaxe est d&eacute;tect&eacute;e, celle ci est signal&eacute;e directement dans le code de l'&eacute;diteur</p>
  <p>Exemple&nbsp;: </p>
  <p align="center"><img alt=""  width=365 height=125 src="images/java121.png" ></p>
  <p>Lors de l'ex&eacute;cution de ce morceau de code, l'erreur suivante est affich&eacute;e dans l'&eacute;diteur</p>
  <p align="center"><img alt=""  width=444 height=125 src="images/java122.png" ></p>
  <p>La structure d'un fichier java classique n'&eacute;tant pas respecter dans le scrapbook, la gestion des clauses d'import est g&eacute;r&eacute;e de fa&ccedil;on particuli&egrave;re.</p>
  <p>Exemple&nbsp;: </p>
  <p align="center"><img alt=""  width=371 height=120 src="images/java123.png" ></p>
  <p>L'ex&eacute;cution de ce morceau de code g&eacute;n&egrave;re l'erreur suivante&nbsp;: </p>
  <p align="center"><img alt=""  width=542 height=121 src="images/java124.png" ></p>
  <p>Pour ajouter une clause import, il cliquer sur le bouton <img alt=""  width=23 height=22 src="images/java125.jpg" > ou utiliser l'option "&nbsp;D&eacute;finit les importations&nbsp;" du menu contextuel.</p>
  <p align="center"><img alt=""  width=438 height=249 src="images/java126.png" ></p>
  <p>Un clic sur le bouton "&nbsp;Ajouter un type&nbsp;" permet d'importer une classe ou une interface dans le scrapbook.</p>
  <p align="center"><img alt=""  width=296 height=382 src="images/java127.png" >.</p>
  <p>La zone de saisie du type permet une recherche incr&eacute;mentale dans toutes les entit&eacute;s d&eacute;finies dans le chemin de compilation du projet.</p>
  <p>Un clic sur le bouton "&nbsp;Ajouter un Package&nbsp;" permet d'importer un package</p>
  <p align="center"><img alt=""  width=326 height=256 src="images/java128.png" ></p>
  <p>La zone de saisie du package permet une recherche incr&eacute;mentale du package d&eacute;sir&eacute; parmi tous ceux d&eacute;finis dans le chemin de compilation du projet.</p>
  <p>Enfin pour supprimer l'importation d'une entit&eacute;, il suffit de la s&eacute;lectionner et de cliquer sur le bouton "&nbsp;Supprimer&nbsp;".</p>
  <p>L'assistant de code, est bien s&ucirc;re disponible dans l'&eacute;diteur du scrapbook toujours en utilisant la combinaison de touches &quot;Ctrl&quot; + &quot;Espace&quot;.</p>
  <p align="center"><img alt=""  width=384 height=209 src="images/java129.png" ></p>
  <p>&nbsp;</p>
  <h2><!--nchpdeb--><a name="chap_7_15">7.15. <!--nchpfin--> Le d&eacute;veloppement d'applets</a></h2>
  <p>Il faut cr&eacute;er un nouvelle classe qui h&eacute;rite de la classe java.applet.Applet</p> 
  <p align="center"><img width=524 height=547 src="images/java133.png"></p> 
  <p>La nouvelle classe est cr&eacute;&eacute;e et l'&eacute;diteur de code ouvre son source.</p> 
  <p>Pour faciliter la r&eacute;&eacute;criture des m&eacute;thodes utiles, il est possible d'utiliser l'option «&nbsp;source / Remplacer/Impl&eacute;menter les m&eacute;thodes ...&nbsp;» du menu contextuel de l'&eacute;diteur de code. </p> 
  <p align="center"><img width=346 height=453 src="images/java132.png"></p> 
  <p>Il suffit de cocher chaque m&eacute;thode d&eacute;sir&eacute;e et de cliquer sur le bouton «&nbsp;Ok&nbsp;».</p> 
  <p>Le code source est enrichi avec la ou les m&eacute;thodes s&eacute;lectionn&eacute;es&nbsp;: </p> 
  <table border="1" cellpadding="4" cellspacing="0" width="100%" align=center >
    <tr bgcolor="#A6A5C2">
      <td>Exemple  : </td>
    </tr>
    <tr>
      <td>
        <pre><code>    <span style='color:#3F7F5F'>/* (non-Javadoc)
     * @see java.awt.Component#paint(java.awt.Graphics)</span>
     */
    <b><span style='color:#7F0055'>public void</span></b> paint(Graphics arg0) {
      <span style='color:#3F7F5F'>// </span><b><span style='color:#7F9FBF'>TODO</span></b><span style='color:#3F7F5F'> Raccord de m&eacute;thode auto-g&eacute;n&eacute;r&eacute;</span>
      <b><span style='color:#7F0055'>super</span></b>.paint(arg0); 
    }</code></pre>
      </td>
    </tr>
  </table><br>
  <p>Il suffit d'ins&eacute;rer le code dans ces m&eacute;thodes.</p> 
  <p>Par exemple&nbsp;: </p>
  <table border="1" cellpadding="4" cellspacing="0" width="100%" align=center >
    <tr bgcolor="#A6A5C2">
      <td>Exemple  : </td>
    </tr>
    <tr>
      <td>
        <pre><code>     <span style='color:#3F7F5F'>/* (non-Javadoc)
      * @see java.awt.Component#paint(java.awt.Graphics)
      */</span>
     <b><span style='color:#7F0055'>public void</span></b> paint(Graphics arg0){
       <b><span style='color:#7F0055'>super</span></b>.paint(arg0);
       arg0.drawString(<span style='color:#2A00FF'>&quot;Bonjour&quot;</span>,50,50);
     }</code></pre>
      </td>
    </tr>
  </table><br>
  <p>Pour ex&eacute;cuter une applet, il faut utiliser l'option «&nbsp;Ex&eacute;cuter en tant que / Applet&nbsp;» du bouton «&nbsp;Ex&eacute;cuter&nbsp;» de la barre d'outils.</p> 
  <p align="center"><img width=208 height=269 src="images/java131.png"></p> 
  <p>&nbsp;</p>
  <h2><!--nchpdeb--><a name="chap_7_16">7.16. <!--nchpfin-->Le nettoyage du code</a></h2>
  <table width="100%"  border="0" cellspacing="0" cellpadding="4">
    <tr>
      <td width="74" valign="top" bgcolor="#EEEEEE" align="center"><img src="images/eclipse32.png" width="64" height="32" align="center"></td>
      <td>  <p>Le nettoyage du code peut s 'appliquer sur un projet, un
    package ou un fichier. Il suffit de s&eacute;lectionner l'un de ces &eacute;l&eacute;ments et
    d'utiliser l'option «&nbsp;Source / Nettoyer&nbsp; ...&nbsp;» du menu contextuel. </p>
        <p>Les fonctionnalit&eacute;s offertes par cet assistant sont
    nombreuses&nbsp;: la partie «&nbsp;Aper&ccedil;u&nbsp;» permet d'avoir une id&eacute;e sur
    les possibilit&eacute;s de chaque fonctionnalit&eacute;.</p>
  <p align="center"><img width=580 height=349 src="images/java245.png"></p>
  <p>L'option «&nbsp;Utiliser les blocs dans les instructions if/  while  /for/do&nbsp;» permet de d&eacute;finir le bloc contenant une
    instruction avec des accolades.</p>
  <p>L'option «&nbsp;Convertir les boucles for am&eacute;lior&eacute;es&nbsp;»
    permet de convertir les boucles au format Java 5.0.</p>
  <p>Le libell&eacute; de l'option «&nbsp;Utiliser le modificateur
    final lorsque cela est possible' est assez explicite.</p>
  <p align="center"><img width=580 height=350 src="images/java246.png"></p>
  <p>Ces options permettent de modifier l'acc&egrave;s aux membres.</p>
  <p align="center"><img width=580 height=349 src="images/java247.png"></p>
  <p>Ces options permettent de supprimer certaines d&eacute;clarations
    inutiles.</p>
  <p align="center"><img width=580 height=348 src="images/java248.png"></p>
  <p>Les options de l'onglet «&nbsp;Code manquant&nbsp;» permet
    d'ajouter les annotations manquantes d&eacute;finies par Java 5.0 et de g&eacute;n&eacute;rer un ID
    pour les classes s&eacute;rialisables.</p>
  <p>Un fois les nettoyages s&eacute;lectionn&eacute;s, il faut cliquer sur le
    bouton «&nbsp;Suivant&nbsp;»</p>
  <p align="center"><img width=539 height=359 src="images/java249.png"></p>
  <p>Un aper&ccedil;u des modifications est affich&eacute;. Chaque modification
    peut &ecirc;tre valid&eacute;e ou non en utilisant les cases &agrave; cocher dans
    «&nbsp;Modifications &agrave; apporter&nbsp;»</p>
  <p>Cliquer sur le bouton «&nbsp;Terminer&nbsp;» pour ex&eacute;cuter
    les modifications.</p></td>
    </tr>
  </table>
  <p>&nbsp;</p>
  <p>&nbsp;</p>
</div>
<!--PIED--><HR>
<table border="0" cellpadding="2" cellspacing="0" width="100%" bgcolor="#7B7BC2">
<TBODY>
<tr>
<td rowspan="2" align="center" width="50">&nbsp;</td><td rowspan="2" align="center" width="50">
<A HREF="partie2.htm" ALT="Partie 2 : le d&eacute;veloppement en Java">
<img src="FlecheG.gif" alt="Partie 2 : le d&eacute;veloppement en Java" align="left" border="0" hspace="0" width="31" height="31">
</a>
</td>
<td rowspan="2" align="center" width="50">
<A HREF="chap008.htm" ALT="8. D&eacute;boguer du code Java">
<img src="FlecheD.gif" alt="8. D&eacute;boguer du code Java" align="left" border="0" hspace="0" width="31" height="31">
</a>
</td>
<td rowspan="2" align="center" >
<a href="javascript:window.print()">
<img src="imprimer.gif" width="46" height="40" align="middle" alt="Imprimer" border="0">
</a>
</td>
<td rowspan="2" align="center" >
<a href="index.htm">
<img src="index.gif" alt="Sommaire" align="middle" border="0" hspace="0" width="34" height="31">
</a>
</td>
<td rowspan="2" align="center" >
<a href="indexavecframes.htm"  target="_top">
<img src="frame.png" alt="Consulter avec table des matières" align="middle" border="0" hspace="0" width="46" height="40">
</a>
</td>
<td align="right">
<font color="#FFFFFF" size="5"><b><i>Développons en Java avec Eclipse&nbsp;&nbsp;</i></b></font><font color="#FFFFFF" size="-2"> v 0.80&nbsp;&nbsp;</font></td>
<td  rowspan="2" align="center" valign="middle">
        <script language="JavaScript1.1">
<!--
hsh = new Date();
hsd = document;
//hsr = hsd.referrer.replace(/[<>]/g, '');
hsr = parent.document.referrer.replace(/[<>]/g,  '');
hsi = '<a href="http://www.xiti.com/xiti.asp?s=128624"';
hsi += ' TARGET="_top"><img width="39" height="25" border=0 ';
hsi += 'src="http://logv23.xiti.com/hit.xiti?s=128624';
hsi += '&p=';
hsi += '&hl=' + hsh.getHours() + 'x' + hsh.getMinutes() + 'x' + hsh.getSeconds();
if(parseFloat(navigator.appVersion)>=4)
{Xiti_s=screen;hsi += '&r=' + Xiti_s.width + 'x' + Xiti_s.height + 'x' + Xiti_s.pixelDepth + 'x' + Xiti_s.colorDepth;}
hsd.writeln(hsi + '&ref=' + hsr.replace(/&/g, '$') + '" title="Mesurez votre audience"></a><\!--');
//-->
</script>
        <noscript>
        <a href="http://www.xiti.com/xiti.asp?s=128624" target="_top"><img width="39" height="25" border=0 src="http://logv23.xiti.com/hit.xiti?s=128624&p=&" title="Mesurez votre audience"></a>
        </noscript>
        <!--//-->
      </td>
</tr>
<tr>
<td align="right"><font color="#FFFFFF" size="-2">Copyright (C) 2003-2007 Jean-Michel DOUDOUX &nbsp;&nbsp;</font></td>
</tr>
</TBODY>
</table>

</body>
</html>
