<html>
 <head> 
  <title>Les bases de donn&eacute;es et Eclipse</title> 
  <meta http-equiv="Content-type" content="text/html; charset=ISO-8859-1"> 
  <meta name="description" content=""> 
  <meta name="keywords" content="java tutorial cours dej eclipse"> 
  <meta name="robots" content="all"> 
  <meta name="revisit-after" content="2 months"> 
  <meta http-equiv="Content-Language" content="fr-FX"> 
  <meta name="author" content="Jean Michel DOUDOUX"> 
  <link href="dej_style.css" rel="stylesheet" type="text/css"> 
 </head>
 <body> 
  <!--ENTETE--> 
  <table border="0" cellpadding="2" cellspacing="0" width="100%" bgcolor="#7B7BC2"> 
   <tbody> 
    <tr> 
     <td rowspan="2" align="center" width="50">&nbsp;</td>
     <td rowspan="2" align="center" width="50"> <a href="chap030.htm" alt="30. Le plug-in EclipseUML "> <img src="FlecheG.gif" alt="30. Le plug-in EclipseUML " align="left" border="0" hspace="0" width="31" height="31"> </a> </td> 
     <td rowspan="2" align="center" width="50"> <a href="partie8.htm" alt="Partie 8 : Annexes"> <img src="FlecheD.gif" alt="Partie 8 : Annexes" align="left" border="0" hspace="0" width="31" height="31"> </a> </td> 
     <td rowspan="2" align="center"> <a href="javascript:window.print()"> <img src="imprimer.gif" width="46" height="40" align="middle" alt="Imprimer" border="0"> </a> </td> 
     <td rowspan="2" align="center"> <a href="index.htm"> <img src="index.gif" alt="Sommaire" align="middle" border="0" hspace="0" width="34" height="31"> </a> </td> 
     <td rowspan="2" align="center"> <a href="indexavecframes.htm" target="_top"> <img src="frame.png" alt="Consulter avec table des mati&egrave;res" align="middle" border="0" hspace="0" width="46" height="40"> </a> </td> 
     <td align="right"> <font color="#FFFFFF" size="5"><b><i>D&eacute;veloppons en Java avec Eclipse&nbsp;&nbsp;</i></b></font><font color="#FFFFFF" size="-2"> v 0.80&nbsp;&nbsp;</font></td> 
    </tr> 
    <tr> 
     <td align="right"><font color="#FFFFFF" size="-2">Copyright (C) 2003-2007 Jean-Michel DOUDOUX &nbsp;&nbsp;</font></td> 
    </tr> 
   </tbody> 
  </table> 
  <hr> 
  <p>&nbsp;</p> 
  <h1>
   <!--idrefpage value="bdd" -->
   <!--resumetitre value="pr&eacute;sente plusieurs plug-ins pour r&eacute;aliser des op&eacute;rations sur des bases de donn&eacute;es." -->
   <!--nchpdeb--><a name="chap_31">31. 
    <!--nchpfin-->Les bases de donn&eacute;es et Eclipse</a></h1> 
  <p>&nbsp;</p> 
  <p>&nbsp;</p> 
  <div align="justify"> 
   <p>Eclipse ne propose pas par d&eacute;faut de plug-in capable de g&eacute;rer ou de manipuler une base de donn&eacute;es, mais il existe de nombreux plug-in permettant d'accomplir certaines de ces t&acirc;ches. Ce chapitre va pr&eacute;senter quelques uns d'entres eux&nbsp;: </p> 
   <ul type="disc"> 
    <li>Quantum</li> 
    <li>JFaceDBC</li> 
    <li>DBEdit</li> 
    <li>Clay Database Modelling</li> 
   </ul> 
   <p>&nbsp;</p> 
   <h2>
    <!--nchpdeb--><a name="chap_31_1">31.1. 
     <!--nchpfin-->Quantum</a></h2> 
   <p>Quantum est un plug-in qui permet l'ex&eacute;cution de requ&ecirc;tes sur une base de donn&eacute;es. Il affiche une vue arborescente des bases de donn&eacute;es et propose plusieurs assistants pour effectuer des mises &agrave; jour sur les donn&eacute;es.</p> 
   <p>Les bases de donn&eacute;es support&eacute;es sont&nbsp;: Postgres, MySQL, Adabas-D, Oracle, DB2, DB2 for AS400.</p> 
   <p>Le site officiel est <a href="http://quantum.sourceforge.net/">http://quantum.sourceforge.net/</a></p> 
   <table border="1" cellspacing="0" cellpadding="4" width="50%"> 
    <tbody>
     <tr> 
      <td>&nbsp; </td> 
      <td> <p>Version utilis&eacute;e dans cette section</p></td> 
     </tr> 
     <tr> 
      <td> <p>Eclipse</p></td> 
      <td> <p>2.1.2</p></td> 
     </tr> 
     <tr> 
      <td> <p>J2RE</p></td> 
      <td> <p>1.4.2_02</p></td> 
     </tr> 
     <tr> 
      <td> <p>Quantum</p></td> 
      <td> <p>2.2.2.</p></td> 
     </tr> 
    </tbody>
   </table> 
   <p>La version utilis&eacute;e dans cette section n&eacute;cessite obligatoirement un JDK 1.4 pour fonctionner.</p> 
   <p>&nbsp;</p> 
   <h3>
    <!--nchpdeb--><a name="chap_31_1_1">31.1.1. 
     <!--nchpfin-->Installation et configuration</a></h3> 
   <p>Apr&egrave;s voir t&eacute;l&eacute;charg&eacute; le fichier quantum222.zip, il faut le d&eacute;compresser dans le r&eacute;pertoire qui contient le r&eacute;pertoire d'Eclipse (attention&nbsp;: le chemin des fichiers de l'archive contient d&eacute;j&agrave; le r&eacute;pertoire Eclipse).</p> 
   <p>Pour utiliser le plug-in, il faut ouvrir la perspective nomm&eacute;e "Quantum DB". </p> 
   <p align="center"><img border="0" width="244" height="233" src="images/bdd001.png"></p> 
   <p>Quantum propose plusieurs vues&nbsp;: </p> 
   <p align="center"><img border="0" width="600" height="250" src="images/bdd002.png"></p> 
   <p>Pour pouvoir utiliser une base de donn&eacute;es, il faut l'enregistrer dans le bookmark. Pour cela, dans la vue &laquo;&nbsp;Database Bookmarks&nbsp;&raquo;, cliquez sur le bouton <img border="0" width="23" height="22" src="images/bdd003.png">&nbsp;ou s&eacute;lectionnez l'option &laquo;&nbsp;New Bookmark&nbsp;&raquo; du menu contextuel.</p> 
   <p>Une boite de dialogue permet de saisir les informations concernant la base de donn&eacute;es.</p> 
   <p align="center"><img border="0" width="438" height="366" src="images/bdd004.png"></p> 
   <p>L'exemple ci dessous contient les param&egrave;tres pour une base de donn&eacute;es MySQL nomm&eacute;e "Test" avec le pilote MySQL Connector-J 3.0 (<a href="http://www.mysql.com/products/connector-j/">http://www.mysql.com/products/connector-j/</a>).</p> 
   <ul> 
    <li>&laquo;&nbsp;Bookmark name&nbsp;&raquo;&nbsp;: est le nom du bookmark (cette zone est libre)</li> 
    <li>&laquo;&nbsp;Username&nbsp;&raquo;&nbsp;: est le nom de l'utilisateur pour la connexion &agrave; la base de donn&eacute;es </li> 
    <li>&laquo;&nbsp;Password&nbsp;&raquo;&nbsp;: est le mot de passe de cet utilisateur</li> 
    <li>&laquo;&nbsp;Connect&nbsp;&raquo;&nbsp;: est la cha&icirc;ne de connexion d&eacute;pendante du pilote utilis&eacute; (jdbc:mysql://localhost/test dans l'exemple)</li> 
    <li>&laquo;&nbsp;Driver&nbsp;&raquo;&nbsp;: est le nom de la classe du pilote JDBC (com.mysql.jdbc.Driver dans l'exemple)</li> 
    <li>&laquo;&nbsp;Type&nbsp;:&nbsp;&raquo;&nbsp;: est le type de base de donn&eacute;es utilis&eacute;e</li> 
    <li>&laquo;&nbsp;Driver Name&nbsp;&raquo;&nbsp;: et le fichier jar qui contient le pilote JDBC (D:\java\mysql-connector-java-3.0.11-stable\mysql-connector-java-3.0.11-stable-bin.jar dans l'exemple)</li> 
   </ul> 
   <p>Un fois tous les param&egrave;tres requis saisis, il suffit de cliquer sur le bouton &laquo;&nbsp;Fin&nbsp;&raquo;.</p> 
   <p align="center"><img border="0" width="257" height="71" src="images/bdd005.png"></p> 
   <p>Le bookmark apparait dans la liste. Le menu contextuel propose alors plusieurs options permettant de modifier ou de supprimer le bookmark. L'option "Connect" permet de demander la connexion &agrave; la base de donn&eacute;es.</p> 
   <p>Aucun mot de passe n'ayant &eacute;t&eacute; fourni, une boite de dialogue demande le mot de passe.</p> 
   <p align="center"><img border="0" width="399" height="152" src="images/bdd006.png"></p> 
   <p>Si il n'y a aucun mot de passe, il suffit de cliquer sur le bouton "OK".</p> 
   <p align="center"><img border="0" width="257" height="155" src="images/bdd007.png"></p> 
   <p>La vue "Database Bookmarks" affiche l'arborescence de la base de donn&eacute;es. Dans l'exemple, la base de donn&eacute;es ne contient qu'une seule table nomm&eacute;e "personnes".</p> 
   <p>&nbsp;</p> 
   <h3>
    <!--nchpdeb--><a name="chap_31_1_2">31.1.2. 
     <!--nchpfin-->Afficher le contenu d'une table</a></h3> 
   <p>Pour afficher le contenu d'une table, il suffit de double cliquer sur une table dans la vue &laquo;&nbsp;Data Bookmarks&nbsp;&raquo;.</p> 
   <p>La vue &laquo;&nbsp;Quantum Table View&nbsp;&raquo; affiche alors le contenu de la table.</p> 
   <p align="center"><img border="0" width="527" height="180" src="images/bdd008.png"></p> 
   <p>Cette vue permet de trier et de filtrer le contenu de la table en cliquant que le bouton <img border="0" width="23" height="21" src="images/bdd009.png"></p> 
   <p align="center"><img border="0" width="491" height="270" src="images/bdd010.png"></p> 
   <p>Le filtre est d&eacute;fini dans la partie de gauche et le tri dans la partie de droite de la bo&icirc;te de dialogue.</p> 
   <p>Le menu contextuel de la vue &laquo;&nbsp;Quantum Table View&nbsp;&raquo; propose des options pour faire des mises &agrave; jour des donn&eacute;es de la table&nbsp;: insertion, modification et suppression.</p> 
   <p>Un assistant permet de saisir les donn&eacute;es &agrave; ajouter dans la nouvelle occurrence de la table : </p> 
   <p align="center"><img border="0" width="438" height="310" src="images/bdd011.png"></p> 
   <p>Une fois les donn&eacute;es saisies, il suffit de cliquer sur le bouton &laquo;&nbsp;Fin&nbsp;&raquo; pour que la requ&ecirc;te SQL g&eacute;n&eacute;r&eacute;e soit ex&eacute;cut&eacute;e. Pour voir les modifications dans la vue &laquo;&nbsp;Quantum Table View&nbsp;&raquo;, il faut cependant explicitement demander le rafraichissement en cliquant sur le bouton <img border="0" width="23" height="21" src="images/bdd012.png">.</p> 
   <p>Un assistant permet de modifier les donn&eacute;es d'une occurrence : </p> 
   <p align="center"><img border="0" width="438" height="314" src="images/bdd013.png"></p> 
   <p>Le principe de la construction dynamique de la requ&ecirc;te SQL est identique &agrave; celui de l'insertion d'une occurrence hormis le fait qu'il est possible de saisir les informations concernant la port&eacute;e de la requ&ecirc;te de mise &agrave; jour (clause Where).</p> 
   <p>L'assistant permettant la suppression d'une ou plusieurs occurrences s'utilise de la m&ecirc;me fa&ccedil;on : </p> 
   <p align="center"><img border="0" width="438" height="287" src="images/bdd014.png"></p> 
   <p>&nbsp;</p> 
   <h3>
    <!--nchpdeb--><a name="chap_31_1_3">31.1.3. 
     <!--nchpfin-->Ex&eacute;cution d'une requ&ecirc;te</a></h3> 
   <p>L'&eacute;diteur &laquo;&nbsp;Quantum SQL Query Editor&nbsp;&raquo; permer de saisir des requ&ecirc;tes SQL avec une coloration syntaxique.</p> 
   <p align="center"><img border="0" width="281" height="137" src="images/bdd015.png"></p> 
   <p>Le bouton <img border="0" width="23" height="22" src="images/bdd016.png">&nbsp;permet d'ex&eacute;cuter la requ&ecirc;te.</p> 
   <p>Si la requ&ecirc;te contient un erreur, alors un message d'erreur est affich&eacute; : </p> 
   <p align="center"><img border="0" width="441" height="146" src="images/bdd017.png"></p> 
   <p>Un rond rouge en bas de la vue signale aussi une erreur lors de la derni&egrave;re ex&eacute;cution.</p> 
   <p align="center"><img border="0" width="277" height="125" src="images/bdd018.png"></p> 
   <p>La vue &laquo;&nbsp;Quantum SQL Log&nbsp;&raquo; affiche des informations sur l'ex&eacute;cution des requ&ecirc;tes. </p> 
   <p align="center"><img border="0" width="281" height="117" src="images/bdd019.png"></p> 
   <p>Dans le cas d'une requ&ecirc;te d'interrogation, le r&eacute;sultat est affich&eacute; dans la vue &laquo;&nbsp;Quantum Table View&nbsp;&raquo;.</p> 
   <p align="center"><img border="0" width="281" height="221" src="images/bdd020.png"></p> 
   <p>Les boutons <img border="0" width="23" height="21" src="images/bdd021.png">&nbsp;et <img border="0" width="23" height="21" src="images/bdd022.png">&nbsp;permettent respectivement d'importer et d'exporter le contenu de l'&eacute;diteur dans un fichier poss&eacute;dant l'extension .sql par d&eacute;faut.</p> 
   <p>La vue permet aussi de g&eacute;rer les transactions. Le bouton <img border="0" width="23" height="21" src="images/bdd023.png">&nbsp;permet de pr&eacute;ciser si le mode fonctionnement est auto-commit (bouton enfonc&eacute;) ou manuel. Dans le mode manuel, le bouton <img border="0" width="23" height="22" src="images/bdd024.png">&nbsp;permet de faire un commit des op&eacute;rations non encore valid&eacute;es et le bouton <img border="0" width="23" height="21" src="images/bdd025.png">&nbsp;permet d'invalider les op&eacute;rations non encore valid&eacute;es (rollback).</p> 
   <p>La vue &laquo;&nbsp;Query History&nbsp;&raquo; contient&nbsp; un historique des requ&ecirc;tes ex&eacute;cut&eacute;es&nbsp;: un double clic sur une de ces requ&ecirc;tes permet de r&eacute;afficher son contenu dans la vue &laquo;&nbsp;Quantum SQL Query&nbsp;&raquo;.</p> 
   <p>&nbsp;</p> 
   <h2>
    <!--nchpdeb--><a name="chap_31_2">31.2. 
     <!--nchpfin-->JFaceDbc</a></h2> 
   <p>JFaceDBC est un plug-in qui propose de faciliter la manipulation d'une base de donn&eacute;es. Ce plug-in poss&egrave;de quelques fonctionnalit&eacute;s int&eacute;ressantes comme un syst&egrave;me de gestion des connexions avec chargement dynamique des pilotes, l'affichage sous la forme graphique du sch&eacute;ma de la base de donn&eacute;es ou la cr&eacute;ation pour une table des fichiers xml et java pour l'outil de mapping Hibernate.</p> 
   <p>Le site officiel est &agrave; l'url <a href="http://jfacedbc.sourceforge.net/">http://jfacedbc.sourceforge.net/</a></p> 
   <table border="1" cellspacing="0" cellpadding="4" width="50%"> 
    <tbody>
     <tr> 
      <td>&nbsp; </td> 
      <td> <p>Version utilis&eacute;e dans cette section</p></td> 
     </tr> 
     <tr> 
      <td> <p>Eclipse</p></td> 
      <td> <p>2.1.2</p></td> 
     </tr> 
     <tr> 
      <td> <p>J2RE</p></td> 
      <td> <p>1.4.2_02</p></td> 
     </tr> 
     <tr> 
      <td> <p>JFaceDBC</p></td> 
      <td> <p>2.2.1.</p></td> 
     </tr> 
    </tbody>
   </table> 
   <p>La version utilis&eacute;e dans cette section n&eacute;cessite un JDK 1.4 pour fonctionner.</p> 
   <p>&nbsp;</p> 
   <h3>
    <!--nchpdeb--><a name="chap_31_2_1">31.2.1. 
     <!--nchpfin-->Installation et configuration</a></h3> 
   <p>Apr&egrave;s voir t&eacute;l&eacute;charg&eacute; le fichier net.sf.jfacedbc_2.2.1.zip sur le site de JFaceDBC, il faut le d&eacute;compresser dans le r&eacute;pertoire qui contient Eclipse. A l'ex&eacute;cution suivante, il est n&eacute;cessaire de valider les modifications en attente et de relancer l'application. </p> 
   <p>Il est aussi possible d'installer JFaceDBC en utilisant le gestionnaire de mises &agrave; jour avec l'URL <a href="http://jfacedbc.sourceforge.net/update-site/site.xml">http://jfacedbc.sourceforge.net/update-site/site.xml</a></p> 
   <p>JFaceDBC propose une perspective particuli&egrave;re. </p> 
   <p align="center"><img border="0" width="244" height="232" src="images/bdd026.png"></p> 
   <p>Cette perspective se compose de plusieurs vues et editeurs.</p> 
   <p align="center"><img border="0" width="600" height="270" src="images/bdd027.png"></p> 
   <p>La vue "Drivers" permet de g&eacute;rer les pilotes JDBC. </p> 
   <p align="center"><img border="0" width="201" height="175" src="images/bdd028.png"></p> 
   <p>Un certain nombre d'entre eux sont pr&eacute;configur&eacute;s et charg&eacute;s dynamiquement si ils sont trouv&eacute;s dans le classpath. Si le chargement a r&eacute;ussi alors une petite coche bleu est affich&eacute;e au lieu d'une croix blanche dans un rond rouge.</p> 
   <p>Il est possible d'ajouter un nouveau pilote en cliquant sur le bouton <img border="0" width="23" height="22" src="images/bdd029.png">. Voici un exemple avec le pilote MySQL Connector-J 3.0</p> 
   <p align="center"><img border="0" width="600" height="411" src="images/bdd030.png"></p> 
   <p>Il faut renseigner le nom du pilote, un exemple d'URL de connexion, s&eacute;lectionner le fichier jar pour l'ajouter dans l'onglet &laquo;&nbsp;Extra Class Path&nbsp;&raquo;, saisir le nom de la classe du Pilote et cliquer sur le bouton &laquo;&nbsp;OK&nbsp;&raquo;</p> 
   <p>Si le chargement du pilote a r&eacute;ussi, alors la petite coche bleue est affich&eacute;e.</p> 
   <p align="center"><img border="0" width="201" height="277" src="images/bdd031.png"></p> 
   <p>La vue "Aliases" permet de g&eacute;rer des connexions. Pour ajouter un alias, il suffit de cliquer sur le bouton <img border="0" width="23" height="22" src="images/bdd032.png">&nbsp;&nbsp;ou d'utiliser l'option &laquo;&nbsp;Create New Alias&nbsp;&raquo; du menu contextuel.</p> 
   <p>Une boite de dialogue permet de saisir les informations concernant le nouvel alias de connexion.</p> 
   <p align="center"><img border="0" width="522" height="312" src="images/bdd033.png"></p> 
   <p>Il faut saisir un nom, s&eacute;lectionner le pilote parmis la liste de ceux d&eacute;finis, saisir l'URL de la connexion, le nom de l'utilisateur et son mot de passe.</p> 
   <p align="center"><img border="0" width="200" height="129" src="images/bdd034.png"></p> 
   <p>Pour ouvrir une connexion, il suffit de double cliquer sur l'alias ou d'utiliser l'option &laquo;&nbsp;Open &raquo; de son menu contextuel.</p> 
   <p align="center"><img border="0" width="438" height="280" src="images/bdd035.png"></p> 
   <p>Saisissez les informations et cliqueez sur le bouton "OK". JFaceDBC retrouve les informations de la base de donn&eacute;es</p> 
   <p align="center"><img border="0" width="450" height="153" src="images/bdd036.png"></p> 
   <p>La vue "Connections" affiche la ou les connexions actives&nbsp;: </p> 
   <p align="center"><img border="0" width="199" height="127" src="images/bdd037.png"></p> 
   <p>La vue &laquo;&nbsp;Database Structure&nbsp;&raquo; affiche les bases de donn&eacute;es accessibles via la connexion.</p> 
   <p align="center"><img border="0" width="311" height="255" src="images/bdd038.png"></p> 
   <p>La vue &laquo;&nbsp;Connection Info&nbsp;&raquo; permet d'obtenir des informations sur les param&egrave;tres de la connexion .</p> 
   <p align="center"><img border="0" width="431" height="273" src="images/bdd039.png"></p> 
   <p>Pour conna&icirc;tre la structure d'une table, il suffit de la s&eacute;lectionner dans la vue &laquo;&nbsp;Database Structure View&nbsp;&raquo;</p> 
   <p align="center"><img border="0" width="429" height="383" src="images/bdd040.png"></p> 
   <p>Les donn&eacute;es peuvent &ecirc;tre visualis&eacute;es dans l'onglet &laquo;&nbsp;Preview&nbsp;&raquo;.</p> 
   <p align="center"><img border="0" width="427" height="183" src="images/bdd041.png"></p> 
   <p>Une table poss&egrave;de un menu contextuel qui propose plusieurs options&nbsp;: </p> 
   <p align="center"><img border="0" width="307" height="133" src="images/bdd042.png"></p> 
   <p>L'option &laquo;&nbsp;Generate Select in SQL Editor&nbsp;&raquo; ouvre l'&eacute;diteur SQL (&laquo;&nbsp;SQL Editor&nbsp;&raquo;) avec une requ&ecirc;te permettant d'afficher le contenu de la table.</p> 
   <p>&nbsp;</p> 
   <h3>
    <!--nchpdeb--><a name="chap_31_2_2">31.2.2. 
     <!--nchpfin-->La mise &agrave; jour des donn&eacute;es d'une table.</a></h3> 
   <p>JFaceDBC propose une fonction pour mettre &agrave; jour les donn&eacute;es d'une table. </p> 
   <p>Attention, cette fonctionnalit&eacute; n'est utilisable qu'avec un pilote JDBC autorisant les d&eacute;placements des curseurs dans les deux sens.</p> 
   <p>Pour utiliser cette fonctionnalit&eacute;, il suffit d'utiliser l'option &laquo;&nbsp;Edit Table Data&nbsp;&raquo; du menu contextuel d'une table dans la vue &laquo;&nbsp;Database Structure&nbsp;&raquo;.</p> 
   <p align="center"><img border="0" width="438" height="244" src="images/bdd043.png"></p> 
   <p>Il suffit alors de cliquer sur les donn&eacute;es &agrave; modifier et de saisir sa nouvelle valeur : </p> 
   <p align="center"><img border="0" width="438" height="244" src="images/bdd044.png"></p> 
   <p>Il est possible d'appliquer un filtre pour limiter le nombre d'occurrences affich&eacute;es dans la grille. Pour cela, il suffit de saisir la clause where qui sera ajout&eacute;e &agrave; la requ&ecirc;te de s&eacute;lection et de cliquer sur le bouton &laquo;&nbsp;Apply&nbsp;&raquo;.</p> 
   <p align="center"><img border="0" width="438" height="216" src="images/bdd045.png"></p> 
   <p>&nbsp;</p> 
   <h3>
    <!--nchpdeb--><a name="chap_31_2_3">31.2.3. 
     <!--nchpfin-->L'&eacute;diteur SQL</a></h3> 
   <p>Pour ouvrir un nouvel &eacute;diteur SQL, il faut cr&eacute;er une nouvelle entit&eacute; du type &laquo;&nbsp; JFaceDBC/JFaceDBC SQL Editor&nbsp;&raquo;</p> 
   <p align="center"><img border="0" width="500" height="231" src="images/bdd046.png"></p> 
   <p>L'assistant demande ensuite le nom du fichier .sql qui sera cr&eacute;&eacute; et de s&eacute;lectionner le projet qui va le contenir.</p> 
   <p align="center"><img border="0" width="500" height="360" src="images/bdd047.png"></p> 
   <p>Un clic sur le bouton &laquo;&nbsp;Fin&nbsp;&raquo; cr&eacute;e le fichier et ouvre l'&eacute;diteur&nbsp;: </p> 
   <p align="center"><img border="0" width="415" height="142" src="images/bdd048.png"></p> 
   <p>La premi&egrave;re liste d&eacute;roulante permet de s&eacute;lectionner la connexion qui sera utilis&eacute;e.</p> 
   <p align="center"><img border="0" width="569" height="142" src="images/bdd049.png"></p> 
   <p>La seconde liste d&eacute;roulante permet de s&eacute;lectionner la base de donn&eacute;es &agrave; utiliser.</p> 
   <p>Le bouton <img border="0" width="23" height="22" src="images/bdd050.png">&nbsp;ou l'option &laquo;&nbsp;Execute SQL&nbsp;&raquo; du menu contextuel permet de lancer l'ex&eacute;cution de la requ&ecirc;te.</p> 
   <p>Le r&eacute;sultat de la requ&ecirc;te s'affiche dans la vue &laquo;&nbsp;SQL Results&nbsp;&raquo;.</p> 
   <p align="center"><img border="0" width="421" height="169" src="images/bdd051.png"></p> 
   <p>L'&eacute;diteur propose une coloration syntaxique des diff&eacute;rents &eacute;l&eacute;ments de la requ&egrave;te mais aussi une compl&eacute;tion de code pour les tables et les champs, ce qui est tr&egrave;s pratique. Cette fonction est appel&eacute;e en utilisant la combinaison de touches "Ctrl + espace".</p> 
   <p align="center"><img border="0" width="542" height="173" src="images/bdd052.png"></p> 
   <p>&nbsp;</p> 
   <h3>
    <!--nchpdeb--><a name="chap_31_2_4">31.2.4. 
     <!--nchpfin-->Vue graphique d'une base de donn&eacute;es</a></h3> 
   <p>Une autre fonctionnalit&eacute; int&eacute;ressante de JFaceDBC est de pouvoir afficher un sch&eacute;ma d'une base de donn&eacute;es sous une forme graphique.</p> 
   <p>Pour cela, il faut cr&eacute;er une nouvelle entit&eacute; de type "JFaceDBC/JFaceDBC SQL Schema Visualizer". </p> 
   <p align="center"><img border="0" width="500" height="229" src="images/bdd053.png"></p> 
   <p>L'assistant demande ensuite le nom du fichier .sqls qui sera cr&eacute;&eacute; et de s&eacute;lectionner le projet qui va le contenir.</p> 
   <p align="center"><img border="0" width="500" height="360" src="images/bdd054.png"></p> 
   <p>Un clic sur le bouton &laquo;&nbsp;Fin&nbsp;&raquo; cr&eacute;&eacute; le fichier et ouvre l'&eacute;diteur. Par d&eacute;faut, ce dernier est vide.</p> 
   <p align="center"><img border="0" width="419" height="96" src="images/bdd055.png"></p> 
   <p>Pour ajouter une nouvelle table au sch&eacute;ma, il suffit de faire un cliquer/glisser entre une table de la vue &laquo;&nbsp;Database Structure&nbsp;&raquo; et l'&eacute;diteur.</p> 
   <p align="center"><img border="0" width="283" height="151" src="images/bdd056.png"></p> 
   <p>Le menu contextuel de l'&eacute;diteur propose l'option &laquo;&nbsp;Reverse Database&nbsp;&raquo;. Un assistant demande de s&eacute;lectionner la connexion concern&eacute;e.</p> 
   <p align="center"><img border="0" width="438" height="231" src="images/bdd057.png"></p> 
   <p>Il suffit de s&eacute;lectionner la connexion concern&eacute;e et de cliquer sur le bouton &laquo;&nbsp;Suivant&nbsp;&raquo;.</p> 
   <p>Il faut ensuite s&eacute;lectionner la ou les bases de donn&eacute;es &agrave; inclure parmis celles accessibles via la connexion.</p> 
   <p align="center"><img border="0" width="438" height="272" src="images/bdd058.png"></p> 
   <p>Cliquer sur le bouton &laquo;&nbsp;Suivant&nbsp;&raquo;. L'assistant demande de s&eacute;lectionner la ou les tables concern&eacute;es.</p> 
   <p align="center"><img border="0" width="438" height="306" src="images/bdd059.png"></p> 
   <p>Un clic sur le bouton &laquo;&nbsp;Fin&nbsp;&raquo; g&eacute;n&eacute;re le sch&eacute;ma dans l'&eacute;diteur.</p> 
   <p>&nbsp;</p> 
   <h2>
    <!--nchpdeb--><a name="chap_31_3">31.3. 
     <!--nchpfin-->DBEdit</a></h2> 
   <p>DBEdit est un plug-in qui permet l'ex&eacute;cution de requ&ecirc;tes sur une base de donn&eacute;es. </p> 
   <p>Le site officiel est <a href="http://sourceforge.net/projects/dbedit">http://sourceforge.net/projects/dbedit</a></p> 
   <table border="1" cellspacing="0" cellpadding="4" width="50%"> 
    <tbody>
     <tr> 
      <td>&nbsp; </td> 
      <td> <p>Version utilis&eacute;e</p></td> 
     </tr> 
     <tr> 
      <td> <p>Eclipse</p></td> 
      <td> <p>2.1.2</p></td> 
     </tr> 
     <tr> 
      <td> <p>J2RE</p></td> 
      <td> <p>1.4.2_02</p></td> 
     </tr> 
     <tr> 
      <td> <p>DBEdit</p></td> 
      <td> <p>1.0.1.</p></td> 
     </tr> 
    </tbody>
   </table> 
   <p>&nbsp;</p> 
   <h3>
    <!--nchpdeb--><a name="chap_31_3_1">31.3.1. 
     <!--nchpfin-->Installation et configuration.</a></h3> 
   <p>Il faut t&eacute;l&eacute;charger le fichier dbedit_1.0.1.bin.dist.zip sur le site de DBEdit et d&eacute;compresser son contenu dans le r&eacute;pertoire d'installation d'Eclipse. A l'ex&eacute;cution suivante, il est n&eacute;cessaire de valider les modifications en attente et de relancer l'application. </p> 
   <p>Il est aussi possible d'utiliser l'URL <a href="http://www.geocities.com/uwe_ewald/dbedit/site">http://www.geocities.com/uwe_ewald/dbedit/site</a> dans le gestionnaire des mises &agrave; jour. </p> 
   <p>DBEdit propose une perspective particuli&egrave;re. </p> 
   <p align="center"><img border="0" width="244" height="229" src="images/bdd060.png"></p> 
   <p>Cette perspective se compose de plusieurs vues et editeurs.</p> 
   <p align="center"><img border="0" width="600" height="245" src="images/bdd061.png"></p> 
   <p>La premi&egrave;re chose &agrave; faire est de d&eacute;finir une connexion en utilisant l'option &laquo;&nbsp;Connection/Configure&nbsp;&raquo; du menu contextuel de la vue &laquo;&nbsp;Tables&nbsp;&raquo;. Une boite de dialogue permet de g&eacute;rer les connexions.</p> 
   <p align="center"><img border="0" width="541" height="217" src="images/bdd062.png"></p> 
   <p>Pour ajouter une nouvelle connexion, il suffit de cliquer sur le bouton &laquo;&nbsp;New&nbsp;&raquo;.</p> 
   <p align="center"><img border="0" width="541" height="388" src="images/bdd063.png">I</p> 
   <p>Il suffit alors de saisir les informations n&eacute;cessaires&nbsp;: </p> 
   <ul> 
    <li>Name&nbsp;: est le nom de la connexion</li> 
    <li>JDBC Driver&nbsp;: permet de pr&eacute;ciser le nom de la classe du pilote JDBC</li> 
    <li>Serveur URL&nbsp;: est l'URL de connexion</li> 
    <li>User et password&nbsp;: sont le nom et le mot de passe de l'utilisateurs</li> 
   </ul> 
   <p>Un clic sur le bouton &laquo;&nbsp;Apply&nbsp;&raquo; valide les informations. </p> 
   <p>Il faut ensuite ajouter le pilote au classpath&nbsp;en cliquant sur l'onglet &laquo;&nbsp;Classpath&nbsp;&raquo;</p> 
   <p align="center"><img border="0" width="541" height="388" src="images/bdd064.png"></p> 
   <p>Il suffit de cliquer sur le bouton &laquo;&nbsp;Add Archive&nbsp;&raquo; et de s&eacute;lectionner le fichier Jar contenant le pilote &agrave; utiliser.</p> 
   <p>L'onglet &laquo;&nbsp;Additional&nbsp;&raquo; permet de pr&eacute;ciser des param&egrave;tres suppl&eacute;mentaires au pilote JDBC.</p> 
   <p>Un clic sur le bouton &laquo;&nbsp;Connect&nbsp;&raquo; permet d'ouvrir la connexion.</p> 
   <p>&nbsp;</p> 
   <h3>
    <!--nchpdeb--><a name="chap_31_3_2">31.3.2. 
     <!--nchpfin-->La vue &laquo;&nbsp;Tables&nbsp;&raquo;</a></h3> 
   <p>Par d&eacute;faut, elle affiche la liste des connexions enregistr&eacute;es. Pour ouvrir une connexion, il suffit d'utiliser l'option &laquo;&nbsp;Connection/Connect&nbsp;&raquo; du menu contextuel d'une connexion.</p> 
   <p align="center"><img border="0" width="181" height="132" src="images/bdd065.png"></p> 
   <p>Si le pilote n'est pas inclus dans le classpath, un message d'erreur est affich&eacute; </p> 
   <p align="center"><img border="0" width="443" height="133" src="images/bdd066.png"></p> 
   <p>Une fois la connexion &eacute;tablie, la vue &laquo;&nbsp;Tables&nbsp;&raquo; affiche une arborescence contenant les &eacute;l&eacute;ments de la base de donn&eacute;es&nbsp;: tables, vues, champs, index ....</p> 
   <p align="center"><img border="0" width="215" height="195" src="images/bdd067.png"></p> 
   <p>A partir du menu contextuel de cette vue, il est possible de r&eacute;aliser plusieurs actions&nbsp;: </p> 
   <ul type="disc"> 
    <li>cr&eacute;er une nouvelle entit&eacute;&nbsp;: connexion, sch&eacute;ma, table, fichier SQL</li> 
    <li>importer ou exporter une table</li> 
    <li>ouvrir une table dans l'&eacute;diteur</li> 
   </ul> 
   <p>L'export se fait avec un assistant&nbsp;: </p> 
   <p align="center"><img border="0" width="470" height="312" src="images/bdd068.png"></p> 
   <p>Il faut s&eacute;lectionner "Database" et cliquer sur le bouton &laquo;&nbsp;Suivant&nbsp;&raquo;</p> 
   <p align="center"><img border="0" width="470" height="313" src="images/bdd069.png"></p> 
   <p>Il faut s&eacute;lectionner la connexion et les tables concern&eacute;es, s&eacute;lectionner le r&eacute;pertoire de destination et cliquer sur le bouton &laquo;&nbsp;Fin&nbsp;&raquo;.</p> 
   <p>L'exportation se fait sous le forme de requ&egrave;tes SQL : </p> 
   <p align="center"><img border="0" width="518" height="147" src="images/bdd070.png"></p> 
   <p>L'importation se fait aussi avec un assistant</p> 
   <p align="center"><img border="0" width="521" height="384" src="images/bdd071.png"></p> 
   <p>Il suffit de s&eacute;lectionner les entit&eacute;s et de cliquer sur le bouton &laquo;&nbsp;Suivant&nbsp;&raquo;. La page suivante permet de pr&eacute;ciser les options de correspondance des types de donn&eacute;es.</p> 
   <p align="center"><img border="0" width="521" height="311" src="images/bdd072.png"></p> 
   <p>Un clic sur le bouton &laquo;&nbsp;Fin&nbsp;&raquo; permet de lancer l'importation.</p> 
   <p>Un clic sur le bouton <img border="0" width="23" height="22" src="images/bdd073.png">&nbsp;permet de r&eacute;gler certaines options d'affichage.</p> 
   <p align="center"><img border="0" width="246" height="148" src="images/bdd074.png"></p> 
   <p>L'option "Filters" permet de restreindre les types d'&eacute;l&eacute;ments qui sont affich&eacute;s&nbsp;: </p> 
   <p align="center"><img border="0" width="346" height="312" src="images/bdd075.png"></p> 
   <p>&nbsp;</p> 
   <h3>
    <!--nchpdeb--><a name="chap_31_3_3">31.3.3. 
     <!--nchpfin-->L'editeur &laquo;&nbsp;Table&nbsp;&raquo;</a></h3> 
   <p>Sur la vue &laquo;&nbsp;Tables&nbsp;&raquo;, l'option &laquo;&nbsp;Open with/ Table Editor&nbsp;&raquo; du menu contextuel d'une table permet d'ouvrir un &eacute;diteur avec les donn&eacute;es de la table.</p> 
   <p align="center"><img border="0" width="497" height="128" src="images/bdd076.png"></p> 
   <p>Par d&eacute;faut, l'&eacute;diteur est en mode consultation. Le menu contextuel permet de r&eacute;aliser certaines op&eacute;rations&nbsp;: </p> 
   <ul> 
    <li>Edit Mode&nbsp;: permet de basculer dans le mode de mise &agrave; jour des donn&eacute;es pour un seul champ</li> 
    <li>Insert Row&nbsp;: permet d'ins&eacute;rer une nouvelle occurrence dans la table</li> 
    <li>Delete Row&nbsp;: permet de supprimer l'occurrence s&eacute;lectionn&eacute;e</li> 
   </ul> 
   <p>Chaque mise &agrave; jour doit &ecirc;tre confirm&eacute;e dans une bo&icirc;te de dialogue</p> 
   <p align="center"><img border="0" width="441" height="109" src="images/bdd077.png"></p> 
   <p>Un clic sur le bouton &laquo;&nbsp;Details&nbsp;&raquo; permet d'obtenir des informations pr&eacute;cises sur l'op&eacute;ration.</p> 
   <p align="center"><img border="0" width="441" height="215" src="images/bdd078.png"></p> 
   <p>Le bouton <img border="0" width="23" height="22" src="images/bdd079.png">&nbsp;dans la barre d'outils permet de rafraichir les donn&eacute;es de l'&eacute;diteur. Le bouton <img border="0" width="23" height="22" src="images/bdd080.png">&nbsp;dans la barre d'outils permet de saisir un filtre.</p> 
   <p align="center"><img border="0" width="499" height="131" src="images/bdd081.png"></p> 
   <p>&nbsp;</p> 
   <h3>
    <!--nchpdeb--><a name="chap_31_3_4">31.3.4. 
     <!--nchpfin-->La vue Log</a></h3> 
   <p>Cette vue recense toutes les requ&ecirc;tes SQL qui sont ex&eacute;cut&eacute;es.</p> 
   <p align="center"><img border="0" width="498" height="119" src="images/bdd082.png"></p> 
   <p>&nbsp;</p> 
   <h3>
    <!--nchpdeb--><a name="chap_31_3_5">31.3.5. 
     <!--nchpfin-->L'&eacute;diteur Instant SQL</a></h3> 
   <p>Cet &eacute;diteur permet de saisir et d'ex&eacute;cuter des requ&ecirc;tes. Il suffit de saisir la requ&ecirc;te dans la zone d'&eacute;dition</p> 
   <p align="center"><img border="0" width="437" height="158" src="images/bdd083.png"></p> 
   <p>puis de cliquer sur le bouton <img border="0" width="23" height="22" src="images/bdd084.png">&nbsp;pour lancer l'ex&eacute;cution</p> 
   <p align="center"><img border="0" width="435" height="216" src="images/bdd085.png"></p> 
   <p>Il est possible de limiter le nombre d'occurences renvoy&eacute;es par une requ&ecirc;te. Ceci est n&eacute;cessaire pour des tables poss&egrave;dant de nombreuses occurences car dans ce cas un affichage de toutes les occurences provoque une exception de type OutOfMemory. Ce nombre d'occurences est r&eacute;glable dans les pr&eacute;f&eacute;rences.</p> 
   <p align="center"><img src="images/bdd119.png" width="516" height="502"></p> 
   <p>La version 1.0.2 propose une pagination sur les occurences obtenues en fonction du nombre d'occurences maximales &agrave; afficher. Pour l'activer, il faut utiliser l'option "Toogle" du menu contextuel de la barre de titre "R&eacute;sultats".</p> 
   <p align="center"><img src="images/bdd120.png" width="228" height="115"></p> 
   <p>L'activation de cette option affiche un panneau permettant la pagination.</p> 
   <p align="center"><img src="images/bdd121.png" width="418" height="50"> </p> 
   <p>&nbsp;</p> 
   <h2>
    <!--nchpdeb--><a name="chap_31_4">31.4. 
     <!--nchpfin-->Clay Database Modelling</a></h2> 
   <p>Ce plug-in permet de concevoir ou retro-concevoir une base de donn&eacute;es graphiquement.</p> 
   <p>Les base de donn&eacute;es support&eacute;es sont&nbsp;: HSQLDB, MySQL, PostgreSQL, Firebird, ANSI SQL-92, SAP DB, McKoi.</p> 
   <p>Le site officiel&nbsp; est <a href="http://www.azzurri.jp/en/software/clay/index.jsp">http://www.azzurri.jp/en/software/clay/index.jsp</a></p> 
   <table border="1" cellspacing="0" cellpadding="4"> 
    <tbody>
     <tr> 
      <td>&nbsp; </td> 
      <td nowrap>Version utilis&eacute;e dans cette section</td> 
     </tr> 
     <tr> 
      <td> <p>Eclipse</p></td> 
      <td> <p>2.1.2</p></td> 
     </tr> 
     <tr> 
      <td> <p>J2RE</p></td> 
      <td> <p>1.4.2_02</p></td> 
     </tr> 
     <tr> 
      <td> <p>Clay Database Modelling</p></td> 
      <td> <p>0.9.5</p></td> 
     </tr> 
    </tbody>
   </table>
   <br> 
   <p>Ce plug-in n&eacute;cessite le plug-in GEF (Graphical Editor Framework). Si il est absent, un message d'erreur est affich&eacute;. </p> 
   <p align="center"><img border="0" width="443" height="194" src="images/bdd086.png"> </p> 
   <p>&nbsp;</p> 
   <h3>
    <!--nchpdeb--><a name="chap_31_4_1">31.4.1. 
     <!--nchpfin-->Installation et configuration.</a></h3> 
   <p>Il faut t&eacute;l&eacute;charger le fichier jp.azzurri.clay.core_0.9.5.bin.dist.20031201.zip sur le site du plug-in&nbsp; et d&eacute;compresser son contenu dans le r&eacute;pertoire d'installation d'Eclipse. A l'ex&eacute;cution suivante, il est n&eacute;cessaire de valider les modifications en attente et de relancer l'application. </p> 
   <p>L'installation par le gestionnaire de mises &agrave; jour est possible en utilisant l'url <a href="http://www.azzurri.jp/eclipse/plugins">http://www.azzurri.jp/eclipse/plugins</a></p> 
   <p>&nbsp;</p> 
   <h3>
    <!--nchpdeb--><a name="chap_31_4_2">31.4.2. 
     <!--nchpfin-->Mise en oeuvre</a></h3> 
   <p>Clay Database Modelling ne propose pas de perspective particuli&egrave;re. </p> 
   <p>Il faut cr&eacute;er un nouveau projet ou utiliser un projet existant. Dans ce projet, il faut d&eacute;finir un nouveau mod&egrave;le en utilisant l'option de cr&eacute;ation d'un nouvel &eacute;l&eacute;ment de type &laquo;&nbsp;Autre ... &nbsp;&raquo;.</p> 
   <p align="center"><img border="0" width="500" height="265" src="images/bdd087.png"></p> 
   <p>Il faut s&eacute;lectionner &laquo;&nbsp;Database design&nbsp;&raquo; et &laquo;&nbsp;Azzurri Clay Database Design Diagram&nbsp;&raquo;&nbsp; puis cliquer sur le bouton &laquo;&nbsp;Suivant&nbsp;&raquo;.</p> 
   <p align="center"><img border="0" width="500" height="400" src="images/bdd088.png"></p> 
   <p>Il faut s&eacute;lectionner l'emplacement du fichier de donn&eacute;es (par d&eacute;faut le r&eacute;pertoire du projet en cours), saisir le nom de ce fichier, et s&eacute;lectionner le type de base de donn&eacute;es cible dans lequel les scripts SQL seront g&eacute;n&eacute;r&eacute;s.</p> 
   <p>Un &eacute;diteur d&eacute;di&eacute; s'ouvre avec le fichier cr&eacute;&eacute;, par d&eacute;faut vide.</p> 
   <p align="center"><img border="0" width="324" height="117" src="images/bdd089.png"></p> 
   <p>L'option &laquo;&nbsp;Edit Database Model&nbsp;&raquo; du menu contextuel permet de saisir des informations concernant le mod&egrave;le.</p> 
   <p align="center"><img border="0" width="532" height="272" src="images/bdd090.png"></p> 
   <p>Dans cette bo&icirc;te de dialogue, la donn&eacute;e &laquo;&nbsp;SQL Dialect&nbsp;&raquo; est particuli&egrave;rement importante car elle va conditionner les possibilit&eacute;s de l'&eacute;diteur selon le type de base de donn&eacute;es s&eacute;lectionn&eacute;es, notamment par exemple au niveau des types de donn&eacute;es utilisables dans les d&eacute;finitions de tables.</p> 
   <p>Le bouton <img border="0" width="46" height="19" src="images/bdd091.png">&nbsp;permet d'ajouter une nouvelle table au mod&egrave;le en cliquant sur le bouton puis sur la zone d'&eacute;dition de l'&eacute;diteur.</p> 
   <p>L'option &laquo;&nbsp;Edit Table&nbsp;&raquo; du menu contextuel permet de saisir des donn&eacute;es g&eacute;n&eacute;rales de la table tel que son nom, une description ou des remarques.</p> 
   <p align="center"><img border="0" width="530" height="258" src="images/bdd093.png"></p> 
   <p>Un double clic sur la nouvelle table cr&eacute;&eacute;e ou l'utilisation de l'option &laquo;&nbsp;Edit Table Column&nbsp;&raquo; permet de saisir la description des champs qu'elle va contenir.</p> 
   <p align="center"><img border="0" width="646" height="338" src="images/bdd094.png"></p> 
   <p>Pour ajouter une nouvelle colonne, il suffit de cliquer sur le bouton &laquo;&nbsp;Add New&nbsp;&raquo;</p> 
   <p align="center"><img border="0" width="646" height="382" src="images/bdd095.png"></p> 
   <p>Il suffit alors de saisir les donn&eacute;es du nouveau champ. L'op&eacute;ration doit &ecirc;tre r&eacute;p&eacute;t&eacute;e pour chaque table du mod&egrave;le. Exemple : </p> 
   <p align="center"><img border="0" width="452" height="148" src="images/bdd096.png"></p> 
   <p>La vue "Structure" affiche sous une forme arborescente la structure du mod&egrave;le avec les diff&eacute;rents &eacute;l&eacute;ments qui la compose. </p> 
   <p align="center"><img border="0" width="233" height="208" src="images/bdd097.png"></p> 
   <p>Il est possible de cr&eacute;er des index en utilisant l'option &laquo;&nbsp;Edit Table Indexes&nbsp;&raquo; du menu contextuel.</p> 
   <p align="center"><img border="0" width="619" height="259" src="images/bdd098.png"></p> 
   <p>Pour ajouter un nouvel index, il faut cliquer sur le bouton &laquo;&nbsp;New&nbsp;&raquo;</p> 
   <p align="center"><img border="0" width="619" height="264" src="images/bdd099.png"></p> 
   <p>Pour ajouter un champ dans l'index, il faut cliquer sur le bouton &laquo;&nbsp;New&nbsp;&raquo; dans &laquo;&nbsp;Key Column List&nbsp;&raquo;</p> 
   <p align="center"><img border="0" width="416" height="162" src="images/bdd100.png"></p> 
   <p>S&eacute;lectionnez le champ et cliquez sur le bouton &laquo;&nbsp;Ok&nbsp;&raquo;. Une fois toute les informations saisies, il suffit de cliquer sur le bouton &laquo;&nbsp;OK&nbsp;&raquo;. Le nouvel index appara&icirc;t dans la vue &laquo;&nbsp;Structure&nbsp;&raquo;.</p> 
   <p>Il est possible de d&eacute;finir des index uniques en utilisant l'option &laquo;&nbsp;Edit Table Unique Keys&nbsp;&raquo; du menu contextuel.</p> 
   <p align="center"><img border="0" width="619" height="257" src="images/bdd101.png"></p> 
   <p>Pour ajouter un nouvel index, il faut cliquer sur le bouton &laquo;&nbsp;New&nbsp;&raquo;</p> 
   <p align="center"><img border="0" width="619" height="249" src="images/bdd102.png"></p> 
   <p>Pour ajouter un champ dans l'index, il faut cliquer sur le bouton &laquo;&nbsp;New&nbsp;&raquo; dans &laquo;&nbsp;Key Column List&nbsp;&raquo;.</p> 
   <p align="center"><img border="0" width="416" height="160" src="images/bdd103.png"></p> 
   <p>S&eacute;lectionnez le champ et cliquez sur le bouton &laquo;&nbsp;Ok&nbsp;&raquo;. Une fois toutes les informations saisies, il suffit de cliquer sur le bouton &laquo;&nbsp;OK&nbsp;&raquo;. Le nouvel index appara&icirc;t dans la vue &laquo;&nbsp;Structure&nbsp;&raquo;</p> 
   <p align="center"><img border="0" width="205" height="241" src="images/bdd104.png"></p> 
   <p>Le bouton <img border="0" width="46" height="19" src="images/bdd105.png">&nbsp;permet de cr&eacute;er des relations entre deux tables. Pour cela, il faut cliquer sur le bouton, cliquer sur la table contenant la cl&eacute; &eacute;trang&egrave;re puis cliquer sur la table r&eacute;f&eacute;rence.</p> 
   <p align="center"><img border="0" width="600" height="150" src="images/bdd106.png"></p> 
   <p>Le lien entre les deux tables apparait sous la forme d'une fl&egrave;che bleu entre les deux tables. Le menu contextuel &laquo;&nbsp;Edit Foreign Key&nbsp;&raquo; permet de modifier la cl&eacute; &eacute;trang&egrave;re.</p> 
   <p align="center"><img border="0" width="548" height="420" src="images/bdd107.png"></p> 
   <p>&nbsp;</p> 
   <h3>
    <!--nchpdeb--><a name="chap_31_4_3">31.4.3. 
     <!--nchpfin-->R&eacute;tro-conception d'un mod&egrave;le</a></h3> 
   <p>L'option &laquo;&nbsp;Reverse Engineer Database&nbsp;&raquo; <img border="0" width="22" height="22" src="images/bdd109.png">&nbsp;&nbsp;du menu contextuel de l'&eacute;diteur permet de r&eacute;tro-concevoir un mod&egrave;le &agrave; partir d'une base de donn&eacute;es existante.</p> 
   <p>Un assistant permet de s&eacute;lectionner ou de saisir les informations concernant la connexion &agrave; la base de donn&eacute;es.</p> 
   <p align="center"><img border="0" width="539" height="230" src="images/bdd110.png"></p> 
   <p>Cliquez sur le bouton &laquo;&nbsp;Add New&nbsp;&raquo;</p> 
   <p align="center"><img border="0" width="390" height="268" src="images/bdd111.png"></p> 
   <p>Une boite de dialogue permet de saisir les informations n&eacute;cessaires &agrave; la connexion : </p> 
   <ul> 
    <li>le type de connexion peut &ecirc;tre choisi dans la liste&nbsp;: si celui ci n'appara&icirc;t pas dans la liste, alors il faut s&eacute;lectionner &laquo;&nbsp;unknown&nbsp;&raquo;</li> 
    <li>l'alias est un nom qui permet de reconna&icirc;tre la connexion</li> 
    <li>user et password sont le nom de l'utilisateur et son mot de passe utilis&eacute; pour la connexion</li> 
    <li>JDBC Driver est le nom pleinement qualifi&eacute; de la classe contenant le pilote &agrave; utiliser</li> 
    <li>Driver Location est le chemin du fichier jar contenant la classe du pilote</li> 
   </ul> 
   <p>Cliquez sur le bouton &laquo;&nbsp;Ok&nbsp;&raquo;.</p> 
   <p align="center"><img border="0" width="516" height="232" src="images/bdd112.png"></p> 
   <p>S&eacute;lectionnez l'alias et cliquez sur le bouton &laquo;&nbsp;Suivant&nbsp;&raquo;. La connexion &agrave; la base de donn&eacute;es s'effectue et l'assistant demande la s&eacute;lection du sch&eacute;ma. Dans l'exemple de cette section, il n'y en a pas.</p> 
   <p align="center"><img border="0" width="485" height="298" src="images/bdd113.png"></p> 
   <p>Cliquez sur le bouton &laquo;&nbsp;Suivant&nbsp;&raquo;. L'assistant demande de s&eacute;lectionner les tables qui doivent &ecirc;tre int&eacute;gr&eacute;es dans le mod&egrave;le.</p> 
   <p align="center"><img border="0" width="486" height="296" src="images/bdd114.png"></p> 
   <p>Pour s&eacute;lectionner une table, il suffit de la s&eacute;lectionner dans la liste de gauche et de la faire basculer dans la liste de droite en utilisant le bouton &laquo;&nbsp;&gt;&nbsp;&raquo;. Une fois la s&eacute;lection termin&eacute;e, il suffit de cliquer sur le bouton &laquo;&nbsp;Fin&nbsp;&raquo;.</p> 
   <p>L'assistant traite la demande et affiche le r&eacute;sultat des traitements dans l'&eacute;diteur.</p> 
   <p align="center"><img src="images/bdd115.png" width="440" height="125" border="0"></p> 
   <p>&nbsp;</p> 
   <h3>
    <!--nchpdeb--><a name="chap_31_4_4">31.4.4. 
     <!--nchpfin-->G&eacute;n&eacute;ration du DDL</a></h3> 
   <p>L'option &laquo;&nbsp;Generate SQL (CREATE TABLE) script&nbsp;&raquo; <img border="0" width="22" height="21" src="images/bdd116.png">&nbsp;permet de demander la cr&eacute;ation d'un fichier contenant les ordres de cr&eacute;ation des &eacute;l&eacute;ments de la base de donn&eacute;es gr&acirc;ce &agrave; un assistant.</p> 
   <p align="center"><img border="0" width="438" height="353" src="images/bdd117.png"></p> 
   <p>Il faut s&eacute;lectionner le dossier qui va contenir le fichier, saisir le nom de ce fichier et cliquer sur le bouton &laquo;&nbsp;Suivant&nbsp;&raquo;.</p> 
   <p align="center"><img border="0" width="438" height="268" src="images/bdd118.png"></p> 
   <p>La page suivante permet de s&eacute;lectionner les types d'ordres qui seront g&eacute;n&eacute;r&eacute;s. Un clic sur le bouton &laquo;&nbsp;Fin&nbsp;&raquo; permet de g&eacute;n&eacute;rer le fichier et de l'ouvrir dans l'&eacute;diteur associ&eacute; au fichier .sql.</p> 
   <table border="1" cellpadding="4" cellspacing="0" width="100%" align="center"> 
    <tbody>
     <tr bgcolor="#A6A5C2"> 
      <td>Exemple : </td> 
     </tr> 
     <tr> 
      <td> <pre><code><span style="color:blue;">DROP TABLE IF EXISTS</span> Factures;
  <span style="color:blue;">DROP TABLE IF EXISTS</span> Clients;
  <span style="color:blue;">CREATE TABLE</span> Clients (
      id_clients <span style="color:blue">INT</span>(10) <span style="color:blue">NOT NULL</span> AUTO_INCREMENT
    , nom_clients <span style="color:blue">CHAR</span>(150)
    , <span style="color:blue">PRIMARY KEY </span>(id_clients)
  )<span style="color:blue">TYPE</span>=InnoDB;
  <span style="color:blue;">CREATE TABLE</span> Factures (
      id_factures <span style="color:blue">INT</span>(10) <span style="color:blue">NOT NULL</span> AUTO_INCREMENT
    , num_factures <span style="color:blue">CHAR</span>(10)
    , date_factures <span style="color:blue">DATE</span> 
    , id_clients <span style="color:blue">INT</span>(10) 
    , <span style="color:blue">UNIQUE</span> UQ_Factures_1 (num_factures)
    , <span style="color:blue">PRIMARY KEY</span> (id_factures)
    , <span style="color:blue">INDEX</span> (id_clients)
    , <span style="color:blue">FOREIGN KEY</span>FK_Factures_1 (id_clients)
        <span style="color:blue">REFERENCES</span>Clients (id_clients)
  ) <span style="color:blue">TYPE</span>=InnoDB;
  
  <span style="color:blue">CREATE INDEX</span> IX_Factures_1 <span style="color:blue">ON</span> Factures (id_clients <span style="color:blue">ASC</span>);</code></pre> </td> 
     </tr> 
    </tbody>
   </table>
   <br> 
   <p>&nbsp;</p> 
  </div> 
  <!--PIED-->
  <hr> 
  <table border="0" cellpadding="2" cellspacing="0" width="100%" bgcolor="#7B7BC2"> 
   <tbody> 
    <tr> 
     <td rowspan="2" align="center" width="50">&nbsp;</td>
     <td rowspan="2" align="center" width="50"> <a href="chap030.htm" alt="30. Le plug-in EclipseUML "> <img src="FlecheG.gif" alt="30. Le plug-in EclipseUML " align="left" border="0" hspace="0" width="31" height="31"> </a> </td> 
     <td rowspan="2" align="center" width="50"> <a href="partie8.htm" alt="Partie 8 : Annexes"> <img src="FlecheD.gif" alt="Partie 8 : Annexes" align="left" border="0" hspace="0" width="31" height="31"> </a> </td> 
     <td rowspan="2" align="center"> <a href="javascript:window.print()"> <img src="imprimer.gif" width="46" height="40" align="middle" alt="Imprimer" border="0"> </a> </td> 
     <td rowspan="2" align="center"> <a href="index.htm"> <img src="index.gif" alt="Sommaire" align="middle" border="0" hspace="0" width="34" height="31"> </a> </td> 
     <td rowspan="2" align="center"> <a href="indexavecframes.htm" target="_top"> <img src="frame.png" alt="Consulter avec table des mati&egrave;res" align="middle" border="0" hspace="0" width="46" height="40"> </a> </td> 
     <td align="right"> <font color="#FFFFFF" size="5"><b><i>D&eacute;veloppons en Java avec Eclipse&nbsp;&nbsp;</i></b></font><font color="#FFFFFF" size="-2"> v 0.80&nbsp;&nbsp;</font></td> 
     <td rowspan="2" align="center" valign="middle"> <script language="JavaScript1.1">
<!--
hsh = new Date();
hsd = document;
//hsr = hsd.referrer.replace(/[<>]/g, '');
hsr = parent.document.referrer.replace(/[<>]/g,  '');
hsi = '<a href="http://www.xiti.com/xiti.asp?s=128624"';
hsi += ' TARGET="_top"><img width="39" height="25" border=0 ';
hsi += 'src="http://logv23.xiti.com/hit.xiti?s=128624';
hsi += '&p=';
hsi += '&hl=' + hsh.getHours() + 'x' + hsh.getMinutes() + 'x' + hsh.getSeconds();
if(parseFloat(navigator.appVersion)>=4)
{Xiti_s=screen;hsi += '&r=' + Xiti_s.width + 'x' + Xiti_s.height + 'x' + Xiti_s.pixelDepth + 'x' + Xiti_s.colorDepth;}
hsd.writeln(hsi + '&ref=' + hsr.replace(/&/g, '$') + '" title="Mesurez votre audience"></a><\!--');
//-->
</script> 
      <noscript> 
       <a href="http://www.xiti.com/xiti.asp?s=128624" target="_top"><img width="39" height="25" border="0" src="http://logv23.xiti.com/hit.xiti?s=128624&amp;p=&amp;" title="Mesurez votre audience"></a> 
      </noscript> 
      <!--//--> </td> 
    </tr> 
    <tr> 
     <td align="right"><font color="#FFFFFF" size="-2">Copyright (C) 2003-2007 Jean-Michel DOUDOUX &nbsp;&nbsp;</font></td> 
    </tr> 
   </tbody> 
  </table>   
 </body>
</html>