<html>
 <head> 
  <title>L'espace de travail (Workspace)</title> 
  <meta http-equiv="Content-type" content="text/html; charset=ISO-8859-1" /> 
  <meta name="description" content="" /> 
  <meta name="keywords" content="java tutorial cours dej eclipse" /> 
  <meta name="robots" content="all" /> 
  <meta name="revisit-after" content="2 months" /> 
  <meta http-equiv="Content-Language" content="fr-FX" /> 
  <meta name="author" content="Jean Michel DOUDOUX" /> 
  <link href="dej_style.css" rel="stylesheet" type="text/css" /> 
 </head> 
 <body> 
  <!--ENTETE--> 
  <table border="0" cellpadding="2" cellspacing="0" width="100%" bgcolor="#7B7BC2"> 
   <tbody> 
    <tr> 
     <td rowspan="2" align="center" width="50">&nbsp;</td> 
     <td rowspan="2" align="center" width="50"> <a href="chap003.htm" alt="3.  Le plan de travail (Workbench)"> <img src="FlecheG.gif" alt="3.  Le plan de travail (Workbench)" align="left" border="0" hspace="0" width="31" height="31" /> </a> </td> 
     <td rowspan="2" align="center" width="50"> <a href="chap005.htm" alt="5.  Les fonctions pratiques du plan de travail"> <img src="FlecheD.gif" alt="5.  Les fonctions pratiques du plan de travail" align="left" border="0" hspace="0" width="31" height="31" /> </a> </td> 
     <td rowspan="2" align="center"> <a href="javascript:window.print()"> <img src="imprimer.gif" width="46" height="40" align="middle" alt="Imprimer" border="0" /> </a> </td> 
     <td rowspan="2" align="center"> <a href="index.htm"> <img src="index.gif" alt="Sommaire" align="middle" border="0" hspace="0" width="34" height="31" /> </a> </td> 
     <td rowspan="2" align="center"> <a href="indexavecframes.htm" target="_top"> <img src="frame.png" alt="Consulter avec table des mati&egrave;res" align="middle" border="0" hspace="0" width="46" height="40" /> </a> </td> 
     <td align="right"> <font color="#FFFFFF" size="5"><b><i>D&eacute;veloppons en Java avec Eclipse&nbsp;&nbsp;</i></b></font><font color="#FFFFFF" size="-2"> v 0.80&nbsp;&nbsp;</font></td> 
    </tr> 
    <tr> 
     <td align="right"><font color="#FFFFFF" size="-2">Copyright (C) 2003-2007 Jean-Michel DOUDOUX &nbsp;&nbsp;</font></td> 
    </tr> 
   </tbody> 
  </table> 
  <hr /> 
  <p>&nbsp;</p> 
  <h1> 
   <!--idrefpage value="workspace" --> 
   <!--resumetitre value="pr&eacute;sente l'espace de travail qui stocke les projets et leur contenu et d&eacute;taille des op&eacute;rations de base sur les &eacute;l&eacute;ment de l'espace de travail" --> 
   <!--nchpdeb--><a name="chap_4">4. 
    <!--nchpfin--> L'espace de travail (Workspace)</a></h1> 
  <p>&nbsp;</p> 
  <p>&nbsp;</p> 
  <div align="justify"> 
   <p>L'espace de travail est l'entit&eacute; qui permet de conserver les projets et leur contenu. Physiquement c'est un r&eacute;pertoire du syst&egrave;me d'exploitation qui contient une hi&eacute;rarchie de fichiers et de r&eacute;pertoires. Il y a d'ailleurs un r&eacute;pertoire pour chaque projet &agrave; la racine de l'espace de travail.</p> 
   <p>Il est possible de parcourir cette arborescence et d'en modifier les fichiers avec des outils externes &agrave; Eclipse.</p> 
   <p>L'espace de travail contient tous les &eacute;l&eacute;ments d&eacute;velopp&eacute;s pour le projet : il est possible de cr&eacute;er, de dupliquer, de renommer ou de supprimer des &eacute;l&eacute;ments. Ces op&eacute;rations de gestion sont r&eacute;alis&eacute;es dans la vue &quot;Navigateur&quot; de la perspective &quot;Ressource&quot;.</p> 
   <p>&nbsp;</p> 
   <h2> 
    <!--nchpdeb--><a name="chap_4_1">4.1. 
     <!--nchpfin--> La perpective &quot;Ressource&quot;</a></h2> 
   <p>La perspective &quot;Ressource&quot; est la perspective qui s'ouvre par d&eacute;faut au lancement d'Eclipse. Elle a pour but de g&eacute;rer les diff&eacute;rents &eacute;l&eacute;ments qui composent l'espace de travail : projets, dossiers et fichiers. </p> 
   <p>Par d&eacute;faut, cette perspective contient les fen&ecirc;tres suivantes&nbsp;: </p> 
   <ul> 
    <li>la vue &quot;Navigateur&quot; qui affiche les ressources (arborescence des fichiers) de l'espace de travail </li> 
    <li>un &eacute;diteur qui permet d'&eacute;diter une ressource s&eacute;lectionn&eacute;e dans la vue &quot;Navigateur&quot;</li> 
    <li>la vue &quot;Structure&quot; qui permet d'obtenir une arborescence pr&eacute;sentant les grandes lignes de certaines ressources en cours de traitement</li> 
    <li>la vue &quot;T&acirc;ches&quot; qui affiche une liste de t&acirc;che &agrave; effectuer</li> 
   </ul> 
   <p>&nbsp;</p> 
   <h3> 
    <!--nchpdeb--><a name="chap_4_1_1">4.1.1. 
     <!--nchpfin--> La vue &quot;Navigateur&quot;</a></h3> 
   <p>Dans l'espace de travail, chaque projet contient une hi&eacute;rarchie compos&eacute;e de dossiers et de fichiers. La vue &quot;Navigateur&quot; permet de pr&eacute;senter, de naviguer dans l'arborescence et de s&eacute;lectionner une ressource.</p> 
   <p align="center"><img src="images/perspective001.png" width="226" height="201" /></p> 
   <p>A partir de la vue &quot;Navigateur&quot;, il est possible d'ouvrir le fichier s&eacute;lectionn&eacute; dans un &eacute;diteur&nbsp;: </p> 
   <ul> 
    <li>avec l'&eacute;diteur par d&eacute;faut associ&eacute; au type du fichier, il suffit de double cliquer sur le fichier dans le navigateur ou d'utiliser l'option &quot;Ouvrir&quot; du menu contextuel.</li> 
    <li>avec un autre &eacute;diteur en utilisant l'option &quot;Ouvrir Avec&quot; du menu contextuel</li> 
   </ul> 
   <p>L'association d'un type de fichier avec un &eacute;diteur peut &ecirc;tre faite dans les pr&eacute;f&eacute;rences.</p> 
   <p>La&nbsp; vue &quot;Navigateur&quot; contient une option particuli&egrave;rement pratique pour retrouver une ressource&nbsp;: l'outil &quot;Acc&eacute;der &agrave;&quot;. Cet outil permet &agrave; partir d'un motif (Pattern) de retrouver les ressources qui respectent le motif dans leur nom. L'option &quot;Acc&eacute;der &agrave; / Ressource&quot; du menu contextuel de la vue &quot;Navigateur&quot; permet d'ouvrir une bo&icirc;te de dialogue contenant l'outil.</p> 
   <p align="center"><img src="images/perspective002.png" width="346" height="472" /></p> 
   <p>Au fur et &agrave; mesure de la saisie du motif, la liste des fichiers correspondant s'affiche.</p> 
   <p>Il suffit de choisir le fichier et de cliquer sur le bouton &quot;OK&quot; pour fermer la bo&icirc;te de dialogue et s&eacute;lectionner le fichier dans la vue &quot;Navigateur&quot;.</p> 
   <p>Par d&eacute;faut, la vue &quot;Navigateur&quot; affiche tous les projets contenus dans l'espace de travail. Il est possible de limiter la vue &agrave; la hi&eacute;rarchie d'un projet ou d'un dossier en le s&eacute;lectionnant et en utilisant l'option &quot;Suivant&quot; du menu contextuel. </p> 
   <p>Les boutons <img width="73" height="24" src="./images/perspective003.png" /> permettent de passer d'un mode &agrave; l'autre.</p> 
   <p>Le menu contextuel propose aussi des options pour copier, d&eacute;placer, renommer et supprimer une ressource.</p> 
   <p>&nbsp;</p> 
   <h2> 
    <!--nchpdeb--><a name="chap_4_2">4.2. 
     <!--nchpfin--> La cr&eacute;ation de nouvelles entit&eacute;s</a></h2> 
   <p>Dans Eclipse, on peut cr&eacute;er diff&eacute;rents types d'entit&eacute;s qui seront stock&eacute;es dans l'espace de travail &nbsp;: </p> 
   <ul type="disc"> 
    <li>des projets</li> 
    <li>des r&eacute;pertoires pour organiser les projets</li> 
    <li>des ressources de diff&eacute;rents types qui sont des fichiers</li> 
   </ul> 
   <p>Il existe plusieurs fa&ccedil;ons de cr&eacute;er ces entit&eacute;s&nbsp;: </p> 
   <ul type="disc"> 
    <li>l'option &laquo;&nbsp;Nouveau&nbsp;&raquo; du menu &laquo;&nbsp;Fichier&raquo;</li> 
    <li>l'option &laquo;&nbsp;Nouveau&nbsp;&raquo; du menu contextuel de la vue &quot;Navigateur&quot;</li> 
    <li>le bouton &laquo; Assistant nouveau&nbsp;&raquo; dans la barre d'outils</li> 
   </ul> 
   <p>La cr&eacute;ation est r&eacute;alis&eacute;e gr&acirc;ce &agrave; un assistant dont le contenu est dynamique en fonction de l'&eacute;l&eacute;ment &agrave; cr&eacute;er.</p> 
   <p>L'option &quot;Nouveau&quot; du menu &quot;Fichier&quot; ou du menu contextuel de la vue &quot;Navigateur&quot; propose le m&ecirc;me sous menu&nbsp;: </p> 
   <p align="center"><img src="images/workspace001.png" width="106" height="111" /></p> 
   <p>Il est ainsi possible de cr&eacute;er rapidement un projet, un r&eacute;pertoire ou un fichier. Si le fichier est d'un type particulier, un clic sur l'option &quot;Autre&quot; ouvre un assistant qui permet sur sa premi&egrave;re page de s&eacute;lectionner le type de l'entit&eacute; &agrave; cr&eacute;er.</p> 
   <p>&nbsp;</p> 
   <h3> 
    <!--nchpdeb--><a name="chap_4_2_1">4.2.1. 
     <!--nchpfin--> La cr&eacute;ation d'un projet</a></h3> 
   <p>Le projet est l'unit&eacute; de base de l'espace de travail. Chaque ressource doit &ecirc;tre incluse directement dans un projet ou indirectement dans un r&eacute;pertoire appartenant &agrave; un projet.</p> 
   <p>L'assistant permet de s&eacute;lectionner le type du projet &agrave; cr&eacute;er. Il suffit alors de s&eacute;lectionner la famille, le type du projet et de cliquer sur le bouton &quot;Suivant&quot;.</p> 
   <p align="center"><img src="images/workspace002.png" width="400" height="178" /></p> 
   <p> La cr&eacute;ation se fait gr&acirc;ce &agrave; un assistant qui demande le nom du nouveau projet. Ce nom ne doit pas contenir de blanc ou des caract&egrave;res non alphab&eacute;tiques.</p> 
   <p align="center"><img src="images/workspace003.png" width="400" height="213" /></p> 
   <p>Un clic sur le bouton &quot;Fin&quot; d&eacute;clenche la cr&eacute;ation du projet. Le projet apparait dans la vue Navigateur.</p> 
   <p align="center"><img src="images/workspace004.png" width="164" height="76" /></p> 
   <p>Si l'espace d travail contient d&eacute;j&agrave; plusieurs projets, il est possible d'associer un ou plusieurs de ceux ci avec le nouveau en cours de cr&eacute;ation. Pour r&eacute;aliser cette association, il suffit de cliquer sur le bouton &quot;Suivant&quot; pour afficher le second volet de l'assistant. Il suffit de cocher les projets concern&eacute;s.</p> 
   <p align="center"><img src="images/workspace005.png" width="400" height="157" /> </p> 
   <p>Il est possible de cr&eacute;er des projets particuliers selon le type d'applications &agrave; d&eacute;velopper.</p> 
   <p>&nbsp;</p> 
   <h3> 
    <!--nchpdeb--><a name="chap_4_2_2">4.2.2. 
     <!--nchpfin--> La cr&eacute;ation d'un r&eacute;pertoire</a></h3> 
   <p>L'assistant de cr&eacute;ation de r&eacute;pertoire permet de cr&eacute;er un r&eacute;pertoire dans un projet. Par d&eacute;faut, c'est le projet courant qui est s&eacute;lectionn&eacute;.</p> 
   <p align="center"><img src="images/workspace006.png" width="400" height="260" /></p> 
   <p>Il suffit ensuite de saisir le nom sans espace ni caract&egrave;re non alphab&eacute;tique et de cliquer sur le bouton &quot;Fin&quot;. Le nouveau r&eacute;pertoire appara&icirc;t dans la vue &quot;Navigateur&quot;.</p> 
   <p align="center"><img src="images/workspace007.png" width="165" height="108" /></p> 
   <p>&nbsp;</p> 
   <h3> 
    <!--nchpdeb--><a name="chap_4_2_3">4.2.3. 
     <!--nchpfin--> La cr&eacute;ation d'un fichier</a></h3> 
   <p>L'assistant de cr&eacute;ation de fichiers permet de choisir le projet et le r&eacute;pertoire dans lequel le fichier sera cr&eacute;&eacute;. Une fois cette localisation choisie il suffit de saisir le nom du fichier, son extension et de cliquer sur le bouton &quot;Fin&quot;. Ce nom ne doit pas contenir de blanc ou des caract&egrave;res non alphab&eacute;tiques.</p> 
   <p align="center"><img src="images/workspace008.png" width="243" height="297" /></p> 
   <p>Si un &eacute;diteur est associ&eacute; au type du nouveau fichier, l'&eacute;diteur est ouvert avec le nouveau fichier.</p> 
   <p align="center"><img src="images/workspace009.png" width="304" height="118" /></p> 
   <p>&nbsp;</p> 
   <h2> 
    <!--nchpdeb--><a name="chap_4_3">4.3. 
     <!--nchpfin--> La duplication d'un &eacute;l&eacute;ment</a></h2> 
   <p>Dans la vue &quot;Navigateur&quot;, pour dupliquer un &eacute;l&eacute;ment, le plus simple est de faire un cliquer/glisser de l'&eacute;l&eacute;ment en maintenant la touche Ctrl enfonc&eacute;e vers son r&eacute;pertoire de destination dans le navigateur.</p> 
   <p>Il est aussi possible de s&eacute;lectionner l'&eacute;l&eacute;ment dans la vue &quot;Navigateur&quot; et d' effectuer une des op&eacute;rations suivantes : </p> 
  </div> 
  <ul> 
   <li> appuyer sur la combinaison de touches Ctrl + C </li> 
   <li>s&eacute;lectionner l'option &quot;Copier&quot; du menu contextuel</li> 
  </ul> 
  <p>Il suffit alors de s&eacute;lectionner dans la vue &quot;Navigateur&quot; le r&eacute;pertoire de destination et d'effectuer une des op&eacute;rations suivantes : </p> 
  <ul> 
   <li> appuyer sur la combinaison de touches Ctrl + V</li> 
   <li>s&eacute;lectionner l'option &quot;Coller&quot; du menu contextuel</li> 
  </ul> 
  <p>&nbsp;</p> 
  <h2> 
   <!--nchpdeb--><a name="chap_4_4">4.4. 
    <!--nchpfin--> Le d&eacute;placement d'un &eacute;l&eacute;ment</a></h2> 
  <p>Dans la vue &quot;Navigateur&quot;, pour d&eacute;placer un &eacute;l&eacute;ment, le plus simple est de faire un cliquer/glisser de l'&eacute;l&eacute;ment vers son r&eacute;pertoire de destination dans la vue &quot;Navigateur&quot;.</p> 
  <p>Il est aussi possible de s&eacute;lectionner l'option &quot;D&eacute;placer&quot; du menu contextuel associ&eacute; &agrave; cet &eacute;l&eacute;ment et de s&eacute;lectionner le r&eacute;pertoire de destination dans la bo&icirc;te de dialogue.</p> 
  <p align="center"><img src="images/workspace011.png" width="350" height="194" /></p> 
  <p>Si le r&eacute;pertoire de destination s&eacute;lectionn&eacute; est identique au r&eacute;pertoire d'origine du fichier, une message est affich&eacute;.</p> 
  <p align="center"><img src="images/workspace012.png" width="350" height="234" /></p> 
  <p>&nbsp;</p> 
  <h2> 
   <!--nchpdeb--><a name="chap_4_5">4.5. 
    <!--nchpfin--> Renommer un &eacute;l&eacute;ment</a></h2> 
  <p>Pour nommer un &eacute;l&eacute;ment, il suffit de s&eacute;lectionner l'&eacute;l&eacute;ment dans la vue &quot;Navigateur&quot;, de s&eacute;lectionner l'option &quot;Renommer&quot; du menu contextuel, saisir le nouveau nom et appuyer sur la touche &quot;entr&eacute;e&quot;.</p> 
  <p align="center"><img src="images/workspace013.png" width="163" height="139" /></p> 
  <p>&nbsp;</p> 
  <h2> 
   <!--nchpdeb--><a name="chap_4_6">4.6. 
    <!--nchpfin--> La suppression d'un &eacute;l&eacute;ment</a></h2> 
  <p>Pour supprimer un &eacute;l&eacute;ment, il suffit de le s&eacute;lectionner dans la vue &quot;Navigateur&quot; et d'effectuer une des actions suivantes : </p> 
  <ul> 
   <li> 
    <div align="justify">
      choisir l'option &quot;Supprimer&quot; du menu contextuel de l'&eacute;l&eacute;ment 
    </div> </li> 
   <li>appuyer sur la touche Suppr</li> 
   <li>choisir l'option &quot;Supprimer&quot; du menu &quot;Editer&quot;</li> 
  </ul> 
  <div align="justify"> 
   <ap>
     Une bo&icirc;te de dialogue demande de confirmer la suppression. 
    <p align="center"><img src="images/workspace015.png" width="436" height="129" /></p> 
   </ap> 
  </div> 
  <div align="justify"> 
   <h2> 
    <!--nchpdeb--><a name="chap_4_7">4.7. 
     <!--nchpfin--> L'importation</a></h2> 
   <p>L'importation permet d'inclure dans l'espace de travail un certains nombre de fichiers externes. Attention, l'importation ne peut se faire que dans un projet existant.</p> 
   <p>Il faut utiliser le menu &quot;Fichier/Importer&quot;</p> 
   <p align="center"><img width="470" height="297" src="images/workspace016.png" /></p> 
   <p>S&eacute;lectionnez le type de la source d'importation et cliquez sur le bouton &quot;Suivant&quot;</p> 
   <p align="center"><img width="452" height="474" src="images/workspace017.png" /></p> 
   <p>S&eacute;lectionnez le r&eacute;pertoire, puis cochez chacun des &eacute;l&eacute;ments concern&eacute;s.</p> 
   <p>Il est tr&egrave;s important de v&eacute;rifier et de modifier si n&eacute;cessaire le r&eacute;pertoire de destination qui doit &ecirc;tre l'un des projets de l'espace de travail.</p> 
   <p>En cliquant sur le bouton &quot;Filtrer les types ...&quot;, une bo&icirc;te de dialogue permet de s&eacute;lectionner les fichiers concern&eacute;s &agrave; partir de leurs extensions.</p> 
   <p align="center"><img width="344" height="351" src="images/workspace018.png" /></p> 
   <p>Il suffit de s&eacute;lectionner les extensions parmi celles propos&eacute;es, de saisir &eacute;ventuellement d'autres extensions et de cliquer sur le bouton &quot;OK&quot;. Le filtre est alors directement appliqu&eacute; sur la s&eacute;lection.</p> 
   <p>Une fois la s&eacute;lection termin&eacute;e, il suffit de cliquer sur le bouton &quot;Fin&quot; pour lancer l'importation.</p> 
   <p>Au cas ou une ressource existerait d&eacute;j&agrave; dans la destination, un message demande la confirmation du remplacement.<br /> </p> 
   <h2> 
    <!--nchpdeb--><a name="chap_4_8">4.8. 
     <!--nchpfin--> L'exportation</a></h2> 
   <p>Pour exporter tout ou partie du workspace, il faut utiliser le menu &quot;Fichier/Exporter&quot;.</p> 
   <p align="center"><img width="470" height="316" src="images/workspace020.png" /></p> 
   <p>L'assistant demande de s&eacute;lectionner le format d'exportation.</p> 
   <p>Si le format choisi est &quot;Syst&egrave;me de fichiers&quot;, l'assistant demande les informations n&eacute;cessaires : les fichiers &agrave; exporter et le r&eacute;pertoire de destination</p> 
   <p align="center"><img width="496" height="411" src="images/workspace021.png" /></p> 
   <p>Attention : pour que la structure des r&eacute;pertoires soit conserv&eacute;e dans la cible, il faut obligatoirement que les r&eacute;pertoires soient s&eacute;lectionn&eacute;s.</p> 
   <p>Si le format choisi est &quot;Javadoc&quot;, l'assistant demande les informations n&eacute;cessaires : les fichiers &agrave; exporter, le r&eacute;pertoire de destination et les options &agrave; utiliser lors de la g&eacute;n&eacute;ration </p> 
   <p align="center"><img width="528" height="406" src="images/workspace022.png" /></p> 
   <p>Les deux pages suivantes permettent de pr&eacute;ciser des options pour l'outil Javadoc.</p> 
   <p>Un clic sur le bouton &quot;Fin&quot; permet de g&eacute;n&eacute;rer la documentation.</p> 
   <p>Si le format choisi est &quot;Fichier Zip&quot;, l'assistant demande les informations n&eacute;cessaires : les fichiers &agrave; exporter et le nom du fichier zip &agrave; g&eacute;n&eacute;rer.</p> 
   <p align="center"><img width="559" height="416" src="images/workspace023.png" /></p> 
   <p>Un clic sur le bouton &quot;Fin&quot; permet de cr&eacute;er le fichier zip contenant tous les &eacute;l&eacute;ments s&eacute;lectionn&eacute;s.</p> 
   <p>Si le format est &quot;Fichier Jar&quot;, l'assistant demande les informations n&eacute;cessaires : le ou les projets &agrave; exporter, le fichier jar &agrave; cr&eacute;er et les options &agrave; utiliser.</p> 
   <p align="center"><img width="546" height="422" src="images/workspace024.png" /></p> 
   <p>Un clic sur le bouton &quot;Suivant&quot; affiche une nouvelle page de l'assistant pour pr&eacute;ciser certaines options.</p> 
   <p align="center"><img width="472" height="369" src="images/workspace025.png" /></p> 
   <p>Un clic sur le bouton &quot;Suivant&quot; affiche une nouvelle page de l'assistant pour pr&eacute;ciser le fichier manifest.</p> 
   <p align="center"><img width="553" height="506" src="images/workspace026.png" /></p> 
   <p>&nbsp;</p> 
   <h2> 
    <!--nchpdeb--><a name="chap_4_9">4.9. 
     <!--nchpfin-->Lier des ressources</a></h2> 
   <div class="eclipse32"> 
    <p>Il est possible de lier des ressources au projet.</p> 
    <p>Exemple avec un r&eacute;pertoire : cr&eacute;ez une nouvelle entit&eacute; de type dossier</p> 
    <p align="center"><img width="346" height="330" src="images/workspace027.png" /></p> 
    <p>Cliquez sur le bouton &laquo;&nbsp;Options avanc&eacute;es&nbsp;&raquo;</p> 
    <p align="center"><img width="346" height="378" src="images/workspace028.png" /></p> 
    <p>Cochez l'option &laquo;&nbsp;Lier au dossier dans le syst&egrave;me de fichiers&nbsp;&raquo;, cliquez sur le bouton &laquo;&nbsp;Parcourir&nbsp;&raquo; pour s&eacute;lectionner le r&eacute;pertoire concern&eacute;.</p> 
    <p align="center"><img width="346" height="378" src="images/workspace029.png" /></p> 
    <p>Cliquez sur le bouton &laquo;&nbsp;Terminer&nbsp;&raquo;</p> 
    <p align="center"><img width="294" height="110" src="images/workspace030.png" /></p> 
    <p>La ressource li&eacute;e appara&icirc;t avec une petite ic&ocirc;ne <img width="7" height="7" src="images/workspace031.png" /></p> 
   </div> 
   <p>&nbsp;</p> 
   <h2> 
    <!--nchpdeb--><a name="chap_4_10">4.10. 
     <!--nchpfin-->L'option &laquo;&nbsp;Fermer les projets non associ&eacute;s&nbsp;&raquo;</a></h2> 
   <div class="eclipse32"> 
    <p>L'option &laquo;&nbsp;Fermer les projets non associ&eacute;s&nbsp;&raquo; du menu contextuel d'un projet permet de fermer les &eacute;l&eacute;ments ouverts dans le plan de travail qui ne concernent pas le projet courant.</p> 
    <p>Cette option n'est accessible que si au moins un &eacute;l&eacute;ment concern&eacute; est ouvert.</p> 
   </div> 
   <p>&nbsp;</p> 
   <h2> 
    <!--nchpdeb--><a name="chap_4_11">4.11. 
     <!--nchpfin-->Importer une copie d'un projet</a></h2> 
   <div class="eclipse32"> 
    <p>Lors de l'importation d'un projet existant (en utilisant l'option &laquo;&nbsp;Importer&nbsp;&raquo; du menu principal et en s&eacute;lectionnant &laquo;&nbsp;G&eacute;n&eacute;ral / Projets existants dans l'espace de travail&nbsp;&raquo;, il est possible de cr&eacute;er une copie du projet.</p> 
    <p align="center"><img width="372" height="322" src="images/workspace032.png" /></p> 
    <p>Cliquez sur le bouton &laquo;&nbsp;Suivant&nbsp;&raquo;</p> 
    <p align="center"><img width="429" height="353" src="images/workspace033.png" /></p> 
    <p>Pour cr&eacute;er une copie du projet, il faut cocher la case &laquo;&nbsp;Copier les projets dans l'espace de travail&nbsp;&raquo;.</p> 
   </div> 
   <p>&nbsp;</p> 
  </div> 
  <!--PIED--> 
  <hr /> 
  <table border="0" cellpadding="2" cellspacing="0" width="100%" bgcolor="#7B7BC2"> 
   <tbody> 
    <tr> 
     <td rowspan="2" align="center" width="50">&nbsp;</td> 
     <td rowspan="2" align="center" width="50"> <a href="chap003.htm" alt="3.  Le plan de travail (Workbench)"> <img src="FlecheG.gif" alt="3.  Le plan de travail (Workbench)" align="left" border="0" hspace="0" width="31" height="31" /> </a> </td> 
     <td rowspan="2" align="center" width="50"> <a href="chap005.htm" alt="5.  Les fonctions pratiques du plan de travail"> <img src="FlecheD.gif" alt="5.  Les fonctions pratiques du plan de travail" align="left" border="0" hspace="0" width="31" height="31" /> </a> </td> 
     <td rowspan="2" align="center"> <a href="javascript:window.print()"> <img src="imprimer.gif" width="46" height="40" align="middle" alt="Imprimer" border="0" /> </a> </td> 
     <td rowspan="2" align="center"> <a href="index.htm"> <img src="index.gif" alt="Sommaire" align="middle" border="0" hspace="0" width="34" height="31" /> </a> </td> 
     <td rowspan="2" align="center"> <a href="indexavecframes.htm" target="_top"> <img src="frame.png" alt="Consulter avec table des mati&egrave;res" align="middle" border="0" hspace="0" width="46" height="40" /> </a> </td> 
     <td align="right"> <font color="#FFFFFF" size="5"><b><i>D&eacute;veloppons en Java avec Eclipse&nbsp;&nbsp;</i></b></font><font color="#FFFFFF" size="-2"> v 0.80&nbsp;&nbsp;</font></td> 
     <td rowspan="2" align="center" valign="middle"> <script language="JavaScript1.1">
<!--
hsh = new Date();
hsd = document;
//hsr = hsd.referrer.replace(/[<>]/g, '');
hsr = parent.document.referrer.replace(/[<>]/g,  '');
hsi = '<a href="http://www.xiti.com/xiti.asp?s=128624"';
hsi += ' TARGET="_top"><img width="39" height="25" border=0 ';
hsi += 'src="http://logv23.xiti.com/hit.xiti?s=128624';
hsi += '&p=';
hsi += '&hl=' + hsh.getHours() + 'x' + hsh.getMinutes() + 'x' + hsh.getSeconds();
if(parseFloat(navigator.appVersion)>=4)
{Xiti_s=screen;hsi += '&r=' + Xiti_s.width + 'x' + Xiti_s.height + 'x' + Xiti_s.pixelDepth + 'x' + Xiti_s.colorDepth;}
hsd.writeln(hsi + '&ref=' + hsr.replace(/&/g, '$') + '" title="Mesurez votre audience"></a><\!--');
//-->
</script> 
      <noscript> 
       <a href="http://www.xiti.com/xiti.asp?s=128624" target="_top"><img width="39" height="25" border="0" src="http://logv23.xiti.com/hit.xiti?s=128624&amp;p=&amp;" title="Mesurez votre audience" /></a> 
      </noscript> 
      <!--//--> </td> 
    </tr> 
    <tr> 
     <td align="right"><font color="#FFFFFF" size="-2">Copyright (C) 2003-2007 Jean-Michel DOUDOUX &nbsp;&nbsp;</font></td> 
    </tr> 
   </tbody> 
  </table>  
 </body>
</html>